brokali/projectZeroTouch/ESP32C5/main/main.c
// main.c
#include <stdio.h>
#include <string.h>
#include <strings.h>
#include <stdlib.h>
#include <stdint.h>
#include <inttypes.h>
#include <errno.h>
#include <sys/stat.h>
#include <unistd.h>
#include <fcntl.h>
#include <ctype.h>
#include <limits.h>
#include <time.h>
#include <sys/time.h>

#include "esp_heap_caps.h"
#include "esp_psram.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#include "esp_system.h"
#include "esp_log.h"
#include "esp_err.h"

#include "nvs_flash.h"
#include "nvs.h"
#include "esp_netif.h"
#include "esp_wifi.h"
#include "esp_wifi_ap_get_sta_list.h"
#include "esp_event.h"

#include "esp_mac.h"

#include "esp_console.h"
#include "argtable3/argtable3.h"

#include "driver/uart.h"
#include "driver/sdmmc_host.h"
#include "driver/sdspi_host.h"
#include "driver/spi_master.h"
#include "esp_vfs_fat.h"
#include "sdmmc_cmd.h"
#include <dirent.h>

#include "driver/gpio.h"

#include "led_strip.h"

#include "esp_random.h"
#include "mbedtls/ecp.h"
#include "mbedtls/bignum.h"
#include "mbedtls/base64.h"
#if defined(__has_include)
#if __has_include("mbedtls/ctr_drbg.h")
#include "mbedtls/ctr_drbg.h"
#define HAS_MBEDTLS_CTR_DRBG 1
#elif __has_include("mbedtls/private/ctr_drbg.h")
#include "mbedtls/private/ctr_drbg.h"
#define HAS_MBEDTLS_CTR_DRBG 1
#else
#define HAS_MBEDTLS_CTR_DRBG 0
#endif
#else
#define HAS_MBEDTLS_CTR_DRBG 0
#endif
#include "esp_timer.h"
#include "esp_rom_crc.h"
#include "esp_app_format.h"

#include "esp_http_server.h"
#include "esp_http_client.h"
#include "esp_tls.h"
#include "esp_https_ota.h"
#include "esp_ota_ops.h"
#include "esp_crt_bundle.h"
#include "cJSON.h"
#include "esp_netif.h"
#include "lwip/err.h"
#include "lwip/sys.h"
#include "lwip/netdb.h"
#include "lwip/dns.h"
#include "lwip/dhcp.h"
#include "lwip/etharp.h"
#include "lwip/netif.h"
#include "lwip/ip_addr.h"
#include "lwip/ip4_addr.h"
#include "lwip/prot/ethernet.h"
#include "lwip/pbuf.h"
#include "lwip/sockets.h"
#include "linenoise/linenoise.h"
#include "esp_netif_net_stack.h"

#include "attack_handshake.h"
#include "hccapx_serializer.h"
#include "pcap_serializer.h"
#include "frame_analyzer_parser.h"
#include "frame_analyzer_types.h"
#include "sniffer.h"
#include "oled_display.h"
#include "nrf24_jammer.h"
#include "zig_recon.h"
#include "capture_gateway.h"
#include <math.h>

// NimBLE includes for BLE scanning
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/util/util.h"

#include "esp_rom_sys.h"
#include "soc/soc.h"


#if defined(__has_include)
#if __has_include("soc/rtc_cntl_reg.h")
#include "soc/rtc_cntl_reg.h"
#define HAS_RTC_CNTL_REG 1
#endif
#if __has_include("soc/lp_aon_reg.h")
#include "soc/lp_aon_reg.h"
#define HAS_LP_AON_REG 1
#endif
#endif
#ifndef HAS_RTC_CNTL_REG
#define HAS_RTC_CNTL_REG 0
#endif
#ifndef HAS_LP_AON_REG
#define HAS_LP_AON_REG 0
#endif

//Version number
#define JANOS_VERSION "1.7.4"

#define OTA_GITHUB_OWNER "C5Lab"
#define OTA_GITHUB_REPO "projectZero"
#define OTA_ASSET_NAME "projectZero.bin"
#define OTA_HTTP_MAX_BODY (256 * 1024)
#define OTA_TASK_STACK_SIZE 12288
#define OTA_TASK_PRIORITY 5
#define OTA_HTTP_RX_BUFFER_SIZE (8 * 1024)
#define OTA_HTTP_TX_BUFFER_SIZE (2 * 1024)
#define OTA_CHANNEL_MAX_LEN 8
#define OTA_NVS_NAMESPACE "ota"
#define OTA_NVS_KEY_CHANNEL "channel"
#define OTA_DEV_BRANCH "development"
#define OTA_PROJECT_NAME "projectZero"

// WPA-SEC cloud upload
#define WPASEC_NVS_NAMESPACE "wpasec"
#define WPASEC_NVS_KEY       "api_key"
#define WPASEC_URL           "https://wpa-sec.stanev.org/"
#define WPASEC_KEY_MAX_LEN   65

// WiGLE cloud upload
#define WIGLE_NVS_NAMESPACE "wigle"
#define WIGLE_NVS_KEY_NAME  "api_name"
#define WIGLE_NVS_KEY_TOKEN "api_token"
#define WIGLE_URL           "https://api.wigle.net/api/v2/file/upload"
#define WIGLE_KEY_MAX_LEN   65

// WDGWars cloud upload
#define WDGWARS_NVS_NAMESPACE "wdgwars"
#define WDGWARS_NVS_KEY       "api_key"
#define WDGWARS_URL           "https://wdgwars.pl/api/upload-csv"
#define WDGWARS_V2_URL        "https://wdgwars.pl/api/v2/upload-csv"
#define WDGWARS_V2_JOB_URL_BASE "https://wdgwars.pl/api/v2/upload-job/"
#define WDGWARS_HISTORY_URL   "https://wdgwars.pl/api/upload-history?limit=5"
#define WDGWARS_KEY_MAX_LEN   65
#define WDGWARS_MAX_UPLOAD_BYTES (60L * 1024L * 1024L)
#define WDGWARS_RESULT_RATE_LIMITED 3
#define WDGWARS_BACKOFF_BASE_MS 15000
#define WDGWARS_BACKOFF_MAX_MS 120000

#define DISPLAY_NVS_NAMESPACE "display"
#define DISPLAY_NVS_KEY_MODE  "mode"



#define NEOPIXEL_GPIO      27
#define LED_COUNT          1
#define RMT_RES_HZ         (10 * 1000 * 1000)  // 10 MHz

// Boot/flash button (GPIO28) starts sniffer dog on tap, blackout on long-press
#define BOOT_BUTTON_GPIO               28
#define BOOT_BUTTON_TASK_STACK_SIZE    2048
#define BOOT_ACTION_TASK_STACK_SIZE    6144
#define BOOT_BUTTON_TASK_PRIORITY      5
#define BOOT_BUTTON_POLL_DELAY_MS      20
#define BOOT_BUTTON_LONG_PRESS_MS      1000

// GPS UART pins (Marauder compatible)
#define GPS_UART_NUM       UART_NUM_1
#define GPS_TX_PIN         13
#define GPS_RX_PIN         14
#define GPS_BUF_SIZE       1024
#define GPS_BAUD_ATGM336H  9600
#define GPS_BAUD_M5STACK   115200

// SD Card SPI pins (Marauder compatible)
#define SD_MISO_PIN        2
#define SD_MOSI_PIN        7  
#define SD_CLK_PIN         6
#define SD_CS_PIN          10

#define MY_LOG_INFO(tag, fmt, ...) printf("" fmt "\n", ##__VA_ARGS__)

#define MAX_AP_CNT 64
#define MAX_CLIENTS_PER_AP 50
#define MAX_SNIFFER_APS 100
#define MAX_PROBE_REQUESTS 200

extern void init_projectzero_touch_terminal(void);

static const uint8_t channel_view_24ghz_channels[] = {
    1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14};
static const uint8_t channel_view_5ghz_channels[] = {
    36, 40, 44, 48, 52, 56, 60, 64, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 149, 153, 157, 161, 165};

#define CHANNEL_VIEW_24GHZ_CHANNEL_COUNT \
    (sizeof(channel_view_24ghz_channels) / sizeof(channel_view_24ghz_channels[0]))
#define CHANNEL_VIEW_5GHZ_CHANNEL_COUNT \
    (sizeof(channel_view_5ghz_channels) / sizeof(channel_view_5ghz_channels[0]))
#define CHANNEL_VIEW_SCAN_DELAY_MS 2000
#define CHANNEL_VIEW_SCAN_TIMEOUT_ITERATIONS 200

static const char *TAG = "projectZero";

// Probe request data structure
typedef struct {
    uint8_t mac[6];
    char ssid[33];
    int rssi;
    uint32_t last_seen;
} probe_request_t;

// Target BSSID structure for channel monitoring
typedef struct {
    uint8_t bssid[6];
    char ssid[33];
    uint8_t channel;
    wifi_auth_mode_t authmode;
    uint32_t last_seen;
    bool active;
} target_bssid_t;

// Selected stations (clients) for targeted deauth
typedef struct {
    uint8_t mac[6];
    bool active;
} selected_station_t;

