brokali/projectZeroTouch/ESP32C5/main/main.c
static const int dual_band_channels_count = sizeof(dual_band_channels) / sizeof(dual_band_channels[0]);

// ============================================================================
// Wardrive Promisc: Kismet-style tiered channel lists + D-UCB
// ============================================================================

static const uint8_t wdp_ch_24_primary[]   = {1, 6, 11};
static const uint8_t wdp_ch_24_secondary[] = {2, 3, 4, 5, 7, 8, 9, 10, 12, 13};
static const uint8_t wdp_ch_5_non_dfs[]    = {36, 40, 44, 48, 149, 153, 157, 161, 165};
static const uint8_t wdp_ch_5_dfs[]        = {52, 56, 60, 64, 100, 104, 108, 112, 116, 120, 124, 128, 132, 136, 140, 144, 169, 173, 177};

#define WDP_CH_24_PRIMARY_COUNT   (sizeof(wdp_ch_24_primary) / sizeof(wdp_ch_24_primary[0]))
#define WDP_CH_24_SECONDARY_COUNT (sizeof(wdp_ch_24_secondary) / sizeof(wdp_ch_24_secondary[0]))
#define WDP_CH_5_NON_DFS_COUNT    (sizeof(wdp_ch_5_non_dfs) / sizeof(wdp_ch_5_non_dfs[0]))
#define WDP_CH_5_DFS_COUNT        (sizeof(wdp_ch_5_dfs) / sizeof(wdp_ch_5_dfs[0]))
#define WDP_TOTAL_CHANNELS        (WDP_CH_24_PRIMARY_COUNT + WDP_CH_24_SECONDARY_COUNT + WDP_CH_5_NON_DFS_COUNT + WDP_CH_5_DFS_COUNT)

#define WDP_DUCB_GAMMA            0.99
#define WDP_DUCB_C                1.0
#define WDP_DWELL_PRIMARY_MS      500
#define WDP_DWELL_DEFAULT_MS      400
#define WDP_DWELL_DFS_MS          250
#define WDP_INITIAL_CAPACITY      256
#define WDP_PSRAM_RESERVE_BYTES   (64 * 1024)
#define WDP_STATS_INTERVAL_US     (30 * 1000000LL)
#define WDP_FILE_FLUSH_INTERVAL   50
#define WDP_RELOG_DISTANCE_M      25.0   // re-log a known AP after moving this far (WiGLE trilateration)

typedef enum {
    WDP_TIER_24_PRIMARY,
    WDP_TIER_24_SECONDARY,
    WDP_TIER_5_NON_DFS,
    WDP_TIER_5_DFS,
} wdp_channel_tier_t;

typedef struct {
    int channel;
    wdp_channel_tier_t tier;
    double discounted_reward;
    double discounted_pulls;
    int total_pulls;
} wdp_ducb_channel_t;

typedef struct {
    uint8_t  bssid[6];
    char     ssid[33];
    uint8_t  channel;
    int8_t   rssi;                 // latest reading
    wifi_auth_mode_t authmode;
    bool     needs_log;            // pending write to SD (new sighting or re-log)
    int8_t   last_logged_rssi;     // RSSI at the last written row
    bool     last_logged_valid;    // last_logged_lat/lon hold a real position
    double   last_logged_lat;
    double   last_logged_lon;
    // Observation snapshot: position + wall-clock captured at the moment needs_log
    // was set (first sighting or re-log), so the CSV row carries where/when the AP
    // was actually seen — not where/when the batch was flushed to SD.
    bool     obs_gps_valid;
    double   obs_lat;
    double   obs_lon;
    float    obs_alt;
    float    obs_acc;
    time_t   obs_time;             // 0 = clock not yet seeded from GPS at capture time
} wdp_network_t;

// Snapshot the current GPS position + wall-clock into a pending network/BT row.
// Called from the WiFi/BLE observation callbacks the instant needs_log is set, so
// the row is stamped where/when it was seen instead of at flush time.
#define WDP_DECLARE_OBS_SNAPSHOT(TYPE, NAME)                       \
    static inline void NAME(TYPE *o) {                            \
        o->obs_gps_valid = current_gps.valid;                     \
        if (current_gps.valid) {                                  \
            o->obs_lat = current_gps.latitude;                    \
            o->obs_lon = current_gps.longitude;                   \
            o->obs_alt = current_gps.altitude;                    \
            o->obs_acc = current_gps.accuracy;                    \
        }                                                         \
        o->obs_time = g_gps_clock_synced ? time(NULL) : (time_t)0;\
    }
WDP_DECLARE_OBS_SNAPSHOT(wdp_network_t, wdp_snapshot_obs)

// ============================================================================
// Wardrive Trace (KML) — active ONLY during start_wardrive_promisc_trace.
// Produces a single crash-tolerant KML with the track (successive complete
// <Placemark><LineString> segments), Wi-Fi POIs, and BLE-device POIs.
// ============================================================================

// Snapshot of a first-seen Wi-Fi AP or BLE device handed from its radio callback to
// the wardrive task over a bounded queue. The callbacks never touch the SD card.
typedef struct {
    uint8_t          bssid[6];       // Wi-Fi BSSID or BLE advertiser address
    char             ssid[33];       // Wi-Fi SSID or BLE device name
    int8_t           rssi;
    uint8_t          channel;
    wifi_auth_mode_t authmode;
    bool             is_ble;
    bool             is_airtag;
    bool             is_smarttag;
    uint16_t         company_id;
    double           lat;
    double           lon;
    float            alt;
    float            acc;
    time_t           ts;          // detection time (UTC); 0 = clock not seeded yet
} wdp_poi_msg_t;

#define WDP_POI_QUEUE_LEN      64       // Wi-Fi/BLE POI snapshots buffered callback -> task
#define WDP_TRACE_SEG_POINTS   16       // flush a track segment after this many points
#define WDP_TRACE_SEG_MS       15000    // ...or this long since the last segment write
#define WDP_TRACE_MIN_STEP_M   3.0      // minimum movement before a new trace vertex
#define WDP_TRACE_MAX_STEP_M   100.0    // larger jump starts a new line, never a false connector

// Track-segment builder, touched exclusively by wardrive_promisc_task.
typedef struct {
    bool    active;
    double  seg_lat[WDP_TRACE_SEG_POINTS];
    double  seg_lon[WDP_TRACE_SEG_POINTS];
    double  seg_alt[WDP_TRACE_SEG_POINTS];
    int     seg_n;                       // buffered points not yet written
    bool    have_prev;                   // prev_* holds the last written vertex (stitch)
    double  prev_lat, prev_lon, prev_alt;
    bool    have_cur;                    // cur_* holds the last accepted vertex (3 m gate)
    double  cur_lat, cur_lon;
    int64_t last_seg_us;                 // esp_timer time of the last segment write
    int     seg_written;
    int     poi_written;
} wdp_trace_ctx_t;

static wdp_trace_ctx_t   wdp_trace;            // reset at task start; task-owned
static QueueHandle_t     wdp_poi_queue = NULL; // non-NULL only during a trace session
static volatile uint32_t wdp_poi_dropped = 0;  // POIs dropped because the queue was full

