brokali/projectZeroTouch/ESP32C5/main/main.c
static bool wardrive_promisc_active = false;
static TaskHandle_t wardrive_promisc_task_handle = NULL;
static volatile bool antisurv_active = false;
static TaskHandle_t antisurv_task_handle = NULL;
static wdp_ducb_channel_t wdp_ducb_channels[WDP_TOTAL_CHANNELS];
static int wdp_ducb_channel_count = 0;
static double wdp_ducb_discounted_total = 0.0;
static wdp_network_t *wdp_seen_networks = NULL;
static volatile int wdp_seen_count = 0;
static volatile int wdp_seen_capacity = 0;
static volatile bool wdp_needs_grow = false;
static volatile int wdp_dwell_new_networks = 0;
static volatile bool wdp_relog_pending = false;   // a known network needs re-logging (RSSI/position changed)
static volatile int  wdp_relog_writes = 0;        // count of re-observation rows written this session
static volatile int64_t wdp_log_gate_until_us = 0; // drop all logging until this time (startup cooldown)

// ============================================================================
// Radio Mode State (lazy initialization)
// ============================================================================

typedef enum {
    RADIO_MODE_NONE,
    RADIO_MODE_WIFI,
    RADIO_MODE_BLE,
    RADIO_MODE_IEEE802154
} radio_mode_t;

static radio_mode_t current_radio_mode = RADIO_MODE_NONE;
static bool wifi_initialized = false;
static bool netif_initialized = false;
static bool event_loop_initialized = false;
static esp_netif_t *sta_netif_handle = NULL;
static esp_netif_t *ap_netif_handle = NULL;
static bool wifi_event_handler_registered = false;
static bool ip_event_handler_registered = false;
static bool ota_check_started = false;
static bool ota_check_in_progress = false;
static char ota_channel[OTA_CHANNEL_MAX_LEN] = "main";
static bool ota_auto_on_ip = false;
static TaskHandle_t ota_led_task_handle = NULL;
static volatile bool ota_led_active = false;

// ============================================================================
// Memory logging helper (set LOG_MEMORY_INFO to 1 to enable prints)
// ============================================================================
#ifndef LOG_MEMORY_INFO
#define LOG_MEMORY_INFO 1
#endif

static void log_memory_info(const char *context)
{
#if LOG_MEMORY_INFO
    size_t internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL);
    size_t internal_total = heap_caps_get_total_size(MALLOC_CAP_INTERNAL);
    size_t dma_free = heap_caps_get_free_size(MALLOC_CAP_DMA);
    size_t dma_total = heap_caps_get_total_size(MALLOC_CAP_DMA);
    size_t psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    size_t psram_total = heap_caps_get_total_size(MALLOC_CAP_SPIRAM);
    
    MY_LOG_INFO(TAG, "[MEM] %s: Internal=%u/%uKB, DMA=%u/%uKB, PSRAM=%u/%uKB",
           context,
           (unsigned)(internal_free / 1024), (unsigned)(internal_total / 1024),
           (unsigned)(dma_free / 1024), (unsigned)(dma_total / 1024),
           (unsigned)(psram_free / 1024), (unsigned)(psram_total / 1024));
#else
    (void)context;
#endif
}

// ============================================================================
// BLE Scanner state (NimBLE)
// ============================================================================

// Apple Company ID (Little Endian)
#define APPLE_COMPANY_ID        0x004C
// Samsung Company ID (Little Endian)
#define SAMSUNG_COMPANY_ID      0x0075
// Apple Find My Network device type (AirTag, AirPods, etc.)
#define APPLE_FIND_MY_TYPE      0x12

// BLE scan state
static volatile bool bt_scan_active = false;
static volatile bool bt_airtag_scan_active = false;
static TaskHandle_t bt_scan_task_handle = NULL;
static volatile bool nimble_initialized = false;

// BLE device tracking for deduplication
#define BT_INITIAL_CAPACITY 128
static uint8_t (*bt_found_devices)[6] = NULL;
static int bt_found_device_count = 0;
static int bt_found_device_capacity = 0;

// AirTag/SmartTag counters
static int bt_airtag_count = 0;
static int bt_smarttag_count = 0;

// Generic BT device storage for scan_bt command
typedef struct {
    uint8_t addr[6];
    int8_t rssi;
    char name[32];
    uint16_t company_id;
    bool is_airtag;
    bool is_smarttag;
    // Wardrive re-log bookkeeping (used only while wardrive_promisc_active)
    bool   needs_log;
    int8_t last_logged_rssi;
    bool   last_logged_valid;
    double last_logged_lat;
    double last_logged_lon;
    // Observation snapshot captured when needs_log was set (see wdp_network_t).
    bool    obs_gps_valid;
    double  obs_lat;
    double  obs_lon;
    float   obs_alt;
    float   obs_acc;
    time_t  obs_time;
    // Anti-surveillance tracking (used only while antisurv_active)
    int64_t as_first_us;        // first time this device was seen
    int64_t as_last_us;         // most recent sighting
    bool    as_has_origin;      // as_origin_lat/lon hold the first known position
    double  as_origin_lat;
    double  as_origin_lon;
    double  as_max_dist_m;      // furthest we travelled from origin while it stayed visible
    bool    as_alerted;         // already raised as a follower
} bt_device_info_t;

WDP_DECLARE_OBS_SNAPSHOT(bt_device_info_t, bt_snapshot_obs)

static bt_device_info_t *bt_devices = NULL;                 // ~5.5 KB in PSRAM
static int bt_device_count = 0;
static int bt_device_capacity = 0;

// MAC tracking mode for scan_bt with argument
static bool bt_tracking_mode = false;
static uint8_t bt_tracking_mac[6];
static int8_t bt_tracking_rssi = 0;
static bool bt_tracking_found = false;
static char bt_tracking_name[32] = "";

// ============================================================================

// Promiscuous filter (like Marauder)
static const wifi_promiscuous_filter_t sniffer_filter = {
    .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT | WIFI_PROMIS_FILTER_MASK_DATA
};

// Wardrive buffers (static to avoid stack overflow)
static char wardrive_gps_buffer[GPS_BUF_SIZE];
static wifi_ap_record_t *wardrive_scan_results = NULL;      // ~6.4 KB in PSRAM

// Configurable scan channel time (in ms)
static uint32_t g_scan_min_channel_time = 100;
static uint32_t g_scan_max_channel_time = 300;

#define SCAN_TIME_NVS_NAMESPACE "scancfg"
#define SCAN_TIME_NVS_KEY_MIN   "min_time"
#define SCAN_TIME_NVS_KEY_MAX   "max_time"

#define CHANNEL_TIME_MIN_LIMIT 1500   // max allowed value for min_channel_time
#define CHANNEL_TIME_MAX_LIMIT 2000   // max allowed value for max_channel_time

