brokali/projectZeroTouch/ESP32C5/main/main.c
#define FAST_SCAN_MIN_TIME 100   // Fast scan min channel time (ms) - used by blackout/handshake
#define FAST_SCAN_MAX_TIME 300   // Fast scan max channel time (ms) - used by blackout/handshake

static void channel_time_persist_state(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(SCAN_TIME_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Channel time NVS open failed: %s", esp_err_to_name(err));
        return;
    }
    err = nvs_set_u32(handle, SCAN_TIME_NVS_KEY_MIN, g_scan_min_channel_time);
    if (err == ESP_OK) {
        err = nvs_set_u32(handle, SCAN_TIME_NVS_KEY_MAX, g_scan_max_channel_time);
    }
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    nvs_close(handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Channel time NVS save failed: %s", esp_err_to_name(err));
    }
}

static void channel_time_load_state_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(SCAN_TIME_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Channel time NVS read open failed: %s", esp_err_to_name(err));
        return;
    }
    uint32_t min_val = 0, max_val = 0;
    err = nvs_get_u32(handle, SCAN_TIME_NVS_KEY_MIN, &min_val);
    if (err == ESP_OK && min_val >= 1 && min_val <= CHANNEL_TIME_MIN_LIMIT) {
        g_scan_min_channel_time = min_val;
    }
    err = nvs_get_u32(handle, SCAN_TIME_NVS_KEY_MAX, &max_val);
    if (err == ESP_OK && max_val >= 1 && max_val <= CHANNEL_TIME_MAX_LIMIT) {
        g_scan_max_channel_time = max_val;
    }
    nvs_close(handle);
}

// ============================================================================
// Wardrive configuration (bands / channels / data-quality) — persisted in NVS
// Foundation only: loaded at boot and exposed via get_wardrive_config.
// Consumers (wdp_ducb_init, dedup, cooldown...) are wired in later steps.
// ============================================================================

typedef enum {
    WD_BAND_24  = 1 << 0,   // 2.4 GHz WiFi
    WD_BAND_5   = 1 << 1,   // 5 GHz WiFi
    WD_BAND_BLE = 1 << 2,   // Bluetooth LE
} wd_band_flags_t;

#define WD_BAND_ALL (WD_BAND_24 | WD_BAND_5 | WD_BAND_BLE)

typedef enum {
    WD_CH_POPULAR = 0,   // 2.4: 1,6,11 + 5G non-DFS
    WD_CH_ALL     = 1,   // all four tiers (default = current behavior)
    WD_CH_CUSTOM  = 2,   // explicit list in custom_ch[]
} wd_channel_mode_t;

#define WD_CUSTOM_CH_MAX 64

typedef struct {
    uint8_t  bands;                         // wd_band_flags_t bitmask
    uint8_t  ch_mode;                       // wd_channel_mode_t
    uint8_t  custom_ch[WD_CUSTOM_CH_MAX];   // valid when ch_mode == WD_CH_CUSTOM
    uint8_t  custom_ch_count;
    int8_t   wifi_rssi_delta;               // re-log threshold dBm (0 = log once, current behavior)
    int8_t   ble_rssi_delta;                // re-log threshold dBm
    uint16_t startup_cooldown_s;            // drop scans during first N seconds
    uint32_t mem_cap;                       // hard cap on in-RAM entries
    uint8_t  antisurv_sensitivity;          // 0=low, 1=med, 2=high (follower detection)
} wardrive_config_t;

typedef enum {
    WD_AS_LOW  = 0,
    WD_AS_MED  = 1,
    WD_AS_HIGH = 2,
} wd_antisurv_sensitivity_t;

static wardrive_config_t g_wd_cfg;

#define WD_CFG_NVS_NAMESPACE    "wdcfg"
#define WD_CFG_NVS_KEY_BANDS    "bands"
#define WD_CFG_NVS_KEY_CHMODE   "chmode"
#define WD_CFG_NVS_KEY_CUSTOM   "customch"     // blob
#define WD_CFG_NVS_KEY_WDELTA   "wdelta"
#define WD_CFG_NVS_KEY_BDELTA   "bdelta"
#define WD_CFG_NVS_KEY_COOLDOWN "cooldown"
#define WD_CFG_NVS_KEY_MEMCAP   "memcap"
#define WD_CFG_NVS_KEY_ASSENS   "assens"

static void wardrive_config_defaults(void) {
    memset(&g_wd_cfg, 0, sizeof(g_wd_cfg));
    g_wd_cfg.bands              = WD_BAND_ALL;
    g_wd_cfg.ch_mode            = WD_CH_ALL;
    g_wd_cfg.custom_ch_count    = 0;
    g_wd_cfg.wifi_rssi_delta    = 5;
    g_wd_cfg.ble_rssi_delta     = 15;
    g_wd_cfg.startup_cooldown_s = 0;
    g_wd_cfg.mem_cap            = 40000;
    g_wd_cfg.antisurv_sensitivity = WD_AS_MED;
}

static void wardrive_config_persist(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(WD_CFG_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Wardrive cfg NVS open failed: %s", esp_err_to_name(err));
        return;
    }
    nvs_set_u8(handle, WD_CFG_NVS_KEY_BANDS, g_wd_cfg.bands);
    nvs_set_u8(handle, WD_CFG_NVS_KEY_CHMODE, g_wd_cfg.ch_mode);
    nvs_set_blob(handle, WD_CFG_NVS_KEY_CUSTOM, g_wd_cfg.custom_ch, g_wd_cfg.custom_ch_count);
    nvs_set_i8(handle, WD_CFG_NVS_KEY_WDELTA, g_wd_cfg.wifi_rssi_delta);
    nvs_set_i8(handle, WD_CFG_NVS_KEY_BDELTA, g_wd_cfg.ble_rssi_delta);
    nvs_set_u16(handle, WD_CFG_NVS_KEY_COOLDOWN, g_wd_cfg.startup_cooldown_s);
    nvs_set_u32(handle, WD_CFG_NVS_KEY_MEMCAP, g_wd_cfg.mem_cap);
    nvs_set_u8(handle, WD_CFG_NVS_KEY_ASSENS, g_wd_cfg.antisurv_sensitivity);
    err = nvs_commit(handle);
    nvs_close(handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Wardrive cfg NVS save failed: %s", esp_err_to_name(err));
    }
}

static void wardrive_config_load_from_nvs(void) {
    wardrive_config_defaults();

    nvs_handle_t handle;
    esp_err_t err = nvs_open(WD_CFG_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return;   // first boot: keep defaults
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Wardrive cfg NVS read open failed: %s", esp_err_to_name(err));
        return;
    }

    uint8_t u8;
    if (nvs_get_u8(handle, WD_CFG_NVS_KEY_BANDS, &u8) == ESP_OK && (u8 & WD_BAND_ALL)) {
        g_wd_cfg.bands = u8 & WD_BAND_ALL;
    }
    if (nvs_get_u8(handle, WD_CFG_NVS_KEY_CHMODE, &u8) == ESP_OK && u8 <= WD_CH_CUSTOM) {
        g_wd_cfg.ch_mode = u8;
    }

    uint8_t tmp[WD_CUSTOM_CH_MAX];
    size_t blob_len = sizeof(tmp);
    if (nvs_get_blob(handle, WD_CFG_NVS_KEY_CUSTOM, tmp, &blob_len) == ESP_OK &&
        blob_len <= WD_CUSTOM_CH_MAX) {
        memcpy(g_wd_cfg.custom_ch, tmp, blob_len);
        g_wd_cfg.custom_ch_count = (uint8_t)blob_len;
    }

    int8_t i8;
    if (nvs_get_i8(handle, WD_CFG_NVS_KEY_WDELTA, &i8) == ESP_OK && i8 >= 0 && i8 <= 50) {
        g_wd_cfg.wifi_rssi_delta = i8;
    }
    if (nvs_get_i8(handle, WD_CFG_NVS_KEY_BDELTA, &i8) == ESP_OK && i8 >= 0 && i8 <= 50) {
        g_wd_cfg.ble_rssi_delta = i8;
    }

    uint16_t u16;
    if (nvs_get_u16(handle, WD_CFG_NVS_KEY_COOLDOWN, &u16) == ESP_OK) {
        g_wd_cfg.startup_cooldown_s = u16;
    }

