brokali/projectZeroTouch/ESP32C5/main/main.c
enum ApplicationState {
    DEAUTH,
    DEAUTH_EVIL_TWIN,
    EVIL_TWIN_PASS_CHECK,
    IDLE,
    DRAGON_DRAIN,
    SAE_OVERFLOW
};

volatile enum ApplicationState applicationState = IDLE;

static wifi_ap_record_t g_scan_results[MAX_AP_CNT];
static uint16_t g_scan_count = 0;
static volatile bool g_scan_in_progress = false;
static volatile bool g_scan_done = false;
static volatile bool g_scan_teardown_in_progress = false; // set when cancelling a scan to switch radio mode (suppresses misleading failure log)
static volatile uint32_t g_last_scan_status = 1; // 0 => success, non-zero => failure/unknown
static int64_t g_scan_start_time_us = 0;

static int g_selected_indices[MAX_AP_CNT];
static int g_selected_count = 0;

char * evilTwinSSID = NULL;
char * evilTwinPassword = NULL;
char * portalSSID = NULL;  // SSID for standalone portal mode
int connectAttemptCount = 0;
led_strip_handle_t strip;
static bool last_password_wrong = false;

typedef struct {
    uint8_t r;
    uint8_t g;
    uint8_t b;
} led_color_t;

#define LED_BRIGHTNESS_MIN        1U
#define LED_BRIGHTNESS_MAX        100U
#define LED_BRIGHTNESS_DEFAULT    5U

static const led_color_t LED_COLOR_IDLE = {0, 255, 0};

static led_color_t led_current_color = {0, 0, 0};
static bool led_initialized = false;
static bool led_user_enabled = true;
static uint8_t led_brightness_percent = LED_BRIGHTNESS_DEFAULT;

#define LED_NVS_NAMESPACE "ledcfg"
#define LED_NVS_KEY_ENABLED "enabled"
#define LED_NVS_KEY_LEVEL   "level"

static uint8_t led_scale_component(uint8_t value) {
    if (value == 0) {
        return 0;
    }
    uint32_t scaled = (uint32_t)value * led_brightness_percent + 99U;
    scaled /= 100U;
    if (scaled > 255U) {
        scaled = 255U;
    }
    return (uint8_t)scaled;
}

static esp_err_t led_commit_color(uint8_t r, uint8_t g, uint8_t b) {
    if (!led_initialized || strip == NULL) {
        return ESP_ERR_INVALID_STATE;
    }

    esp_err_t err;
    if (!led_user_enabled || (r == 0 && g == 0 && b == 0)) {
        err = led_strip_clear(strip);
    } else {
        err = led_strip_set_pixel(strip, 0, led_scale_component(r), led_scale_component(g), led_scale_component(b));
    }

    if (err == ESP_OK) {
        err = led_strip_refresh(strip);
    }
    return err;
}

static esp_err_t led_apply_current(void) {
    return led_commit_color(led_current_color.r, led_current_color.g, led_current_color.b);
}

static esp_err_t led_set_color(uint8_t r, uint8_t g, uint8_t b) {
    led_current_color = (led_color_t){r, g, b};
    return led_commit_color(r, g, b);
}

static esp_err_t led_clear(void) {
    led_current_color = (led_color_t){0, 0, 0};
    return led_commit_color(0, 0, 0);
}

static esp_err_t led_set_idle(void) {
    return led_set_color(LED_COLOR_IDLE.r, LED_COLOR_IDLE.g, LED_COLOR_IDLE.b);
}

static esp_err_t led_set_enabled(bool enabled) {
    led_user_enabled = enabled;
    if (!led_initialized) {
        return ESP_OK;
    }
    return led_apply_current();
}

static bool led_is_enabled(void) {
    return led_user_enabled;
}

static esp_err_t led_set_brightness(uint8_t percent) {
    if (percent < LED_BRIGHTNESS_MIN) {
        percent = LED_BRIGHTNESS_MIN;
    } else if (percent > LED_BRIGHTNESS_MAX) {
        percent = LED_BRIGHTNESS_MAX;
    }

    led_brightness_percent = percent;

    if (!led_initialized) {
        return ESP_OK;
    }

    if (!led_user_enabled) {
        return led_commit_color(0, 0, 0);
    }

    return led_apply_current();
}

static void led_persist_state(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(LED_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "LED config save open failed: %s", esp_err_to_name(err));
        return;
    }

    esp_err_t write_err = nvs_set_u8(handle, LED_NVS_KEY_ENABLED, led_user_enabled ? 1U : 0U);
    if (write_err == ESP_OK) {
        write_err = nvs_set_u8(handle, LED_NVS_KEY_LEVEL, led_brightness_percent);
    }
    if (write_err == ESP_OK) {
        write_err = nvs_commit(handle);
    }

    nvs_close(handle);

    if (write_err != ESP_OK) {
        ESP_LOGW(TAG, "LED config save failed: %s", esp_err_to_name(write_err));
    }
}

static void led_load_state_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(LED_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "LED config load open failed: %s", esp_err_to_name(err));
        return;
    }

    uint8_t enabled_value = 0;
    err = nvs_get_u8(handle, LED_NVS_KEY_ENABLED, &enabled_value);
    if (err == ESP_OK) {
        led_user_enabled = enabled_value != 0;
    } else if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "LED enabled read failed: %s", esp_err_to_name(err));
    }

    uint8_t level_value = 0;
    err = nvs_get_u8(handle, LED_NVS_KEY_LEVEL, &level_value);
    if (err == ESP_OK) {
        if (level_value >= LED_BRIGHTNESS_MIN && level_value <= LED_BRIGHTNESS_MAX) {
            led_brightness_percent = level_value;
        } else {
            ESP_LOGW(TAG, "LED brightness %u out of range, keeping %u", level_value, led_brightness_percent);
        }
    } else if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "LED brightness read failed: %s", esp_err_to_name(err));
    }

    nvs_close(handle);
}

static void led_boot_sequence(void) {
    led_current_color = (led_color_t){0, 0, 0};

    if (!led_initialized) {
        return;
    }

    if (!led_user_enabled) {
        (void)led_commit_color(0, 0, 0);
        return;
    }

    (void)led_commit_color(0, 0, 0);
    vTaskDelay(pdMS_TO_TICKS(50));
    (void)led_set_idle();
    vTaskDelay(pdMS_TO_TICKS(100));
}

// SD card HTML file management (allocated in PSRAM)
#define MAX_HTML_FILES 50
#define MAX_HTML_FILENAME 64
#define SD_PATH_MAX 192
static char (*sd_html_files)[MAX_HTML_FILENAME] = NULL;     // ~3.2 KB in PSRAM
static int sd_html_count = 0;
static char* custom_portal_html = NULL;
static bool sd_card_mounted = false;
static sdmmc_card_t *sd_card_handle = NULL;
static int sd_mount_freq_khz = 0;
#define MAX_SSID_PRESETS 64
#define MAX_SSID_NAME_LEN 32
#define SSID_PRESET_PATH "/sdcard/lab/ssid.txt"
#define SSIDS_FILE_PATH  "/sdcard/lab/ssids.txt"
#define HOME_FILE_PATH   "/sdcard/lab/home.txt"
#define MAX_HOME_NETWORKS 16

