brokali/projectZeroTouch/ESP32C5/main/main.c
// Whitelist for BSSID protection (allocated in PSRAM)
#define MAX_WHITELISTED_BSSIDS 150
typedef struct {
    uint8_t bssid[6];
} whitelisted_bssid_t;
static whitelisted_bssid_t *whiteListedBssids = NULL;       // ~0.9 KB in PSRAM
static int whitelistedBssidsCount = 0;

// ============================================================================
// PSRAM buffer initialization (must be after all pointer declarations)
// ============================================================================

static bool init_psram_buffers(void)
{
    sniffer_aps = heap_caps_calloc(MAX_SNIFFER_APS, sizeof(sniffer_ap_t), MALLOC_CAP_SPIRAM);
    probe_requests = heap_caps_calloc(MAX_PROBE_REQUESTS, sizeof(probe_request_t), MALLOC_CAP_SPIRAM);
    bt_found_devices = heap_caps_calloc(BT_INITIAL_CAPACITY, sizeof(*bt_found_devices), MALLOC_CAP_SPIRAM);
    bt_devices = heap_caps_calloc(BT_INITIAL_CAPACITY, sizeof(bt_device_info_t), MALLOC_CAP_SPIRAM);
    wardrive_scan_results = heap_caps_calloc(MAX_AP_CNT, sizeof(wifi_ap_record_t), MALLOC_CAP_SPIRAM);
    handshake_targets = heap_caps_calloc(MAX_AP_CNT, sizeof(wifi_ap_record_t), MALLOC_CAP_SPIRAM);
    sd_html_files = heap_caps_calloc(MAX_HTML_FILES, MAX_HTML_FILENAME, MALLOC_CAP_SPIRAM);
    target_bssids = heap_caps_calloc(MAX_TARGET_BSSIDS, sizeof(target_bssid_t), MALLOC_CAP_SPIRAM);
    whiteListedBssids = heap_caps_calloc(MAX_WHITELISTED_BSSIDS, sizeof(whitelisted_bssid_t), MALLOC_CAP_SPIRAM);
    selected_stations = heap_caps_calloc(MAX_SELECTED_STATIONS, sizeof(selected_station_t), MALLOC_CAP_SPIRAM);
    hs_ap_targets = heap_caps_calloc(HS_MAX_APS, sizeof(hs_ap_target_t), MALLOC_CAP_SPIRAM);
    hs_clients = heap_caps_calloc(HS_MAX_CLIENTS, sizeof(hs_client_entry_t), MALLOC_CAP_SPIRAM);
    ducb_channels = heap_caps_calloc(dual_band_channels_count, sizeof(ducb_channel_t), MALLOC_CAP_SPIRAM);
    wdp_seen_networks = heap_caps_calloc(WDP_INITIAL_CAPACITY, sizeof(wdp_network_t), MALLOC_CAP_SPIRAM);
    wdp_seen_capacity = WDP_INITIAL_CAPACITY;
    
    if (!sniffer_aps || !probe_requests || !bt_found_devices || !bt_devices || !wardrive_scan_results ||
        !handshake_targets || !sd_html_files || !target_bssids || !whiteListedBssids || !selected_stations ||
        !hs_ap_targets || !hs_clients || !ducb_channels || !wdp_seen_networks) {
        MY_LOG_INFO(TAG, "PSRAM allocation failed!");
        return false;
    }
    bt_found_device_capacity = BT_INITIAL_CAPACITY;
    bt_device_capacity = BT_INITIAL_CAPACITY;
    return true;
}

#define VENDOR_RECORD_SIZE 64
#define VENDOR_RECORD_NAME_BYTES (VENDOR_RECORD_SIZE - 4)
#define MAX_VENDOR_NAME_LEN (VENDOR_RECORD_NAME_BYTES + 1)
#define SD_OUI_BIN_PATH "/sdcard/lab/oui_wifi.bin"
#define VENDOR_NVS_NAMESPACE "vendorcfg"
#define VENDOR_NVS_KEY_ENABLED "enabled"
#define GPS_NVS_NAMESPACE "gpscfg"
#define GPS_NVS_KEY_MODULE "module"

// Boot button configuration (stored in NVS)
#define BOOTCFG_NVS_NAMESPACE "bootcfg"
#define BOOTCFG_KEY_SHORT_CMD  "short_cmd"
#define BOOTCFG_KEY_LONG_CMD   "long_cmd"
#define BOOTCFG_KEY_SHORT_EN   "short_en"
#define BOOTCFG_KEY_LONG_EN    "long_en"
#define BOOTCFG_CMD_MAX_LEN    192

typedef struct {
    char command[BOOTCFG_CMD_MAX_LEN];
} boot_action_params_t;

static const char* boot_allowed_commands[] = {
    "start_blackout",
    "start_sniffer_dog",
    "channel_view",
    "packet_monitor",
    "start_sniffer",
    "scan_networks",
    "start_gps_raw",
    "start_wardrive",
    "deauth_detector",
    "list_sd",
    "select_html",
    "start_portal"
};
static const size_t boot_allowed_command_count = sizeof(boot_allowed_commands) / sizeof(boot_allowed_commands[0]);

typedef enum {
    BOOT_FLOW_VALID = 0,
    BOOT_FLOW_INVALID_COMMAND,
    BOOT_FLOW_MALFORMED
} boot_flow_validation_result_t;

typedef struct {
    bool enabled;
    char command[BOOTCFG_CMD_MAX_LEN];
} boot_action_config_t;

typedef struct {
    boot_action_config_t short_press;
    boot_action_config_t long_press;
} boot_config_t;

static boot_config_t boot_config = {0};

static char vendor_lookup_buffer[MAX_VENDOR_NAME_LEN];
static bool vendor_file_checked = false;
static bool vendor_file_present = false;
static uint8_t vendor_last_oui[3] = {0};
static bool vendor_last_valid = false;
static bool vendor_last_hit = false;
static bool vendor_lookup_enabled = false;
static size_t vendor_record_count = 0;
static display_type_t display_forced_mode = DISPLAY_NONE; /* DISPLAY_NONE = auto */


// Methods forward declarations
static int cmd_scan_networks(int argc, char **argv);
static int cmd_show_scan_results(int argc, char **argv);
static int cmd_inspect_network(int argc, char **argv);
static int cmd_select_networks(int argc, char **argv);
static int cmd_unselect_networks(int argc, char **argv);
static int cmd_select_stations(int argc, char **argv);
static int cmd_unselect_stations(int argc, char **argv);
static int cmd_start_beacon_spam(int argc, char **argv);
static int cmd_start_evil_twin(int argc, char **argv);
static int cmd_start_handshake(int argc, char **argv);
static int cmd_save_handshake(int argc, char **argv);
static int cmd_start_gps_raw(int argc, char **argv);
static int cmd_gps_set(int argc, char **argv);
static int cmd_set_gps_position(int argc, char **argv);
static int cmd_set_gps_position_cap(int argc, char **argv);
static int cmd_start_wardrive(int argc, char **argv);
static int cmd_start_sniffer(int argc, char **argv);
static int cmd_start_sniffer_noscan(int argc, char **argv);
static int cmd_packet_monitor(int argc, char **argv);
static int cmd_start_ap_locator(int argc, char **argv);
static int cmd_channel_view(int argc, char **argv);
static int cmd_show_sniffer_results(int argc, char **argv);
static int cmd_clear_sniffer_results(int argc, char **argv);
static int cmd_show_sniffer_results_vendor(int argc, char **argv);
static int cmd_show_probes(int argc, char **argv);
static int cmd_list_probes(int argc, char **argv);
static int cmd_show_probes_vendor(int argc, char **argv);
static int cmd_list_probes_vendor(int argc, char **argv);
static int cmd_sniffer_debug(int argc, char **argv);
static int cmd_start_blackout(int argc, char **argv);
static int cmd_ping(int argc, char **argv);
static int cmd_boot_button(int argc, char **argv);
static int cmd_start_portal(int argc, char **argv);
static int cmd_start_admin_portal(int argc, char **argv);
static int cmd_start_rogueap(int argc, char **argv);
static int cmd_start_rogue_gitm(int argc, char **argv);
static int cmd_start_karma(int argc, char **argv);
static int cmd_list_sd(int argc, char **argv);
static int cmd_sd_status(int argc, char **argv);
static int cmd_sd_benchmark(int argc, char **argv);
static int cmd_list_dir(int argc, char **argv);
static int cmd_list_ssid(int argc, char **argv);
static int cmd_list_ssids(int argc, char **argv);
static int cmd_add_ssid(int argc, char **argv);
static int cmd_remove_ssid(int argc, char **argv);
static int cmd_home_list(int argc, char **argv);
static int cmd_home_add(int argc, char **argv);
static int cmd_home_remove(int argc, char **argv);
static int cmd_start_beacon_spam_ssids(int argc, char **argv);
static int start_beacon_spam_internal(void);
static int cmd_select_html(int argc, char **argv);
static int cmd_show_pass(int argc, char **argv);
static int cmd_file_delete(int argc, char **argv);
static int cmd_start_pcap(int argc, char **argv);
static int cmd_stop(int argc, char **argv);
static int cmd_init_nrf24(int argc, char **argv);
static int cmd_start_jammer24(int argc, char **argv);
static int cmd_start_zig_recon(int argc, char **argv);
static int cmd_zig_recon_status(int argc, char **argv);
static int cmd_zig_recon_list(int argc, char **argv);
static int cmd_zig_recon_nodes(int argc, char **argv);
static int cmd_zig_recon_clear(int argc, char **argv);
static int cmd_wifi_connect(int argc, char **argv);
static int cmd_capture_gateway(int argc, char **argv);
static int cmd_list_hosts(int argc, char **argv);
static int cmd_list_hosts_vendor(int argc, char **argv);
static int cmd_start_nmap(int argc, char **argv);
static int cmd_arp_ban(int argc, char **argv);
static void arp_ban_task(void *pvParameters);
static int cmd_reboot(int argc, char **argv);
static int cmd_led(int argc, char **argv);
static int cmd_vendor(int argc, char **argv);
static int cmd_display(int argc, char **argv);
static int cmd_download(int argc, char **argv);
static int cmd_wpasec_key(int argc, char **argv);
static int cmd_wpasec_upload(int argc, char **argv);
static int cmd_wigle_key(int argc, char **argv);
static int cmd_wigle_upload(int argc, char **argv);
static int cmd_wdgwars_key(int argc, char **argv);
static int cmd_wdgwars_upload(int argc, char **argv);
static int cmd_upload_state(int argc, char **argv);
static int cmd_wardrive_files(int argc, char **argv);
static int cmd_wardrive_cleanup(int argc, char **argv);
static int cmd_wardrive_fix(int argc, char **argv);
static int cmd_channel_time(int argc, char **argv);
static int cmd_ota_check(int argc, char **argv);
static int cmd_ota_list(int argc, char **argv);
static int cmd_ota_channel(int argc, char **argv);
static int cmd_ota_info(int argc, char **argv);
static int cmd_ota_boot(int argc, char **argv);
static esp_err_t start_background_scan(uint32_t min_time, uint32_t max_time);
static void print_scan_results(void);
static void wsl_bypasser_send_deauth_frame_multiple_aps(wifi_ap_record_t *ap_records, size_t count);
// Target BSSID management functions
static void save_target_bssids(void);
static esp_err_t quick_channel_scan(void);
static bool check_channel_changes(void);
static void update_target_channels(wifi_ap_record_t *scan_results, uint16_t scan_count);
// Attack task forward declarations
static void deauth_attack_task(void *pvParameters);
static void blackout_attack_task(void *pvParameters);
static void sae_attack_task(void *pvParameters);
static void handshake_attack_task(void *pvParameters);
static void handshake_attack_task_selected(void);
static void handshake_attack_task_sniffer(void);
static void beacon_spam_task(void *pvParameters);
static bool check_handshake_file_exists(const char *ssid);
static bool check_handshake_file_exists_by_bssid(const uint8_t *bssid);
static void handshake_cleanup(void);
static void attack_network_with_burst(const wifi_ap_record_t *ap);
static const char *display_mode_to_str(display_type_t mode);
static bool display_mode_from_str(const char *s, display_type_t *out_mode);
static void display_mode_load_from_nvs(void);
static void display_mode_save_to_nvs(display_type_t mode);
// D-UCB and sniffer handshake helpers
static void ducb_init(void);
static int ducb_select_channel(void);
static void ducb_update(int channel_idx, double reward);
static void hs_sniffer_promiscuous_cb(void *buf, wifi_promiscuous_pkt_type_t type);
static void hs_send_targeted_deauth(const uint8_t *station_mac, const uint8_t *ap_bssid, uint8_t channel);
static bool hs_save_handshake_to_sd(int ap_idx);
static void gps_raw_task(void *pvParameters);
// Wardrive promisc helpers
static void wdp_ducb_init(const wardrive_config_t *cfg);
static int wdp_ducb_select_channel(void);
static void wdp_ducb_update(int channel_idx, double reward);
static int wdp_get_dwell_ms(wdp_channel_tier_t tier);
static void wdp_promiscuous_cb(void *buf, wifi_promiscuous_pkt_type_t type);
static void wardrive_promisc_task(void *pvParameters);
static int cmd_start_wardrive_promisc(int argc, char **argv);
static int cmd_start_wardrive_promisc_trace(int argc, char **argv);
static int cmd_start_wardrive_promisc_impl(int argc, char **argv, bool trace_enabled);
// DNS server task
static void dns_server_task(void *pvParameters);
// Portal HTTP handlers
static esp_err_t root_handler(httpd_req_t *req);
static esp_err_t portal_handler(httpd_req_t *req);
static esp_err_t login_handler(httpd_req_t *req);
static esp_err_t get_handler(httpd_req_t *req);
static esp_err_t save_handler(httpd_req_t *req);
static esp_err_t android_captive_handler(httpd_req_t *req);
static esp_err_t ios_captive_handler(httpd_req_t *req);
static esp_err_t captive_detection_handler(httpd_req_t *req);
// Admin portal HTTP handlers
static esp_err_t admin_root_handler(httpd_req_t *req);
static esp_err_t admin_list_handler(httpd_req_t *req);
static esp_err_t admin_download_handler(httpd_req_t *req);
static esp_err_t admin_read_handler(httpd_req_t *req);
static esp_err_t admin_upload_handler(httpd_req_t *req);
static esp_err_t admin_write_handler(httpd_req_t *req);
static esp_err_t admin_rename_handler(httpd_req_t *req);
static esp_err_t admin_delete_handler(httpd_req_t *req);
// Sniffer functions
static void sniffer_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type);
static void sniffer_process_scan_results(void);
static void sniffer_merge_scan_results(void);
static void sniffer_init_selected_networks(void);
static void sniffer_channel_hop(void);
static void channel_view_task(void *pvParameters);
static void channel_view_stop(void);
static void channel_view_publish_counts(void);
// Packet monitor functions
static void packet_monitor_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type);
static void packet_monitor_task(void *pvParameters);
static void packet_monitor_shutdown(void);
static void packet_monitor_stop(void);
// AP locator functions
static void ap_locator_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type);
static void ap_locator_task(void *pvParameters);
static void ap_locator_shutdown(void);
static void ap_locator_stop(void);
// Sniffer Dog functions
static int cmd_start_sniffer_dog(int argc, char **argv);
static void sniffer_dog_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type);
static void sniffer_dog_task(void *pvParameters);
static void sniffer_dog_channel_hop(void);
static void sniffer_channel_task(void *pvParameters);
static bool is_multicast_mac(const uint8_t *mac);
// Deauth detector functions
static int cmd_deauth_detector(int argc, char **argv);
static void deauth_detector_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type);
static void deauth_detector_task(void *pvParameters);
static void deauth_detector_channel_hop(void);
// BLE scanner functions (NimBLE)
static int cmd_scan_bt(int argc, char **argv);
static int cmd_scan_airtag(int argc, char **argv);
static void bt_scan_stop(void);
static void bt_scan_task(void *pvParameters);
static void bt_airtag_scan_task(void *pvParameters);
static bool is_broadcast_bssid(const uint8_t *bssid);
static bool is_own_device_mac(const uint8_t *mac);
static void add_client_to_ap(int ap_index, const uint8_t *client_mac, int rssi);
// Wardrive functions
static esp_err_t init_gps_uart(int baud_rate);
static int gps_get_baud_for_module(gps_module_t module);
static const char *gps_get_module_name(gps_module_t module);
static bool gps_module_uses_external_feed(gps_module_t module);
static bool gps_module_uses_external_cap_feed(gps_module_t module);
static const char *gps_external_position_command_name(gps_module_t module);
static void gps_sync_from_selected_external_source(void);
static void gps_load_state_from_nvs(void);
static void gps_save_state_to_nvs(void);
static esp_err_t init_sd_card(void);
static bool sd_mkdir_recursive(const char *path);
static esp_err_t create_sd_directories(void);
static void sd_sync(void);
static void safe_restart(void);
static bool parse_gps_nmea(const char* nmea_sentence);
static void get_timestamp_string(char* buffer, size_t size);
static void format_epoch_utc(time_t t, char* buffer, size_t size);
static const char* get_auth_mode_wiggle(wifi_auth_mode_t mode);
static bool wait_for_gps_fix(int timeout_seconds);
static int find_next_wardrive_file_number(void);
static void wardrive_make_session_base(char *out, size_t out_sz);
// PCAP capture functions
static int find_next_pcap_file_number(void);
static void pcap_radio_promiscuous_cb(void *buf, wifi_promiscuous_pkt_type_t type);
static void pcap_enqueue_frame(const uint8_t *data, uint16_t len);
static void pcap_enqueue_frame_at(const uint8_t *data, uint16_t len,
                                  int64_t timestamp_us);
static void pcap_writer_task(void *param);
static void pcap_abort_start(void);
static void pcap_stats_snapshot(pcap_stats_snapshot_t *snapshot);
static bool pcap_normalize_basename(const char *requested, char *normalized,
                                     size_t normalized_size);
static err_t pcap_netif_input_hook(struct pbuf *p, struct netif *inp);
static err_t pcap_netif_linkoutput_hook(struct netif *netif, struct pbuf *p);
static bool pcap_rate_limiter_start(void);
static void pcap_rate_limiter_stop(void);
static void pcap_rate_limiter_task(void *param);
static void pcap_arp_spoof_task(void *param);

static bool wigle_split_key_pair(const char *input,
                                 char *api_name,
                                 size_t api_name_sz,
                                 char *api_token,
                                 size_t api_token_sz);
// Portal data logging functions
static void save_evil_twin_password(const char* ssid, const char* password);
static void save_portal_data(const char* ssid, const char* form_data);
// Whitelist functions
static void load_whitelist_from_sd(void);
static bool is_bssid_whitelisted(const uint8_t *bssid);
// SAE WPA3 attack methods forward declarations:
//add methods declarations below:
static void inject_sae_commit_frame();
static void prepareAttack(const wifi_ap_record_t ap_record);
static void update_spoofed_src_random(void);
static int crypto_init(void);
static int trng_random_callback(void *ctx, unsigned char *output, size_t len);
void wifi_sniffer_callback_v1(void *buf, wifi_promiscuous_pkt_type_t type);
static void parse_sae_commit(const wifi_promiscuous_pkt_t *pkt);

//add variables declarations below:
//SAE properties:
static int frame_count = 0;
static int64_t start_time = 0;

#define NUM_CLIENTS 20


