brokali/projectZeroTouch/ESP32C5/main/main.c
/* --- mbedTLS Crypto --- */
static mbedtls_ecp_group ecc_group;      // grupa ECC (secp256r1)
static mbedtls_ecp_point ecc_element;      // bieżący element (punkt ECC)
static mbedtls_mpi ecc_scalar;             // bieżący skalar
#if HAS_MBEDTLS_CTR_DRBG
static mbedtls_ctr_drbg_context ctr_drbg;
#endif

/* Router BSSID */
static uint8_t bssid[6] = { 0x30, 0xAA, 0xE4, 0x3C, 0x3F, 0x68};

char * anti_clogging_token = NULL; // Anti-Clogging Token, if any
int actLength = 0; // Length of the Anti-Clogging Token

/* Spoofing base address. Each frame modifies last byte of the address to create a unique source address.*/
static const uint8_t base_srcaddr[6] = { 0x76, 0xe5, 0x49, 0x85, 0x5f, 0x71 };

static uint8_t spoofed_src[6];  // really spoofed source address
static int next_src = 0;        // spoofing index


static const uint8_t auth_req_sae_commit_header[] = {
    0xb0, 0x00, 0x00, 0x00,                   // Frame Control & Duration
    0xBB, 0xBB, 0xBB, 0xBB, 0xBB, 0xBB,         // Address 1 (BSSID – placeholder)
    0xCC, 0xCC, 0xCC, 0xCC, 0xCC, 0xCC,         // Address 2 (Source – placeholder)
    0xBB, 0xBB, 0xBB, 0xBB, 0xBB, 0xBB,         // Address 3 (BSSID – placeholder)
    0x00, 0x00,                               // Sequence Control
    0x03, 0x00, 0x01, 0x00, 0x00, 0x00, 0x13, 0x00  // SAE Commit fixed part
};

#define AUTH_REQ_SAE_COMMIT_HEADER_SIZE (sizeof(auth_req_sae_commit_header))


int framesPerSecond = 0;

// END of SAE properties








static void wifi_event_handler(void *event_handler_arg,
                               esp_event_base_t event_base,
                               int32_t event_id,
                               void *event_data);
static void ip_event_handler(void *event_handler_arg,
                             esp_event_base_t event_base,
                             int32_t event_id,
                             void *event_data);
static void ota_check_task(void *pvParameters);
static esp_err_t ota_fetch_latest_release(char *url_out, size_t url_len,
                                          char *tag_out, size_t tag_len);
static esp_err_t ota_fetch_release_by_tag(const char *tag,
                                          char *url_out, size_t url_len,
                                          char *tag_out, size_t tag_len);
static esp_err_t ota_build_branch_url(char *url_out, size_t url_len);
static bool ota_is_newer_version(const char *current, const char *latest);
static bool ota_has_ip(void);
static bool ota_is_connected(void);
static bool ota_start_check(const char *tag, bool force_latest);
static void ota_load_channel_from_nvs(void);
static bool ota_save_channel_to_nvs(const char *channel);
static void ota_mark_valid_if_pending(void);
static void ota_log_boot_info(void);
static void ota_led_start(void);
static void ota_led_stop(void);

static esp_err_t wifi_init_ap_sta(void);
static esp_err_t bt_nimble_init(void);
static void bt_nimble_deinit(void);
static void bt_reset_counters(void);
static void bt_format_addr(const uint8_t *addr, char *str);
static int bt_start_scan(void);
static int bt_start_scan_coex(void);
static void bt_stop_scan(void);
static int wigle_wifi_channel_to_frequency_mhz(int channel);
static double gps_distance_meters(double lat1, double lon1, double lat2, double lon2);
static bool wardrive_trace_init_file(const char *path);
static void wardrive_trace_finalize_file(const char *path);
static bool wardrive_kml_finalize_orphan(const char *inprogress_path);
static void wardrive_kml_repair_orphans(void);
static int  cmd_wardrive_fix_kml(int argc, char **argv);
static bool wdp_trace_flush_segment(const char *path, wdp_trace_ctx_t *c);
static void wdp_trace_add_point(const char *path, wdp_trace_ctx_t *c,
                                double lat, double lon, double alt, double *dist_accum);
static bool wdp_trace_write_poi(const char *path, wdp_trace_ctx_t *c, const wdp_poi_msg_t *p);
static void register_commands(void);

// --- Wi-Fi event handler ---
static void wifi_event_handler(void *event_handler_arg,
                               esp_event_base_t event_base,
                               int32_t event_id,
                               void *event_data) {
    if (event_base == WIFI_EVENT) {
        //MY_LOG_INFO(TAG, "WiFi event: %ld", event_id);
        switch (event_id) {
        case WIFI_EVENT_STA_CONNECTED: {
            const wifi_event_sta_connected_t *e = (const wifi_event_sta_connected_t *)event_data;
            ESP_LOGD(TAG, "Wi-Fi: connected to SSID='%s', channel=%d, bssid=%02X:%02X:%02X:%02X:%02X:%02X",
                     (const char*)e->ssid, e->channel,
                     e->bssid[0], e->bssid[1], e->bssid[2], e->bssid[3], e->bssid[4], e->bssid[5]);
            
            if (evilTwinSSID != NULL && evilTwinPassword != NULL) {
                MY_LOG_INFO(TAG, "Wi-Fi: connected to SSID='%s' with password='%s'", evilTwinSSID, evilTwinPassword);
            } else {
                MY_LOG_INFO(TAG, "Wi-Fi: connected to SSID='%s'", (const char*)e->ssid);
            }
            
            // Signal wifi_connect command that connection succeeded
            wifi_connect_result = 1;
            
            // Mark password as correct
            last_password_wrong = false;
            
            // If portal is active (Evil Twin attack), shut it down after successful connection
            if (portal_active) {
                MY_LOG_INFO(TAG, "Password verified! Shutting down Evil Twin portal...");
                oled_display_update_full("> Evil Twin", "  PASSWORD OK!", "  Saving to SD", "  >> Success!");
                portal_active = false;
                
                // Stop DNS server task
                if (dns_server_task_handle != NULL) {
                    // Wait for DNS task to finish (it checks portal_active flag)
                    for (int i = 0; i < 30 && dns_server_task_handle != NULL; i++) {
                        vTaskDelay(pdMS_TO_TICKS(100));
                    }
                    
                    // Force cleanup if still running
                    if (dns_server_task_handle != NULL) {
                        vTaskDelete(dns_server_task_handle);
                        dns_server_task_handle = NULL;
                        if (dns_server_socket >= 0) {
                            close(dns_server_socket);
                            dns_server_socket = -1;
                        }
                    }
                }
                
