brokali/projectZeroTouch/ESP32C5/main/main.c
static bool wigle_load_key_from_sd(void) {
    FILE *wf = fopen("/sdcard/lab/wigle.txt", "r");
    if (!wf) {
        return false;
    }

    char line[256] = {0};
    char api_name[WIGLE_KEY_MAX_LEN] = {0};
    char api_token[WIGLE_KEY_MAX_LEN] = {0};
    bool loaded = false;

    if (fgets(line, sizeof(line), wf) &&
        wigle_split_key_pair(line, api_name, sizeof(api_name), api_token, sizeof(api_token))) {
        snprintf(wigle_api_name, sizeof(wigle_api_name), "%s", api_name);
        snprintf(wigle_api_token, sizeof(wigle_api_token), "%s", api_token);
        MY_LOG_INFO(TAG, "WiGLE key loaded from SD for this session.");
        loaded = true;
    } else {
        MY_LOG_INFO(TAG, "Invalid /sdcard/lab/wigle.txt format. Expected: api_name:api_token");
    }

    fclose(wf);
    return loaded;
}

static bool wdgwars_load_key_from_sd(void) {
    FILE *wf = fopen("/sdcard/lab/wdgwars.txt", "r");
    if (!wf) {
        return false;
    }

    char line[128] = {0};
    bool loaded = false;

    if (fgets(line, sizeof(line), wf)) {
        size_t ln = strlen(line);
        while (ln > 0 && (line[ln - 1] == '\n' || line[ln - 1] == '\r' || isspace((unsigned char)line[ln - 1]))) {
            line[--ln] = '\0';
        }
        char *start = line;
        while (*start && isspace((unsigned char)*start)) {
            start++;
        }
        if (start[0] != '\0' && strlen(start) < WDGWARS_KEY_MAX_LEN) {
            strncpy(wdgwars_api_key, start, sizeof(wdgwars_api_key) - 1);
            wdgwars_api_key[sizeof(wdgwars_api_key) - 1] = '\0';
            MY_LOG_INFO(TAG, "WDGWars key loaded from SD for this session.");
            loaded = true;
        } else if (start[0] != '\0') {
            MY_LOG_INFO(TAG, "Invalid /sdcard/lab/wdgwars.txt format. Expected one API key (max %d chars).",
                        WDGWARS_KEY_MAX_LEN - 1);
        }
    }

    fclose(wf);
    return loaded;
}

// ---------------------------------------------------

static void ota_mark_valid_if_pending(void) {
    const esp_partition_t *running = esp_ota_get_running_partition();
    if (!running) {
        return;
    }

    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    esp_err_t err = esp_ota_get_state_partition(running, &state);
    if (err != ESP_OK) {
        return;
    }

    if (state == ESP_OTA_IMG_PENDING_VERIFY) {
        MY_LOG_INFO(TAG, "OTA: pending verify on %s, marking app valid", running->label);
        err = esp_ota_mark_app_valid_cancel_rollback();
        if (err != ESP_OK) {
            MY_LOG_INFO(TAG, "OTA: mark valid failed: %s", esp_err_to_name(err));
        } else {
            MY_LOG_INFO(TAG, "OTA: app marked valid");
        }
    } else {
        MY_LOG_INFO(TAG, "OTA: running state=%d, no mark needed", (int)state);
    }
}

static void ota_log_boot_info(void) {
    /*const esp_partition_t *boot = */esp_ota_get_boot_partition();
    const esp_partition_t *running = esp_ota_get_running_partition();
    const esp_partition_t *next = esp_ota_get_next_update_partition(NULL);
    const esp_partition_t *invalid = esp_ota_get_last_invalid_partition();
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;

    if (running) {
        esp_err_t err = esp_ota_get_state_partition(running, &state);
        if (err != ESP_OK) {
            state = ESP_OTA_IMG_UNDEFINED;
        }
    }

    MY_LOG_INFO(TAG, "OTA: run=%s state=%d next=%s",
                running ? running->label : "n/a",
                (int)state,
                next ? next->label : "n/a");
    if (invalid) {
        MY_LOG_INFO(TAG, "OTA: last invalid partition=%s offset=0x%lx",
                    invalid->label,
                    (unsigned long)invalid->address);
        MY_LOG_INFO(TAG, "OTA: rollback detected (booted from %s)",
                    running ? running->label : "n/a");
    }
}

// --- Wi-Fi initialization (STA only - uses less memory) ---
// AP mode will be enabled dynamically when needed (Evil Twin, Portal)
static esp_err_t wifi_init_ap_sta(void) {
    // Initialize netif only once (shared between WiFi and BLE modes)
    if (!netif_initialized) {
        ESP_ERROR_CHECK(esp_netif_init());
        netif_initialized = true;
    }
    
    // Create event loop only once (shared between WiFi and BLE modes)
    if (!event_loop_initialized) {
        ESP_ERROR_CHECK(esp_event_loop_create_default());
        event_loop_initialized = true;
    }

    // Only create STA interface once (reused on WiFi re-init)
    if (sta_netif_handle == NULL) {
        sta_netif_handle = esp_netif_create_default_wifi_sta();
    }

    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));

    // Register event handler only once (survives WiFi reinit after mode switch)
    if (!wifi_event_handler_registered) {
        ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
                                                            ESP_EVENT_ANY_ID,
                                                            &wifi_event_handler,
                                                            NULL,
                                                            NULL));
        wifi_event_handler_registered = true;
    }
    if (!ip_event_handler_registered) {
        ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,
                                                            IP_EVENT_STA_GOT_IP,
                                                            &ip_event_handler,
                                                            NULL,
                                                            NULL));
        ip_event_handler_registered = true;
    }

    wifi_config_t wifi_config = { 0 };
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
    ESP_ERROR_CHECK(esp_wifi_start());

    uint8_t mac[6];
    esp_err_t ret = esp_wifi_get_mac(WIFI_IF_STA, mac);

    if (ret == ESP_OK) {
         MY_LOG_INFO("MAC", "MAC Address: %02X:%02X:%02X:%02X:%02X:%02X",
                 mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    } else {
        ESP_LOGE("MAC", "Failed to get MAC address");
    }

    return ESP_OK;
}

