brokali/projectZeroTouch/ESP32C5/main/main.c
    // Update target channels based on scan results
    update_target_channels(quick_scan_results, copy_count);
    
    if (!periodic_rescan_in_progress) {
        MY_LOG_INFO(TAG, "Quick channel scan completed");
    }
    return ESP_OK;
}

// Update target channels based on latest scan results
static void update_target_channels(wifi_ap_record_t *scan_results, uint16_t scan_count) {
    bool channel_changed = false;
    
    if (!periodic_rescan_in_progress) {
        MY_LOG_INFO(TAG, "Updating target channels with %d scan results", scan_count);
        
        // Log current g_selected_indices and their corresponding BSSIDs
        MY_LOG_INFO(TAG, "Current g_selected_indices and BSSIDs:");
        for (int i = 0; i < g_selected_count; ++i) {
            int idx = g_selected_indices[i];
            MY_LOG_INFO(TAG, "  g_selected_indices[%d] = %d -> BSSID: %02X:%02X:%02X:%02X:%02X:%02X, SSID: %s", 
                       i, idx, g_scan_results[idx].bssid[0], g_scan_results[idx].bssid[1], g_scan_results[idx].bssid[2],
                       g_scan_results[idx].bssid[3], g_scan_results[idx].bssid[4], g_scan_results[idx].bssid[5],
                       g_scan_results[idx].ssid);
        }
        
        // Debug: Print all scan results
        for (int i = 0; i < scan_count; ++i) {
            MY_LOG_INFO(TAG, "Scan result[%d]: %s, BSSID: %02X:%02X:%02X:%02X:%02X:%02X, Channel: %d", 
                       i, scan_results[i].ssid,
                       scan_results[i].bssid[0], scan_results[i].bssid[1], scan_results[i].bssid[2],
                       scan_results[i].bssid[3], scan_results[i].bssid[4], scan_results[i].bssid[5],
                       scan_results[i].primary);
        }
    }
    
    for (int i = 0; i < target_bssid_count; ++i) {
        if (!target_bssids[i].active) continue;
        
        if (!periodic_rescan_in_progress) {
            MY_LOG_INFO(TAG, "Checking target BSSID %s (current channel: %d)", 
                       target_bssids[i].ssid, target_bssids[i].channel);
        }
        
        // Find matching BSSID in scan results
        bool found = false;
        for (int j = 0; j < scan_count; ++j) {
            if (memcmp(target_bssids[i].bssid, scan_results[j].bssid, 6) == 0) {
                uint8_t old_channel = target_bssids[i].channel;
                target_bssids[i].channel = scan_results[j].primary;
                target_bssids[i].authmode = scan_results[j].authmode;
                target_bssids[i].last_seen = esp_timer_get_time() / 1000;
                found = true;
                
                if (!periodic_rescan_in_progress) {
                    MY_LOG_INFO(TAG, "FOUND: Target BSSID %s (%02X:%02X:%02X:%02X:%02X:%02X) found in scan results at index %d, channel: %d", 
                               target_bssids[i].ssid, target_bssids[i].bssid[0], target_bssids[i].bssid[1], target_bssids[i].bssid[2],
                               target_bssids[i].bssid[3], target_bssids[i].bssid[4], target_bssids[i].bssid[5], j, scan_results[j].primary);
                }
                
                if (old_channel != target_bssids[i].channel) {
                    // ALWAYS log channel changes, even during periodic re-scan
                    MY_LOG_INFO(TAG, "Channel change detected for %s: %d -> %d", 
                               target_bssids[i].ssid, old_channel, target_bssids[i].channel);
                    channel_changed = true;
                }
                break;
            }
        }
        
        if (!found && !periodic_rescan_in_progress) {
            MY_LOG_INFO(TAG, "Target BSSID %s not found in scan results", target_bssids[i].ssid);
        }
    }
    
    if (channel_changed && !periodic_rescan_in_progress) {
        MY_LOG_INFO(TAG, "Channel changes detected, will resume deauth on new channels");
        MY_LOG_INFO(TAG, "Note: Using target_bssids[] directly for deauth attack to avoid index confusion");
    }
}

// Check if it's time for channel check
static bool check_channel_changes(void) {
    uint32_t current_time = esp_timer_get_time() / 1000; // Convert to milliseconds
    
    if (current_time - last_channel_check_time >= CHANNEL_CHECK_INTERVAL_MS) {
        last_channel_check_time = current_time;
        return true;
    }
    
    return false;
}

static void escape_csv_field(const char* input, char* output, size_t output_size) {
    if (!input || !output || output_size < 2) return;

    size_t input_len = strlen(input);
    size_t out_pos = 0;
    bool needs_quotes = false;

    for (size_t i = 0; i < input_len; i++) {
        if (input[i] == ',' || input[i] == '"' || input[i] == '\r' || input[i] == '\n') {
            needs_quotes = true;
            break;
        }
    }

    if (needs_quotes && out_pos < output_size - 1) {
        output[out_pos++] = '"';
    }

    for (size_t i = 0; i < input_len && out_pos < output_size - 2; i++) {
        if (input[i] == '"') {
            if (out_pos < output_size - 3) {
                output[out_pos++] = '"';
                output[out_pos++] = '"';
            }
        } else {
            output[out_pos++] = input[i];
        }
    }
    if (needs_quotes && out_pos < output_size - 1) {
        output[out_pos++] = '"';
    }
    output[out_pos] = '\0';
}

const char* authmode_to_string(wifi_auth_mode_t mode) {
    switch(mode) {
        case WIFI_AUTH_OPEN:
            return "Open";
        case WIFI_AUTH_WEP:
            return "WEP";
        case WIFI_AUTH_WPA_PSK:
            return "WPA";
        case WIFI_AUTH_WPA2_PSK:
            return "WPA2";
        case WIFI_AUTH_WPA_WPA2_PSK:
            return "WPA/WPA2 Mixed";
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return "WPA2 Enterprise";
        case WIFI_AUTH_WPA3_PSK:
            return "WPA3";
        case WIFI_AUTH_WPA2_WPA3_PSK:
            return "WPA2/WPA3 Mixed";
        case WIFI_AUTH_WAPI_PSK:
            return "WAPI";
        case WIFI_AUTH_OWE:
            return "OWE";
        default:
            return "Unknown";
    }
}

static void vendor_persist_state(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(VENDOR_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Vendor NVS open failed: %s", esp_err_to_name(err));
        return;
    }

    uint8_t value = vendor_lookup_enabled ? 1 : 0;
    err = nvs_set_u8(handle, VENDOR_NVS_KEY_ENABLED, value);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Vendor NVS write failed: %s", esp_err_to_name(err));
    }
    nvs_close(handle);
}

static void vendor_load_state_from_nvs(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_open(VENDOR_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Vendor NVS read open failed: %s", esp_err_to_name(err));
        return;
    }

    uint8_t value = vendor_lookup_enabled ? 1 : 0;
    err = nvs_get_u8(handle, VENDOR_NVS_KEY_ENABLED, &value);
    if (err == ESP_OK) {
        vendor_lookup_enabled = value != 0;
    } else if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "Vendor NVS get failed: %s", esp_err_to_name(err));
    }
    nvs_close(handle);
}

static bool vendor_is_enabled(void) {
    return vendor_lookup_enabled;
}

static esp_err_t vendor_set_enabled(bool enabled) {
    vendor_lookup_enabled = enabled;
    vendor_last_valid = false;
    vendor_last_hit = false;
    vendor_lookup_buffer[0] = '\0';
    vendor_file_checked = false;
    vendor_file_present = false;
    vendor_record_count = 0;
    vendor_persist_state();
    return ESP_OK;
}

