brokali/projectZeroTouch/ESP32C5/main/main.c
static const char *display_mode_to_str(display_type_t mode)
{
    switch (mode) {
    case DISPLAY_SSD1306: return "ssd1306";
    case DISPLAY_SH1107:  return "sh1107";
    case DISPLAY_SH1106:  return "sh1106";
    case DISPLAY_UNIT_LCD:return "unit_lcd";
    case DISPLAY_NONE:
    default:
        return "auto";
    }
}

static bool display_mode_from_str(const char *s, display_type_t *out_mode)
{
    if (!s || !out_mode) return false;
    if (strcasecmp(s, "auto") == 0) {
        *out_mode = DISPLAY_NONE;
        return true;
    }
    if (strcasecmp(s, "ssd1306") == 0) {
        *out_mode = DISPLAY_SSD1306;
        return true;
    }
    if (strcasecmp(s, "sh1107") == 0) {
        *out_mode = DISPLAY_SH1107;
        return true;
    }
    if (strcasecmp(s, "sh1106") == 0) {
        *out_mode = DISPLAY_SH1106;
        return true;
    }
    if (strcasecmp(s, "unit_lcd") == 0 || strcasecmp(s, "lcd") == 0) {
        *out_mode = DISPLAY_UNIT_LCD;
        return true;
    }
    return false;
}

static void display_mode_save_to_nvs(display_type_t mode)
{
    nvs_handle_t handle;
    esp_err_t err = nvs_open(DISPLAY_NVS_NAMESPACE, NVS_READWRITE, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Display NVS open failed: %s", esp_err_to_name(err));
        return;
    }
    err = nvs_set_u8(handle, DISPLAY_NVS_KEY_MODE, (uint8_t)mode);
    if (err == ESP_OK) {
        err = nvs_commit(handle);
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Display NVS write failed: %s", esp_err_to_name(err));
    }
    nvs_close(handle);
}

static void display_mode_load_from_nvs(void)
{
    nvs_handle_t handle;
    esp_err_t err = nvs_open(DISPLAY_NVS_NAMESPACE, NVS_READONLY, &handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        display_forced_mode = DISPLAY_NONE;
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Display NVS read open failed: %s", esp_err_to_name(err));
        display_forced_mode = DISPLAY_NONE;
        return;
    }

    uint8_t raw = (uint8_t)DISPLAY_NONE;
    err = nvs_get_u8(handle, DISPLAY_NVS_KEY_MODE, &raw);
    nvs_close(handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        display_forced_mode = DISPLAY_NONE;
        return;
    }
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Display NVS get failed: %s", esp_err_to_name(err));
        display_forced_mode = DISPLAY_NONE;
        return;
    }

    switch ((display_type_t)raw) {
    case DISPLAY_NONE:
    case DISPLAY_SSD1306:
    case DISPLAY_SH1107:
    case DISPLAY_SH1106:
    case DISPLAY_UNIT_LCD:
        display_forced_mode = (display_type_t)raw;
        break;
    default:
        display_forced_mode = DISPLAY_NONE;
        break;
    }
}

static bool boot_is_command_allowed(const char* command) {
    if (command == NULL || command[0] == '\0') {
        return false;
    }
    for (size_t i = 0; i < boot_allowed_command_count; i++) {
        if (strcasecmp(command, boot_allowed_commands[i]) == 0) {
            return true;
        }
    }
    return false;
}

typedef bool (*boot_flow_visitor_t)(char *command_line, void *ctx);

static char* boot_trim_whitespace(char *text) {
    if (text == NULL) {
        return NULL;
    }

    while (*text && isspace((unsigned char)*text)) {
        text++;
    }

    char *end = text + strlen(text);
    while (end > text && isspace((unsigned char)end[-1])) {
        *--end = '\0';
    }

    return text;
}

static bool boot_buffer_append_char(char *dest, size_t dest_size, size_t *pos, char ch) {
    if (dest == NULL || pos == NULL || *pos + 1 >= dest_size) {
        return false;
    }

    dest[*pos] = ch;
    (*pos)++;
    dest[*pos] = '\0';
    return true;
}

static bool boot_buffer_append_text(char *dest, size_t dest_size, size_t *pos, const char *text) {
    if (dest == NULL || pos == NULL || text == NULL) {
        return false;
    }

    size_t len = strlen(text);
    if (*pos + len >= dest_size) {
        return false;
    }

    memcpy(dest + *pos, text, len);
    *pos += len;
    dest[*pos] = '\0';
    return true;
}

static bool boot_append_serialized_arg(char *dest, size_t dest_size, size_t *pos, const char *arg) {
    if (arg == NULL) {
        arg = "";
    }

    bool needs_quotes = (arg[0] == '\0');
    for (const char *p = arg; *p != '\0'; ++p) {
        if (isspace((unsigned char)*p) || *p == '"' || *p == '\\') {
            needs_quotes = true;
            break;
        }
    }

    if (!needs_quotes) {
        return boot_buffer_append_text(dest, dest_size, pos, arg);
    }

    if (!boot_buffer_append_char(dest, dest_size, pos, '"')) {
        return false;
    }

    for (const char *p = arg; *p != '\0'; ++p) {
        if (*p == '"' || *p == '\\') {
            if (!boot_buffer_append_char(dest, dest_size, pos, '\\')) {
                return false;
            }
        }
        if (!boot_buffer_append_char(dest, dest_size, pos, *p)) {
            return false;
        }
    }

    return boot_buffer_append_char(dest, dest_size, pos, '"');
}

static bool boot_build_command_flow_from_argv(int argc, char **argv, int start_index, char *dest, size_t dest_size) {
    if (dest == NULL || dest_size == 0 || argc <= start_index || argv == NULL) {
        return false;
    }

    dest[0] = '\0';

    if ((argc - start_index) == 1) {
        return strlcpy(dest, argv[start_index], dest_size) < dest_size;
    }

    size_t pos = 0;
    for (int i = start_index; i < argc; ++i) {
        if (argv[i] == NULL) {
            continue;
        }
        if (pos > 0 && !boot_buffer_append_char(dest, dest_size, &pos, ' ')) {
            return false;
        }
        if (!boot_append_serialized_arg(dest, dest_size, &pos, argv[i])) {
            return false;
        }
    }

    return pos > 0;
}

static bool boot_visit_command_flow(char *flow, boot_flow_visitor_t visitor, void *ctx) {
    if (flow == NULL || visitor == NULL) {
        return false;
    }

    char *segment_start = flow;
    bool in_single_quote = false;
    bool in_double_quote = false;
    bool escape_next = false;
    bool saw_command = false;

    for (char *cursor = flow; ; ++cursor) {
        char ch = *cursor;

