brokali/projectZeroTouch/ESP32C5/main/main.c
static void boot_list_allowed_commands(void) {
    MY_LOG_INFO(TAG, "Allowed boot commands:");
    for (size_t i = 0; i < boot_allowed_command_count; i++) {
        MY_LOG_INFO(TAG, "  %s", boot_allowed_commands[i]);
    }
    MY_LOG_INFO(TAG, "Use commas to run a flow, for example:");
    MY_LOG_INFO(TAG, "  list_sd, select_html 1, start_portal FreeWifi");
    MY_LOG_INFO(TAG, "Quote arguments that contain spaces:");
    MY_LOG_INFO(TAG, "  start_portal \"Free Wifi\"");
}

static bool boot_execute_command_segment(char *command_line, void *ctx) {
    (void)ctx;

    char parse_copy[BOOTCFG_CMD_MAX_LEN];
    if (strlcpy(parse_copy, command_line, sizeof(parse_copy)) >= sizeof(parse_copy)) {
        return false;
    }

    char *argv_local[16];
    size_t argc = esp_console_split_argv(parse_copy, argv_local, sizeof(argv_local) / sizeof(argv_local[0]));
    if (argc == 0) {
        return false;
    }

    const char *run_line = command_line;
    if (strcasecmp(argv_local[0], "packet_monitor") == 0 && argc == 1) {
        // Keep backward compatibility with the previous fixed channel=1 behavior.
        run_line = "packet_monitor 1";
    }

    MY_LOG_INFO(TAG, "Boot cmd: %s", run_line);

    int cmd_ret = 0;
    esp_err_t err = esp_console_run(run_line, &cmd_ret);
    if (err == ESP_ERR_NOT_FOUND) {
        MY_LOG_INFO(TAG, "Boot cmd not found: %s", argv_local[0]);
        return false;
    }
    if (err == ESP_ERR_INVALID_ARG) {
        MY_LOG_INFO(TAG, "Boot cmd invalid args: %s", run_line);
        return false;
    }
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Boot cmd error %s: %s", esp_err_to_name(err), run_line);
        return false;
    }
    if (cmd_ret != 0) {
        MY_LOG_INFO(TAG, "Boot cmd returned %d: %s", cmd_ret, run_line);
        return false;
    }

    return true;
}

static void boot_execute_command_flow(const char* flow) {
    if (flow == NULL || flow[0] == '\0') {
        return;
    }

    char flow_copy[BOOTCFG_CMD_MAX_LEN];
    if (strlcpy(flow_copy, flow, sizeof(flow_copy)) >= sizeof(flow_copy)) {
        MY_LOG_INFO(TAG, "Boot flow too long, skipping");
        return;
    }

    char detail[BOOTCFG_CMD_MAX_LEN];
    boot_flow_validation_result_t validation = boot_validate_command_flow(flow, detail, sizeof(detail));
    if (validation == BOOT_FLOW_INVALID_COMMAND) {
        MY_LOG_INFO(TAG, "Boot flow blocked by command '%s'", detail);
        return;
    }
    if (validation != BOOT_FLOW_VALID) {
        MY_LOG_INFO(TAG, "Boot flow malformed: %s", flow);
        return;
    }

    if (!boot_visit_command_flow(flow_copy, boot_execute_command_segment, NULL)) {
        MY_LOG_INFO(TAG, "Boot flow stopped: %s", flow);
    }
}

static void boot_action_task(void *arg) {
    boot_action_params_t *params = (boot_action_params_t *)arg;
    if (params != NULL) {
        boot_execute_command_flow(params->command);
        free(params);
    }
    boot_action_task_handle = NULL;
    vTaskDelete(NULL);
}

static void boot_handle_action(bool is_long_press) {
    const boot_action_config_t* action = is_long_press ? &boot_config.long_press : &boot_config.short_press;
    const char* label = is_long_press ? "long" : "short";
    if (!action->enabled) {
        MY_LOG_INFO(TAG, "Boot %s action disabled", label);
        return;
    }
    char detail[BOOTCFG_CMD_MAX_LEN];
    boot_flow_validation_result_t validation = boot_validate_command_flow(action->command, detail, sizeof(detail));
    if (validation == BOOT_FLOW_INVALID_COMMAND) {
        MY_LOG_INFO(TAG, "Boot %s command '%s' not allowed", label, detail);
        return;
    }
    if (validation != BOOT_FLOW_VALID) {
        MY_LOG_INFO(TAG, "Boot %s flow malformed: %s", label, action->command);
        return;
    }
    MY_LOG_INFO(TAG, "Boot %s executing: %s", label, action->command);
    if (boot_action_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Boot %s action busy, skipping '%s'", label, action->command);
        return;
    }

    boot_action_params_t *params = calloc(1, sizeof(*params));
    if (params == NULL) {
        MY_LOG_INFO(TAG, "Boot %s action failed: no memory", label);
        return;
    }
    strlcpy(params->command, action->command, sizeof(params->command));

    BaseType_t result = xTaskCreate(
        boot_action_task,
        "boot_action",
        BOOT_ACTION_TASK_STACK_SIZE,
        params,
        BOOT_BUTTON_TASK_PRIORITY,
        &boot_action_task_handle
    );
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Boot %s action failed: task create", label);
        boot_action_task_handle = NULL;
        free(params);
    }
}

static void ensure_vendor_file_checked(void) {
    if (vendor_file_checked) {
        return;
    }
    if (!sd_card_mounted) {
        // SD card not ready yet, defer lookup until later
        vendor_file_checked = false;
        vendor_file_present = false;
        vendor_record_count = 0;
        return;
    }
    FILE *file = fopen(SD_OUI_BIN_PATH, "rb");
    if (file) {
        vendor_file_present = true;
        if (fseek(file, 0, SEEK_END) == 0) {
            long file_size = ftell(file);
            if (file_size >= (long)VENDOR_RECORD_SIZE) {
                vendor_record_count = (size_t)file_size / VENDOR_RECORD_SIZE;
            } else {
                vendor_record_count = 0;
            }
        } else {
            vendor_record_count = 0;
        }
        MY_LOG_INFO(TAG, "Vendor binary file detected (%u entries)", (unsigned int)vendor_record_count);
        fclose(file);
        if (vendor_record_count == 0) {
            vendor_file_present = false;
        }
    } else {
        vendor_file_present = false;
        vendor_record_count = 0;
        MY_LOG_INFO(TAG, "Vendor binary file not found");
    }
    vendor_file_checked = true;
    vendor_last_valid = false;
    vendor_last_hit = false;
    vendor_lookup_buffer[0] = '\0';
}

static const char* lookup_vendor_name(const uint8_t *bssid) {
    if (!vendor_lookup_enabled || !bssid) {
        vendor_last_valid = false;
        return NULL;
    }

