brokali/projectZeroTouch/ESP32C5/main/main.c
        // Immediately start next scan cycle (no waiting)
    }
    
    // Clean up LED after attack finishes
    led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED after blackout attack: %s", esp_err_to_name(led_err));
    }
    
    // Clean up
    blackout_attack_active = false;
    blackout_attack_task_handle = NULL;
    
    // Clear target BSSIDs
    target_bssid_count = 0;
    memset(target_bssids, 0, MAX_TARGET_BSSIDS * sizeof(target_bssid_t));
    
    MY_LOG_INFO(TAG, "Blackout attack task finished.");
    
    vTaskDelete(NULL); // Delete this task
}

// Helper function to check if handshake file already exists for a given SSID
static bool check_handshake_file_exists(const char *ssid) {
    char ssid_safe[33];
    
    // Sanitize SSID for filename
    strncpy(ssid_safe, ssid, sizeof(ssid_safe) - 1);
    ssid_safe[sizeof(ssid_safe) - 1] = '\0';
    for (int i = 0; ssid_safe[i]; i++) {
        if (ssid_safe[i] == ' ' || ssid_safe[i] == '/' || ssid_safe[i] == '\\') {
            ssid_safe[i] = '_';
        }
    }
    
    // Check if any PCAP file exists for this SSID
    DIR *dir = opendir("/sdcard/lab/handshakes");
    if (dir == NULL) {
        return false; // Directory doesn't exist, so no files exist
    }
    
    struct dirent *entry;
    bool found = false;
    while ((entry = readdir(dir)) != NULL) {
        // Check if filename starts with the SSID and ends with .pcap
        if (strncmp(entry->d_name, ssid_safe, strlen(ssid_safe)) == 0 &&
            strstr(entry->d_name, ".pcap") != NULL) {
            found = true;
            break;
        }
    }
    
    closedir(dir);
    return found;
}

// Also check by BSSID (more reliable than SSID for hidden/duplicate networks)
static bool check_handshake_file_exists_by_bssid(const uint8_t *bssid) {
    char mac_suffix[7];
    snprintf(mac_suffix, sizeof(mac_suffix), "%02X%02X%02X", bssid[3], bssid[4], bssid[5]);
    
    DIR *dir = opendir("/sdcard/lab/handshakes");
    if (dir == NULL) return false;
    
    struct dirent *entry;
    bool found = false;
    while ((entry = readdir(dir)) != NULL) {
        if (strstr(entry->d_name, mac_suffix) != NULL &&
            strstr(entry->d_name, ".pcap") != NULL) {
            found = true;
            break;
        }
    }
    closedir(dir);
    return found;
}

// ============================================================================
// D-UCB (Discounted Upper Confidence Bound) Algorithm for Channel Selection
// ============================================================================

static void ducb_init(void) {
    ducb_channel_count = dual_band_channels_count;
    ducb_discounted_total = 0.0;
    for (int i = 0; i < ducb_channel_count; i++) {
        ducb_channels[i].channel = dual_band_channels[i];
        ducb_channels[i].discounted_reward = 0.0;
        ducb_channels[i].discounted_pulls = 0.0;
        ducb_channels[i].total_pulls = 0;
    }
}

// Apply discount to all channels (called before each selection)
static void ducb_apply_discount(void) {
    ducb_discounted_total *= DUCB_GAMMA;
    for (int i = 0; i < ducb_channel_count; i++) {
        ducb_channels[i].discounted_reward *= DUCB_GAMMA;
        ducb_channels[i].discounted_pulls *= DUCB_GAMMA;
    }
}

// Select best channel using D-UCB formula
static int ducb_select_channel(void) {
    ducb_apply_discount();
    
    int best_idx = 0;
    double best_ucb = -1.0;
    
    for (int i = 0; i < ducb_channel_count; i++) {
        // Forced exploration: unpulled channels have infinite UCB
        if (ducb_channels[i].discounted_pulls < 0.001) {
            // Find first unpulled channel
            best_idx = i;
            best_ucb = 1e18;
            break;
        }
        
        double avg_reward = ducb_channels[i].discounted_reward / ducb_channels[i].discounted_pulls;
        double exploration = DUCB_C * sqrt(log(ducb_discounted_total + 1.0) / ducb_channels[i].discounted_pulls);
        double ucb = avg_reward + exploration;
        
        if (ucb > best_ucb) {
            best_ucb = ucb;
            best_idx = i;
        }
    }
    
    return best_idx;
}

// Update D-UCB after observing reward on a channel
static void ducb_update(int channel_idx, double reward) {
    ducb_channels[channel_idx].discounted_pulls += 1.0;
    ducb_channels[channel_idx].discounted_reward += reward;
    ducb_channels[channel_idx].total_pulls++;
    ducb_discounted_total += 1.0;
}

// ============================================================================
// Wardrive Promisc: D-UCB, Dedup, Promiscuous Callback, Task
// ============================================================================

// Append one channel to the D-UCB table. Primary 2.4 tier gets a warm-start reward.
static void wdp_ducb_add_channel(int channel, wdp_channel_tier_t tier) {
    if (wdp_ducb_channel_count >= WDP_TOTAL_CHANNELS) return;
    wdp_ducb_channels[wdp_ducb_channel_count].channel = channel;
    wdp_ducb_channels[wdp_ducb_channel_count].tier = tier;
    wdp_ducb_channels[wdp_ducb_channel_count].discounted_reward = (tier == WDP_TIER_24_PRIMARY) ? 0.5 : 0.0;
    wdp_ducb_channels[wdp_ducb_channel_count].discounted_pulls = 0.0;
    wdp_ducb_channels[wdp_ducb_channel_count].total_pulls = 0;
    wdp_ducb_channel_count++;
}

// Map a channel number to its tier (used for custom lists).
static wdp_channel_tier_t wdp_classify_channel(int ch) {
    if (ch <= 14) {
        for (int i = 0; i < (int)WDP_CH_24_PRIMARY_COUNT; i++)
            if (wdp_ch_24_primary[i] == ch) return WDP_TIER_24_PRIMARY;
        return WDP_TIER_24_SECONDARY;
    }
    for (int i = 0; i < (int)WDP_CH_5_DFS_COUNT; i++)
        if (wdp_ch_5_dfs[i] == ch) return WDP_TIER_5_DFS;
    return WDP_TIER_5_NON_DFS;
}

// Is the channel part of any known tier? (validation for custom lists)
static bool wdp_channel_is_known(int ch) {
    if (ch <= 14) {
        for (int i = 0; i < (int)WDP_CH_24_PRIMARY_COUNT; i++)   if (wdp_ch_24_primary[i] == ch)   return true;
        for (int i = 0; i < (int)WDP_CH_24_SECONDARY_COUNT; i++) if (wdp_ch_24_secondary[i] == ch) return true;
        return false;
    }
    for (int i = 0; i < (int)WDP_CH_5_NON_DFS_COUNT; i++) if (wdp_ch_5_non_dfs[i] == ch) return true;
    for (int i = 0; i < (int)WDP_CH_5_DFS_COUNT; i++)     if (wdp_ch_5_dfs[i] == ch)     return true;
    return false;
}

