brokali/projectZeroTouch/ESP32C5/main/main.c
// Build the D-UCB channel table from the active config (bands + channel mode).
// With bands=all + ch_mode=all this reproduces the original full table exactly.
static void wdp_ducb_init(const wardrive_config_t *cfg) {
    wdp_ducb_channel_count = 0;
    wdp_ducb_discounted_total = 0.0;

    const bool want_24 = (cfg->bands & WD_BAND_24) != 0;
    const bool want_5  = (cfg->bands & WD_BAND_5) != 0;

    if (cfg->ch_mode == WD_CH_CUSTOM) {
        for (int i = 0; i < cfg->custom_ch_count; i++) {
            int ch = cfg->custom_ch[i];
            bool is_24 = (ch <= 14);
            if (is_24 && !want_24) continue;
            if (!is_24 && !want_5)  continue;
            wdp_ducb_add_channel(ch, wdp_classify_channel(ch));
        }
        return;
    }

    // POPULAR = primary 2.4 + 5G non-DFS only.  ALL = every tier.
    const bool include_secondary = (cfg->ch_mode == WD_CH_ALL);
    const bool include_dfs       = (cfg->ch_mode == WD_CH_ALL);

    if (want_24) {
        for (int i = 0; i < (int)WDP_CH_24_PRIMARY_COUNT; i++)
            wdp_ducb_add_channel(wdp_ch_24_primary[i], WDP_TIER_24_PRIMARY);
        if (include_secondary)
            for (int i = 0; i < (int)WDP_CH_24_SECONDARY_COUNT; i++)
                wdp_ducb_add_channel(wdp_ch_24_secondary[i], WDP_TIER_24_SECONDARY);
    }
    if (want_5) {
        for (int i = 0; i < (int)WDP_CH_5_NON_DFS_COUNT; i++)
            wdp_ducb_add_channel(wdp_ch_5_non_dfs[i], WDP_TIER_5_NON_DFS);
        if (include_dfs)
            for (int i = 0; i < (int)WDP_CH_5_DFS_COUNT; i++)
                wdp_ducb_add_channel(wdp_ch_5_dfs[i], WDP_TIER_5_DFS);
    }
}

static int wdp_ducb_select_channel(void) {
    wdp_ducb_discounted_total *= WDP_DUCB_GAMMA;
    for (int i = 0; i < wdp_ducb_channel_count; i++) {
        wdp_ducb_channels[i].discounted_reward *= WDP_DUCB_GAMMA;
        wdp_ducb_channels[i].discounted_pulls *= WDP_DUCB_GAMMA;
    }

    int best_idx = 0;
    double best_ucb = -1.0;

    for (int i = 0; i < wdp_ducb_channel_count; i++) {
        if (wdp_ducb_channels[i].discounted_pulls < 0.001) {
            best_idx = i;
            break;
        }
        double avg_reward = wdp_ducb_channels[i].discounted_reward / wdp_ducb_channels[i].discounted_pulls;
        double exploration = WDP_DUCB_C * sqrt(log(wdp_ducb_discounted_total + 1.0) / wdp_ducb_channels[i].discounted_pulls);
        double ucb = avg_reward + exploration;
        if (ucb > best_ucb) {
            best_ucb = ucb;
            best_idx = i;
        }
    }
    return best_idx;
}

static void wdp_ducb_update(int channel_idx, double reward) {
    wdp_ducb_channels[channel_idx].discounted_pulls += 1.0;
    wdp_ducb_channels[channel_idx].discounted_reward += reward;
    wdp_ducb_channels[channel_idx].total_pulls++;
    wdp_ducb_discounted_total += 1.0;
}

static int wdp_get_dwell_ms(wdp_channel_tier_t tier) {
    switch (tier) {
        case WDP_TIER_24_PRIMARY:   return WDP_DWELL_PRIMARY_MS;
        case WDP_TIER_24_SECONDARY: return WDP_DWELL_DEFAULT_MS;
        case WDP_TIER_5_NON_DFS:    return WDP_DWELL_DEFAULT_MS;
        case WDP_TIER_5_DFS:        return WDP_DWELL_DFS_MS;
        default:                    return WDP_DWELL_DEFAULT_MS;
    }
}

static int wdp_find_bssid(const uint8_t *bssid) {
    for (int i = 0; i < wdp_seen_count; i++) {
        if (memcmp(wdp_seen_networks[i].bssid, bssid, 6) == 0) {
            return i;
        }
    }
    return -1;
}

static void wdp_promiscuous_cb(void *buf, wifi_promiscuous_pkt_type_t type) {
    if (!wardrive_promisc_active) return;
    if (type != WIFI_PKT_MGMT) return;
    if (esp_timer_get_time() < wdp_log_gate_until_us) return;  // startup cooldown

    const wifi_promiscuous_pkt_t *pkt = (wifi_promiscuous_pkt_t *)buf;
    const uint8_t *frame = pkt->payload;
    int len = pkt->rx_ctrl.sig_len;

    if (len < 36) return;

    uint8_t frame_type = frame[0] & 0xFC;
    if (frame_type != 0x80) return; // Only beacons

    const uint8_t *ap_bssid = &frame[10]; // addr2 = transmitter = AP
    if (wardrive_blacklist_contains(ap_bssid)) return;  // excluded device

    const uint8_t *body = frame + 24 + 12;
    int body_len = len - 24 - 12;
    if (body_len < 2) return;

    char ssid[33] = {0};
    uint8_t beacon_channel = pkt->rx_ctrl.channel;
    wifi_auth_mode_t authmode = WIFI_AUTH_OPEN;

    int offset = 0;
    while (offset + 2 <= body_len) {
        uint8_t tag = body[offset];
        uint8_t tag_len = body[offset + 1];
        if (offset + 2 + tag_len > body_len) break;

        if (tag == 0 && tag_len > 0 && tag_len <= 32) {
            memcpy(ssid, &body[offset + 2], tag_len);
            ssid[tag_len] = '\0';
        } else if (tag == 3 && tag_len == 1) {
            beacon_channel = body[offset + 2];
        } else if (tag == 48) {
            authmode = WIFI_AUTH_WPA2_PSK;
        } else if (tag == 221) {
            if (tag_len >= 4 && body[offset+2] == 0x00 && body[offset+3] == 0x50 &&
                body[offset+4] == 0xF2 && body[offset+5] == 0x01) {
                if (authmode == WIFI_AUTH_OPEN) authmode = WIFI_AUTH_WPA_PSK;
            }
        }
        offset += 2 + tag_len;
    }

    int existing = wdp_find_bssid(ap_bssid);
    if (existing >= 0) {
        int8_t cur_rssi = (int8_t)pkt->rx_ctrl.rssi;
        wdp_seen_networks[existing].rssi = cur_rssi;   // keep the latest reading for re-log

        // Re-log this AP if its signal or our position moved enough since the last row.
        // wifi_rssi_delta == 0 keeps the legacy "log once" behavior. Only re-log with a
        // valid fix so a row never carries 0,0 — without GPS the observation is useless.
        if (g_wd_cfg.wifi_rssi_delta > 0 && !wdp_seen_networks[existing].needs_log && current_gps.valid) {
            bool trig = false;
            int rd = cur_rssi - wdp_seen_networks[existing].last_logged_rssi;
            if (rd < 0) rd = -rd;
            if (rd >= g_wd_cfg.wifi_rssi_delta) {
                trig = true;
            } else if (current_gps.valid && wdp_seen_networks[existing].last_logged_valid) {
                double moved = gps_distance_meters(wdp_seen_networks[existing].last_logged_lat,
                                                   wdp_seen_networks[existing].last_logged_lon,
                                                   current_gps.latitude, current_gps.longitude);
                // Require real movement beyond GPS noise: max(fixed threshold, reported accuracy).
                double thresh = WDP_RELOG_DISTANCE_M;
                if (current_gps.accuracy > thresh) thresh = current_gps.accuracy;
                if (moved >= thresh) trig = true;
            }
            if (trig) {
                wdp_seen_networks[existing].needs_log = true;
                wdp_snapshot_obs(&wdp_seen_networks[existing]);  // stamp this re-observation
                wdp_relog_pending = true;
            }
        }
        return;
    }

