brokali/projectZeroTouch/ESP32C5/main/main.c
    // First sighting: don't register/log an AP we can't place. Without a GPS fix the
    // row would be 0,0 (and no POI is created); it will register on the next beacon
    // once we have a fix, which for a beaconing AP is within a second or two.
    if (!current_gps.valid) return;

    if (wdp_seen_count >= wdp_seen_capacity) {
        wdp_needs_grow = true;
        return;
    }

    int idx = wdp_seen_count;
    memcpy(wdp_seen_networks[idx].bssid, ap_bssid, 6);
    strncpy(wdp_seen_networks[idx].ssid, ssid, 32);
    wdp_seen_networks[idx].ssid[32] = '\0';
    wdp_seen_networks[idx].channel = beacon_channel;
    wdp_seen_networks[idx].rssi = (int8_t)pkt->rx_ctrl.rssi;
    wdp_seen_networks[idx].authmode = authmode;
    wdp_seen_networks[idx].needs_log = true;        // pending first write
    wdp_seen_networks[idx].last_logged_valid = false;
    wdp_snapshot_obs(&wdp_seen_networks[idx]);      // stamp the first sighting (WiGLE FirstSeen)
    wdp_seen_count++;

    wdp_dwell_new_networks++;

    // Wardrive Trace: emit one POI per unique BSSID (first sighting only). Runs only
    // when the trace session is active and we have a GPS fix. The callback must not
    // touch the SD card, so it just hands a self-contained snapshot to the wardrive
    // task over a bounded queue; a full queue is counted, never blocked on.
    if (wardrive_promisc_trace_enabled && wdp_poi_queue && current_gps.valid) {
        wdp_poi_msg_t poi;
        memcpy(poi.bssid, ap_bssid, 6);
        strncpy(poi.ssid, ssid, sizeof(poi.ssid) - 1);
        poi.ssid[sizeof(poi.ssid) - 1] = '\0';
        poi.rssi     = (int8_t)pkt->rx_ctrl.rssi;
        poi.channel  = beacon_channel;
        poi.authmode = authmode;
        poi.lat      = current_gps.latitude;
        poi.lon      = current_gps.longitude;
        poi.alt      = current_gps.altitude;
        poi.acc      = current_gps.accuracy;
        poi.ts       = g_gps_clock_synced ? time(NULL) : (time_t)0;
        if (xQueueSend(wdp_poi_queue, &poi, 0) != pdTRUE) {
            wdp_poi_dropped++;
        }
    }

    char mac_str[18];
    snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
             ap_bssid[0], ap_bssid[1], ap_bssid[2],
             ap_bssid[3], ap_bssid[4], ap_bssid[5]);

    char escaped_ssid[64];
    escape_csv_field(ssid, escaped_ssid, sizeof(escaped_ssid));

    const char *auth_str = get_auth_mode_wiggle(authmode);

    char timestamp[32];
    get_timestamp_string(timestamp, sizeof(timestamp));

    if (current_gps.valid) {
        printf("%s,%s,[%s],%s,%d,%d,%.7f,%.7f,%.2f,%.2f,WIFI\n",
               mac_str, escaped_ssid, auth_str, timestamp,
               beacon_channel, (int)pkt->rx_ctrl.rssi,
               current_gps.latitude, current_gps.longitude,
               current_gps.altitude, current_gps.accuracy);
    } else {
        printf("%s,%s,[%s],%s,%d,%d,0.0000000,0.0000000,0.00,0.00,WIFI\n",
               mac_str, escaped_ssid, auth_str, timestamp,
               beacon_channel, (int)pkt->rx_ctrl.rssi);
    }
}

// Evict up to `target` of the oldest already-written (not pending) entries, compacting
// the array toward the front. Returns how many were freed.
// Safe to call ONLY with promiscuous disabled (mutates the array the callback reads).
static int wdp_evict_written_networks(int target) {
    int to_evict = target;
    int evicted = 0;
    int write_idx = 0;
    for (int read_idx = 0; read_idx < wdp_seen_count; read_idx++) {
        if (to_evict > 0 && !wdp_seen_networks[read_idx].needs_log) {
            to_evict--;
            evicted++;
            continue;  // drop this (oldest written) entry
        }
        if (write_idx != read_idx) {
            wdp_seen_networks[write_idx] = wdp_seen_networks[read_idx];
        }
        write_idx++;
    }
    wdp_seen_count = write_idx;
    return evicted;
}

static bool wdp_grow_network_buffer(void) {
    if (wdp_seen_capacity >= (int)g_wd_cfg.mem_cap) {
        return false;  // at the configured memory cap — caller evicts instead of growing
    }
    int new_capacity = wdp_seen_capacity * 2;
    if (new_capacity > (int)g_wd_cfg.mem_cap) new_capacity = (int)g_wd_cfg.mem_cap;
    size_t new_size = (size_t)new_capacity * sizeof(wdp_network_t);
    size_t free_psram = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);

    if (free_psram < new_size + WDP_PSRAM_RESERVE_BYTES) {
        MY_LOG_INFO(TAG, "Cannot grow wardrive buffer: only %u bytes free PSRAM (need %u + %u reserve)",
                    (unsigned)free_psram, (unsigned)new_size, (unsigned)WDP_PSRAM_RESERVE_BYTES);
        return false;
    }

    wdp_network_t *new_buf = heap_caps_realloc(wdp_seen_networks, new_size, MALLOC_CAP_SPIRAM);
    if (!new_buf) {
        MY_LOG_INFO(TAG, "Failed to realloc wardrive buffer to %d entries", new_capacity);
        return false;
    }

    memset(&new_buf[wdp_seen_capacity], 0, (size_t)(new_capacity - wdp_seen_capacity) * sizeof(wdp_network_t));
    wdp_seen_networks = new_buf;
    wdp_seen_capacity = new_capacity;
    wdp_needs_grow = false;

    MY_LOG_INFO(TAG, "Wardrive buffer grown to %d entries (%.1f KB PSRAM)",
                new_capacity, (float)new_size / 1024.0f);
    return true;
}

static void wardrive_promisc_task(void *pvParameters) {
    (void)pvParameters;

    MY_LOG_INFO(TAG, "Wardrive promisc task started.");
    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    esp_err_t led_err = led_set_color(255, 0, 255); // Magenta
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for wardrive promisc: %s", esp_err_to_name(led_err));
    }

    // Finalize any trace KML left unclosed by a previous power-loss (e.g. dead battery)
    // before this session starts writing a new one, so old traces open in Google Earth.
    wardrive_kml_repair_orphans();

    double wdp_total_distance_m = 0.0;
    // Session file base + paths are decided AFTER the GPS fix (below) so the names can use
    // real UTC time. Declared here (before any `goto cleanup`) and left empty until then.
    char wardrive_base[32] = "";
    char wardrive_csv_path[80] = "";

    // Trace state (only used when wardrive_promisc_trace_enabled). We write to a
    // ".inprogress.kml" during the session and atomically rename it to the final
    // ".kml" on a clean stop, so a power loss leaves a repairable partial file.
    memset(&wdp_trace, 0, sizeof(wdp_trace));
    wdp_poi_dropped = 0;
    wardrive_promisc_trace_path[0] = '\0';

    MY_LOG_INFO(TAG, "Waiting for GPS fix (no timeout - use 'stop' to cancel)...");
    oled_display_update_full("> Wardrive Pro", "  Waiting GPS...", "  No timeout", "  Use 'stop'");
    if (!wait_for_gps_fix(0)) {
        MY_LOG_INFO(TAG, "Warning: No GPS fix obtained, not continuing without GPS data - please ensure clear view of the sky and try again.");
        oled_display_update_full("> Wardrive Pro", "  No GPS fix!", "  Stopping...", "");
        goto cleanup;
    }
    MY_LOG_INFO(TAG, "GPS fix obtained: Lat=%.7f Lon=%.7f",
                current_gps.latitude, current_gps.longitude);
    oled_display_update_full("> Wardrive Pro", "  GPS fix OK!", "  D-UCB scanning", "");

    // Name the session files from real UTC once the clock is seeded from $GxRMC. That
    // usually already happened inside wait_for_gps_fix; give RMC a short bounded window
    // in case it trailed the GGA fix. Falls back to the "wN" counter if no time arrives.
    if (!external_feed) {
        int64_t clk_t0 = esp_timer_get_time();
        while (!g_gps_clock_synced && (esp_timer_get_time() - clk_t0) < 3000000LL &&
               wardrive_promisc_active && !operation_stop_requested) {
            int glen = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer,
                                       GPS_BUF_SIZE - 1, pdMS_TO_TICKS(200));
            if (glen > 0) {
                wardrive_gps_buffer[glen] = '\0';
                char *gline = strtok(wardrive_gps_buffer, "\r\n");
                while (gline) { parse_gps_nmea(gline); gline = strtok(NULL, "\r\n"); }
            }
        }
    }
    wardrive_make_session_base(wardrive_base, sizeof(wardrive_base));
    snprintf(wardrive_csv_path, sizeof(wardrive_csv_path),
             "/sdcard/lab/wardrives/%s.log", wardrive_base);
    {
        char active_name[64];
        snprintf(active_name, sizeof(active_name), "%s.log", wardrive_base);
        wardrive_set_active_log(active_name);
    }
    if (wardrive_promisc_trace_enabled) {
        snprintf(wardrive_promisc_trace_path, sizeof(wardrive_promisc_trace_path),
                 "/sdcard/lab/wardrives/%s_track.inprogress.kml", wardrive_base);
    }
    MY_LOG_INFO(TAG, "Wardrive session files: %s.log%s (%s)",
                wardrive_base, wardrive_promisc_trace_enabled ? " + _track.kml" : "",
                g_gps_clock_synced ? "GPS UTC time" : "counter fallback");

    if (wardrive_promisc_trace_enabled) {
        wdp_poi_queue = xQueueCreate(WDP_POI_QUEUE_LEN, sizeof(wdp_poi_msg_t));
        if (wdp_poi_queue && wardrive_trace_init_file(wardrive_promisc_trace_path)) {
            wdp_trace.active = true;
            // Seed the first trace vertex from the initial fix.
            wdp_trace_add_point(wardrive_promisc_trace_path, &wdp_trace,
                                current_gps.latitude, current_gps.longitude,
                                current_gps.altitude, &wdp_total_distance_m);
            wdp_trace.last_seg_us = esp_timer_get_time();
            MY_LOG_INFO(TAG, "Wardrive trace enabled: %s", wardrive_promisc_trace_path);
        } else {
            MY_LOG_INFO(TAG, "Failed to start wardrive trace (file/queue): %s", wardrive_promisc_trace_path);
            if (wdp_poi_queue) { vQueueDelete(wdp_poi_queue); wdp_poi_queue = NULL; }
            wardrive_promisc_trace_enabled = false;
            wardrive_promisc_trace_path[0] = '\0';
        }
    }

    wdp_seen_count = 0;
    wdp_dwell_new_networks = 0;
    wdp_needs_grow = false;
    wdp_relog_pending = false;
    wdp_relog_writes = 0;
    memset(wdp_seen_networks, 0, (size_t)wdp_seen_capacity * sizeof(wdp_network_t));
    wdp_ducb_init(&g_wd_cfg);

    // No WiFi channels selected => BLE-only mode (no promiscuous, no channel hop).
    const bool wifi_scan_enabled = (wdp_ducb_channel_count > 0);

    if (wifi_scan_enabled) {
        // Match the band mode to the selected bands so set_channel can reach 5 GHz.
        // 2.4+5 must be AUTO; single-band uses the dedicated mode (less RF overhead).
        const bool want_24 = (g_wd_cfg.bands & WD_BAND_24) != 0;
        const bool want_5  = (g_wd_cfg.bands & WD_BAND_5) != 0;
        wifi_band_mode_t band_mode = WIFI_BAND_MODE_AUTO;
        if (want_24 && want_5)  band_mode = WIFI_BAND_MODE_AUTO;
        else if (want_5)        band_mode = WIFI_BAND_MODE_5G_ONLY;
        else                    band_mode = WIFI_BAND_MODE_2G_ONLY;
        esp_err_t bm_err = esp_wifi_set_band_mode(band_mode);
        if (bm_err != ESP_OK) {
            MY_LOG_INFO(TAG, "esp_wifi_set_band_mode(%d) failed: %s (continuing)",
                        (int)band_mode, esp_err_to_name(bm_err));
        }

        wifi_promiscuous_filter_t filter = {
            .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT
        };
        esp_wifi_set_promiscuous_filter(&filter);
        esp_wifi_set_promiscuous_rx_cb(wdp_promiscuous_cb);
        esp_wifi_set_promiscuous(true);
    }

    {
        char wd_bands[24];
        wardrive_config_format_bands(wd_bands, sizeof(wd_bands));
        MY_LOG_INFO(TAG, "Promiscuous wardrive started. Bands: %s, WiFi channels: %d%s",
                    wd_bands, wdp_ducb_channel_count,
                    wifi_scan_enabled ? "" : " (BLE-only mode)");
    }
    MY_LOG_INFO(TAG, "Use 'stop' command to stop.");

    // Start BLE scanning in background (coexistence handled by ESP-IDF)
    bt_reset_counters();
    bool wdp_bt_enabled = nimble_initialized && (g_wd_cfg.bands & WD_BAND_BLE);
    bool wdp_bt_running = false;
    if (wdp_bt_enabled) {
        wdp_bt_running = (bt_start_scan_coex() == 0);
    }
    int wdp_bt_flush_count = 0;
    if (wdp_bt_running) {
        MY_LOG_INFO(TAG, "BLE scan started alongside WiFi promiscuous capture.");
    } else {
        MY_LOG_INFO(TAG, "BLE scan unavailable, logging WiFi only.");
        wdp_bt_enabled = false;
    }

    int64_t last_stats_time = esp_timer_get_time();
    int last_flush_count = 0;
    int gps_fix_lost_count = 0;
    #define WDP_GPS_FIX_LOST_THRESHOLD 3

