brokali/projectZeroTouch/ESP32C5/main/main.c
    // Startup cooldown: drop everything seen in the first N seconds so the start area
    // (e.g. home) is not logged. Counts from here (after the initial GPS fix).
    wdp_log_gate_until_us = esp_timer_get_time() + (int64_t)g_wd_cfg.startup_cooldown_s * 1000000LL;
    if (g_wd_cfg.startup_cooldown_s > 0) {
        MY_LOG_INFO(TAG, "Startup cooldown: dropping scans for the first %u s",
                    (unsigned)g_wd_cfg.startup_cooldown_s);
    }

    while (wardrive_promisc_active && !operation_stop_requested) {
        if (external_feed) {
            gps_sync_from_selected_external_source();
        }
        if (external_feed && !current_gps.valid) {
            MY_LOG_INFO(TAG, "GPS fix lost! Pausing wardrive...");
            oled_display_update_full("> Wardrive Pro", "  GPS fix lost!", "  Pausing...", "");
            if (wifi_scan_enabled) esp_wifi_set_promiscuous(false);
            if (wdp_bt_running) {
                bt_stop_scan();
                wdp_bt_running = false;
            }
            while (!current_gps.valid && wardrive_promisc_active && !operation_stop_requested) {
                gps_sync_from_selected_external_source();
                vTaskDelay(pdMS_TO_TICKS(200));
            }
            if (!wardrive_promisc_active || operation_stop_requested) break;
            MY_LOG_INFO(TAG, "GPS fix recovered: Lat=%.7f Lon=%.7f. Resuming wardrive.",
                        current_gps.latitude, current_gps.longitude);
            oled_display_update_full("> Wardrive Pro", "  GPS recovered!", "  Resuming...", "");
            if (wifi_scan_enabled) esp_wifi_set_promiscuous(true);
            if (wdp_bt_enabled) {
                wdp_bt_running = (bt_start_scan_coex() == 0);
                if (!wdp_bt_running) {
                    MY_LOG_INFO(TAG, "Failed to resume BLE scan after GPS recovery.");
                }
            }
        }

        int ch_idx = 0;
        int channel = 0;
        int dwell_ms = WDP_DWELL_DEFAULT_MS;
        if (wifi_scan_enabled) {
            ch_idx = wdp_ducb_select_channel();
            channel = wdp_ducb_channels[ch_idx].channel;
            dwell_ms = wdp_get_dwell_ms(wdp_ducb_channels[ch_idx].tier);
            esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
        } else {
            dwell_ms = 1000;  // BLE-only: no channel hop, steady dwell
        }

        {
            static int64_t wdp_oled_last_us = 0;
            int64_t wdp_now_us = esp_timer_get_time();
            if (wdp_now_us - wdp_oled_last_us > 2000000) {
                wdp_oled_last_us = wdp_now_us;
                char wdp_l2[64], wdp_l3[64], wdp_l4[64];
                if (wifi_scan_enabled)
                    snprintf(wdp_l2, sizeof(wdp_l2), "  Ch %d  D-UCB", channel);
                else
                    snprintf(wdp_l2, sizeof(wdp_l2), "  BLE-only scan");
                snprintf(wdp_l3, sizeof(wdp_l3), "  %d networks", wdp_seen_count);
                snprintf(wdp_l4, sizeof(wdp_l4), "  GPS:%s SAT:%d",
                         current_gps.valid ? "OK" : "LOST", current_gps.satellites);
                oled_display_update_full("> Wardrive Pro", wdp_l2, wdp_l3, wdp_l4);
            }
        }

        wdp_dwell_new_networks = 0;

        vTaskDelay(pdMS_TO_TICKS(dwell_ms));

        if (!wardrive_promisc_active || operation_stop_requested) break;

        // Grow network buffer if needed (safe: promiscuous disabled during realloc)
        if (wdp_needs_grow) {
            esp_wifi_set_promiscuous(false);
            if (wdp_grow_network_buffer()) {
                MY_LOG_INFO(TAG, "Network buffer expanded, capacity now %d", wdp_seen_capacity);
            } else {
                // At the memory cap (or PSRAM exhausted): reclaim slots by evicting the
                // oldest entries already written to SD. Their data is safe in the CSV.
                int evicted = wdp_evict_written_networks((int)(g_wd_cfg.mem_cap / 4));
                if (evicted > 0) {
                    MY_LOG_INFO(TAG, "Memory cap %u reached: evicted %d oldest logged entries (now %d/%d)",
                                (unsigned)g_wd_cfg.mem_cap, evicted, wdp_seen_count, wdp_seen_capacity);
                } else {
                    MY_LOG_INFO(TAG, "Memory cap %u reached, nothing flushed to evict yet (%d/%d)",
                                (unsigned)g_wd_cfg.mem_cap, wdp_seen_count, wdp_seen_capacity);
                }
                wdp_needs_grow = false;
            }
            esp_wifi_set_promiscuous(true);
        }

        // Read GPS source
        int gps_len = 0;
        if (!external_feed) {
            gps_len = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer, GPS_BUF_SIZE - 1, pdMS_TO_TICKS(10));
            if (gps_len > 0) {
                wardrive_gps_buffer[gps_len] = '\0';
                char *line = strtok(wardrive_gps_buffer, "\r\n");
                while (line != NULL) {
                    parse_gps_nmea(line);
                    line = strtok(NULL, "\r\n");
                }
            }
        }

        if (!current_gps.valid) {
            gps_fix_lost_count++;
        } else {
            gps_fix_lost_count = 0;
            // Trace: buffer a new vertex once we've moved >= 3 m; the buffer is flushed
            // as a complete <Placemark><LineString> segment inside wdp_trace_add_point
            // when it fills (16 points), or by the time-based flush below.
            if (wdp_trace.active) {
                wdp_trace_add_point(wardrive_promisc_trace_path, &wdp_trace,
                                    current_gps.latitude, current_gps.longitude,
                                    current_gps.altitude, &wdp_total_distance_m);
            }
        }

        // Trace: drain queued Wi-Fi/BLE POIs (callback -> task) and write them as complete
        // Placemarks, then flush a partial track segment if 15 s elapsed. All KML file
        // writes happen here, on the task, never in the callback.
        if (wdp_trace.active) {
            wdp_poi_msg_t poi;
            int drained = 0;
            while (drained < WDP_POI_QUEUE_LEN && xQueueReceive(wdp_poi_queue, &poi, 0) == pdTRUE) {
                wdp_trace_write_poi(wardrive_promisc_trace_path, &wdp_trace, &poi);
                drained++;
            }
            if (drained > 0) sd_sync();
            if (wdp_trace.seg_n > 0 &&
                (esp_timer_get_time() - wdp_trace.last_seg_us) >= (int64_t)WDP_TRACE_SEG_MS * 1000) {
                wdp_trace_flush_segment(wardrive_promisc_trace_path, &wdp_trace);
            }
        }

