brokali/projectZeroTouch/ESP32C5/main/main.c
        if (gps_fix_lost_count >= WDP_GPS_FIX_LOST_THRESHOLD) {
            MY_LOG_INFO(TAG, "GPS fix lost for %d cycles! Pausing wardrive...", gps_fix_lost_count);
            if (wifi_scan_enabled) esp_wifi_set_promiscuous(false);
            if (wdp_bt_running) {
                bt_stop_scan();
                wdp_bt_running = false;
            }

            while (!current_gps.valid && wardrive_promisc_active && !operation_stop_requested) {
                if (external_feed) {
                    gps_sync_from_selected_external_source();
                    vTaskDelay(pdMS_TO_TICKS(200));
                } else {
                    gps_len = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer,
                                              GPS_BUF_SIZE - 1, pdMS_TO_TICKS(1000));
                    if (gps_len > 0) {
                        wardrive_gps_buffer[gps_len] = '\0';
                        char *line = strtok(wardrive_gps_buffer, "\r\n");
                        while (line != NULL) {
                            parse_gps_nmea(line);
                            line = strtok(NULL, "\r\n");
                        }
                    }
                }
            }

            if (!wardrive_promisc_active || operation_stop_requested) break;

            MY_LOG_INFO(TAG, "GPS fix recovered: Lat=%.7f Lon=%.7f. Resuming wardrive.",
                        current_gps.latitude, current_gps.longitude);
            if (wifi_scan_enabled) esp_wifi_set_promiscuous(true);
            if (wdp_bt_enabled) {
                wdp_bt_running = (bt_start_scan_coex() == 0);
                if (!wdp_bt_running) {
                    MY_LOG_INFO(TAG, "Failed to resume BLE scan after GPS recovery.");
                }
            }
            gps_fix_lost_count = 0;
        }

        if (wifi_scan_enabled) {
            double reward = (double)wdp_dwell_new_networks;
            wdp_ducb_update(ch_idx, reward);
        }

        // Flush new entries to SD file periodically
        int current_count = wdp_seen_count;
        int bt_pending = wdp_bt_enabled ? (bt_device_count - wdp_bt_flush_count) : 0;
        bool bt_flush_due = wdp_bt_enabled && bt_pending > 0 &&
                            ((esp_timer_get_time() - last_stats_time) >= WDP_STATS_INTERVAL_US);
        bool relog_flush_due = wdp_relog_pending &&
                            ((esp_timer_get_time() - last_stats_time) >= WDP_STATS_INTERVAL_US);
        if ((current_count - last_flush_count) >= WDP_FILE_FLUSH_INTERVAL ||
            ((current_count > last_flush_count) && ((esp_timer_get_time() - last_stats_time) >= WDP_STATS_INTERVAL_US)) ||
            bt_flush_due || relog_flush_due) {

            // Clear before the write loop; any re-log marked during the loop re-arms it.
            wdp_relog_pending = false;

            char filename[80];
            snprintf(filename, sizeof(filename), "%s", wardrive_csv_path);

            struct stat st;
            if (stat("/sdcard/lab/wardrives", &st) != 0) {
                MY_LOG_INFO(TAG, "Error: /sdcard/lab/wardrives directory not accessible");
            } else {
                FILE *file = fopen(filename, "a");
                if (!file) file = fopen(filename, "w");
                if (file) {
                    fseek(file, 0, SEEK_END);
                    if (ftell(file) == 0) {
                        fprintf(file, "WigleWifi-1.6,appRelease=v1.1,model=MonsterC5,release=v1.0,device=MonsterC5,display=SPI TFT,board=ESP32C5,brand=LAB5\n");
                        fprintf(file, "MAC,SSID,AuthMode,FirstSeen,Channel,Frequency,RSSI,CurrentLatitude,CurrentLongitude,AltitudeMeters,AccuracyMeters,RCOIs,MfgrId,Type\n");
                    }

                    for (int i = 0; i < current_count; i++) {
                        if (!wdp_seen_networks[i].needs_log) continue;

                        char mac_str[18];
                        snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
                                 wdp_seen_networks[i].bssid[0], wdp_seen_networks[i].bssid[1],
                                 wdp_seen_networks[i].bssid[2], wdp_seen_networks[i].bssid[3],
                                 wdp_seen_networks[i].bssid[4], wdp_seen_networks[i].bssid[5]);

                        char escaped_ssid[64];
                        escape_csv_field(wdp_seen_networks[i].ssid, escaped_ssid, sizeof(escaped_ssid));

                        const char *auth_str = get_auth_mode_wiggle(wdp_seen_networks[i].authmode);
                        int wifi_freq_mhz = wigle_wifi_channel_to_frequency_mhz(wdp_seen_networks[i].channel);

                        // Stamp the row with the position + time captured when this AP was
                        // actually observed, not with the flush-time position. If the clock
                        // was seeded after capture (obs_time==0), fall back to "now".
                        char timestamp[32];
                        time_t obs_t = wdp_seen_networks[i].obs_time ? wdp_seen_networks[i].obs_time : time(NULL);
                        format_epoch_utc(obs_t, timestamp, sizeof(timestamp));

                        if (wdp_seen_networks[i].obs_gps_valid) {
                            fprintf(file, "%s,%s,[%s],%s,%d,%d,%d,%.7f,%.7f,%.2f,%.2f,,,WIFI\n",
                                    mac_str, escaped_ssid, auth_str, timestamp,
                                    wdp_seen_networks[i].channel, wifi_freq_mhz, (int)wdp_seen_networks[i].rssi,
                                    wdp_seen_networks[i].obs_lat, wdp_seen_networks[i].obs_lon,
                                    wdp_seen_networks[i].obs_alt, wdp_seen_networks[i].obs_acc);
                        } else {
                            fprintf(file, "%s,%s,[%s],%s,%d,%d,%d,0.0000000,0.0000000,0.00,0.00,,,WIFI\n",
                                    mac_str, escaped_ssid, auth_str, timestamp,
                                    wdp_seen_networks[i].channel, wifi_freq_mhz, (int)wdp_seen_networks[i].rssi);
                        }
                        // Record the baseline for the next re-log decision (from where we logged).
                        if (wdp_seen_networks[i].last_logged_valid) wdp_relog_writes++;  // re-observation row
                        wdp_seen_networks[i].needs_log = false;
                        wdp_seen_networks[i].last_logged_rssi = wdp_seen_networks[i].rssi;
                        if (wdp_seen_networks[i].obs_gps_valid) {
                            wdp_seen_networks[i].last_logged_lat = wdp_seen_networks[i].obs_lat;
                            wdp_seen_networks[i].last_logged_lon = wdp_seen_networks[i].obs_lon;
                            wdp_seen_networks[i].last_logged_valid = true;
                        }
                    }

