brokali/projectZeroTouch/ESP32C5/main/main.c
                    // Flush BT devices collected since last flush
                    if (wdp_bt_enabled) {
                        int bt_total = bt_device_count;
                        for (int i = 0; i < bt_total; i++) {
                            if (!bt_devices[i].needs_log) continue;
                            char bt_mac[18];
                            char escaped_bt_name[64];
                            char bt_mfgr_id[8];
                            bt_format_addr(bt_devices[i].addr, bt_mac);
                            escape_csv_field(bt_devices[i].name, escaped_bt_name, sizeof(escaped_bt_name));
                            if (bt_devices[i].company_id != 0) {
                                snprintf(bt_mfgr_id, sizeof(bt_mfgr_id), "%u", bt_devices[i].company_id);
                            } else {
                                bt_mfgr_id[0] = '\0';
                            }
                            const char *bt_cap = bt_devices[i].is_airtag  ? "AirTag [LE]"  :
                                                 bt_devices[i].is_smarttag ? "SmartTag [LE]" : "Misc [LE]";
                            // Stamp with the observation snapshot (see WiFi rows above).
                            char bt_ts[32];
                            time_t bt_obs_t = bt_devices[i].obs_time ? bt_devices[i].obs_time : time(NULL);
                            format_epoch_utc(bt_obs_t, bt_ts, sizeof(bt_ts));
                            if (bt_devices[i].obs_gps_valid) {
                                fprintf(file, "%s,%s,%s,%s,0,,%d,%.7f,%.7f,%.2f,%.2f,,%s,BLE\n",
                                        bt_mac, escaped_bt_name, bt_cap, bt_ts,
                                        (int)bt_devices[i].rssi,
                                        bt_devices[i].obs_lat, bt_devices[i].obs_lon,
                                        bt_devices[i].obs_alt, bt_devices[i].obs_acc, bt_mfgr_id);
                                printf("%s,%s,%s,%s,0,,%d,%.7f,%.7f,%.2f,%.2f,,%s,BLE\n",
                                       bt_mac, escaped_bt_name, bt_cap, bt_ts,
                                       (int)bt_devices[i].rssi,
                                       bt_devices[i].obs_lat, bt_devices[i].obs_lon,
                                       bt_devices[i].obs_alt, bt_devices[i].obs_acc, bt_mfgr_id);
                            } else {
                                fprintf(file, "%s,%s,%s,%s,0,,%d,0.0000000,0.0000000,0.00,0.00,,%s,BLE\n",
                                        bt_mac, escaped_bt_name, bt_cap, bt_ts,
                                        (int)bt_devices[i].rssi, bt_mfgr_id);
                                printf("%s,%s,%s,%s,0,,%d,0.0000000,0.0000000,0.00,0.00,,%s,BLE\n",
                                       bt_mac, escaped_bt_name, bt_cap, bt_ts,
                                       (int)bt_devices[i].rssi, bt_mfgr_id);
                            }
                            // Baseline for the next re-log decision (from where we logged).
                            if (bt_devices[i].last_logged_valid) wdp_relog_writes++;
                            bt_devices[i].needs_log = false;
                            bt_devices[i].last_logged_rssi = bt_devices[i].rssi;
                            if (bt_devices[i].obs_gps_valid) {
                                bt_devices[i].last_logged_lat = bt_devices[i].obs_lat;
                                bt_devices[i].last_logged_lon = bt_devices[i].obs_lon;
                                bt_devices[i].last_logged_valid = true;
                            }
                        }
                        wdp_bt_flush_count = bt_total;
                    }

                    fclose(file);
                    sd_sync();
                    last_flush_count = current_count;
                    MY_LOG_INFO(TAG, "Flushed %d networks + %d BT devices to %s",
                                current_count, wdp_bt_flush_count, filename);
                    {
                        char wdp_fl3[64];
                        snprintf(wdp_fl3, sizeof(wdp_fl3), "  %d nets %d BT", current_count, wdp_bt_flush_count);
                        oled_display_update_full("> Wardrive Pro", "  Flushed to SD", wdp_fl3, "  D-UCB active");
                    }
                }
            }
        }

        // Periodic stats
        int64_t now = esp_timer_get_time();
        if ((now - last_stats_time) >= WDP_STATS_INTERVAL_US) {
            int top_ch = 0, top_pulls = 0;
            for (int i = 0; i < wdp_ducb_channel_count; i++) {
                if (wdp_ducb_channels[i].total_pulls > top_pulls) {
                    top_pulls = wdp_ducb_channels[i].total_pulls;
                    top_ch = wdp_ducb_channels[i].channel;
                }
            }
            MY_LOG_INFO(TAG, "Wardrive promisc: %d unique networks, %d BT devices, %d relogs, D-UCB best ch: %d (%d visits), GPS: %s, sats: %d, dist: %.1fm",
                        wdp_seen_count, bt_device_count, wdp_relog_writes, top_ch, top_pulls,
                        current_gps.valid ? "valid" : "no fix",
                        current_gps.satellites, wdp_total_distance_m);
            last_stats_time = now;
        }
    }

    if (wifi_scan_enabled) {
        esp_wifi_set_promiscuous(false);
        // Restore default band mode so later 2.4-only features aren't left on a single band.
        esp_wifi_set_band_mode(WIFI_BAND_MODE_AUTO);
    }

    // Stop BLE scan if it was started
    if (wdp_bt_running) {
        bt_stop_scan();
        MY_LOG_INFO(TAG, "BLE scan stopped. Total BT devices seen: %d", bt_device_count);
    }

cleanup:
    // Released before the trace is finalized: from here on nothing appends to the
    // session log, so the scan cache may treat it like any other file again.
    wardrive_set_active_log(NULL);
    if (wdp_trace.active) {
        // Stop the RX callback from enqueuing more POIs, then drain what's left.
        esp_wifi_set_promiscuous(false);
        if (wdp_poi_queue) {
            wdp_poi_msg_t poi;
            while (xQueueReceive(wdp_poi_queue, &poi, 0) == pdTRUE) {
                wdp_trace_write_poi(wardrive_promisc_trace_path, &wdp_trace, &poi);
            }
        }
        // Write the last partial track segment, then close the KML document.
        wdp_trace_flush_segment(wardrive_promisc_trace_path, &wdp_trace);
        wardrive_trace_finalize_file(wardrive_promisc_trace_path);
        sd_sync();

