brokali/projectZeroTouch/ESP32C5/main/main.c
    for (int i = 0; i < n; i++) {
        bt_device_info_t *d = &bt_devices[i];
        if (d->as_alerted) continue;
        if (!d->as_has_origin) continue;
        if (!include_random && antisurv_is_random_mac(d->addr)) continue;
        if ((now - d->as_last_us) > ANTISURV_LOST_TIMEOUT_US) continue;   // not currently in range
        int dur_s = (int)((d->as_last_us - d->as_first_us) / 1000000LL);
        if (dur_s < min_dur_s) continue;
        if (d->as_max_dist_m < (double)min_dist_m) continue;

        char addr_str[18];
        bt_format_addr(d->addr, addr_str);
        const char *type = d->is_airtag ? "AirTag" : d->is_smarttag ? "SmartTag" : "device";
        MY_LOG_INFO(TAG, "[FOLLOWER] MAC=%s name=\"%s\" type=%s rssi=%d seen=%ds travel=%.0fm",
                    addr_str, d->name[0] ? d->name : "", type, d->rssi, dur_s, d->as_max_dist_m);
        d->as_alerted = true;
        alerts++;
    }
    return alerts;
}

static int antisurv_total_alerted(void) {
    int c = 0;
    for (int i = 0; i < bt_device_count; i++) if (bt_devices[i].as_alerted) c++;
    return c;
}

static void antisurv_task(void *pvParameters) {
    (void)pvParameters;
    MY_LOG_INFO(TAG, "Anti-surveillance task started.");

    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    bt_reset_counters();
    if (bt_start_scan() != 0) {
        MY_LOG_INFO(TAG, "Anti-surveillance: BLE scan failed to start.");
        antisurv_active = false;
        antisurv_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    led_set_color(180, 0, 200);   // purple = watching

    int min_dur_s, min_dist_m; bool include_random;
    antisurv_thresholds(g_wd_cfg.antisurv_sensitivity, &min_dur_s, &min_dist_m, &include_random);
    const char *sens_str = (g_wd_cfg.antisurv_sensitivity == WD_AS_LOW)  ? "low" :
                           (g_wd_cfg.antisurv_sensitivity == WD_AS_HIGH) ? "high" : "med";
    MY_LOG_INFO(TAG, "Anti-surveillance: sensitivity=%s (>=%ds, >=%dm, randoms=%s). Use 'stop'.",
                sens_str, min_dur_s, min_dist_m, include_random ? "yes" : "no");
    oled_display_update_full("> Anti-Surveil", "  Watching...", "  Need GPS+move", "  Use 'stop'");

    int64_t last_eval_us = esp_timer_get_time();
    int64_t last_oled_us = 0;

    while (antisurv_active && !operation_stop_requested) {
        // Read GPS (mirror of the wardrive loop).
        if (external_feed) {
            gps_sync_from_selected_external_source();
            vTaskDelay(pdMS_TO_TICKS(200));
        } else {
            int gps_len = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer,
                                          GPS_BUF_SIZE - 1, pdMS_TO_TICKS(200));
            if (gps_len > 0) {
                wardrive_gps_buffer[gps_len] = '\0';
                char *line = strtok(wardrive_gps_buffer, "\r\n");
                while (line != NULL) { parse_gps_nmea(line); line = strtok(NULL, "\r\n"); }
            }
        }

        int64_t now = esp_timer_get_time();
        if (now - last_eval_us >= 3000000LL) {       // evaluate every ~3 s
            last_eval_us = now;
            if (antisurv_evaluate_and_alert() > 0) {
                oled_display_update_full("> Anti-Surveil", "  ! FOLLOWER !",
                                         "  Check serial", "  Use 'stop'");
                led_set_color(255, 0, 0);            // red flash on detection
            }
        }

        if (now - last_oled_us >= 2000000LL) {
            last_oled_us = now;
            char l2[64], l3[64], l4[64];
            snprintf(l2, sizeof(l2), "  %d devices", bt_device_count);
            snprintf(l3, sizeof(l3), "  %d followers", antisurv_total_alerted());
            snprintf(l4, sizeof(l4), "  GPS:%s SAT:%d", current_gps.valid ? "OK" : "--",
                     current_gps.satellites);
            oled_display_update_full("> Anti-Surveil", l2, l3, l4);
        }
    }

    bt_stop_scan();
    led_set_idle();
    MY_LOG_INFO(TAG, "Anti-surveillance stopped. Devices seen: %d, followers flagged: %d",
                bt_device_count, antisurv_total_alerted());
    antisurv_active = false;
    antisurv_task_handle = NULL;
    vTaskDelete(NULL);
}

static int cmd_start_antisurveillance(int argc, char **argv) {
    (void)argc; (void)argv;

    if (antisurv_active || antisurv_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Anti-surveillance already running. Use 'stop' first.");
        return 1;
    }
    if (wardrive_promisc_active || wardrive_promisc_task_handle != NULL ||
        wardrive_active || wardrive_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start anti-surveillance while wardrive is running. Use 'stop' first.");
        return 1;
    }
    if (bt_scan_active || bt_airtag_scan_active || bt_scan_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start anti-surveillance while a BT scan is running. Use 'stop' first.");
        return 1;
    }

    operation_stop_requested = false;

    esp_err_t bt_ret = bt_nimble_init();
    if (bt_ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Anti-surveillance: BLE init failed (%s).", esp_err_to_name(bt_ret));
        return 1;
    }

    const bool external_feed = gps_module_uses_external_feed(current_gps_module);
    if (!external_feed) {
        int baud = gps_get_baud_for_module(current_gps_module);
        if (init_gps_uart(baud) != ESP_OK) {
            MY_LOG_INFO(TAG, "Anti-surveillance: failed to init GPS UART.");
            return 1;
        }
        MY_LOG_INFO(TAG, "GPS UART initialized on pins %d (TX) and %d (RX) at %d baud",
                    GPS_TX_PIN, GPS_RX_PIN, baud);
    } else {
        MY_LOG_INFO(TAG, "Using external GPS feed for anti-surveillance.");
    }

    antisurv_active = true;
    BaseType_t result = xTaskCreate(antisurv_task, "antisurv_task", 8192, NULL, 5, &antisurv_task_handle);
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create anti-surveillance task!");
        antisurv_active = false;
        return 1;
    }
    MY_LOG_INFO(TAG, "Anti-surveillance started. Use 'stop' to stop.");
    return 0;
}

static int cmd_set_antisurv_sensitivity(int argc, char **argv) {
    if (argc < 2) {
        printf("Usage: set_antisurv_sensitivity <low|med|high>\n");
        return 1;
    }
    if (strcmp(argv[1], "low") == 0)       g_wd_cfg.antisurv_sensitivity = WD_AS_LOW;
    else if (strcmp(argv[1], "med") == 0)  g_wd_cfg.antisurv_sensitivity = WD_AS_MED;
    else if (strcmp(argv[1], "high") == 0) g_wd_cfg.antisurv_sensitivity = WD_AS_HIGH;
    else {
        printf("Unknown level '%s'. Valid: low, med, high\n", argv[1]);
        return 1;
    }
    wardrive_config_persist();
    int dur, dist; bool rnd;
    antisurv_thresholds(g_wd_cfg.antisurv_sensitivity, &dur, &dist, &rnd);
    printf("Anti-surveillance sensitivity: %s (>=%ds present, >=%dm travel, randoms=%s)\n",
           argv[1], dur, dist, rnd ? "yes" : "no");
    wardrive_config_print();
    return 0;
}

// ============================================================================
// Sniffer Handshake: AP and Client Management
// ============================================================================

// Find AP by BSSID in hs_ap_targets, return index or -1
static int hs_find_ap(const uint8_t *bssid) {
    for (int i = 0; i < hs_ap_count; i++) {
        if (memcmp(hs_ap_targets[i].bssid, bssid, 6) == 0) {
            return i;
        }
    }
    return -1;
}

// Add or update AP from beacon. Returns index.
static int hs_add_or_update_ap(const uint8_t *bssid, const char *ssid, uint8_t channel,
                                wifi_auth_mode_t authmode, int rssi) {
    int idx = hs_find_ap(bssid);
    if (idx >= 0) {
        // Update existing
        if (ssid && ssid[0]) strncpy(hs_ap_targets[idx].ssid, ssid, 32);
        hs_ap_targets[idx].channel = channel;
        hs_ap_targets[idx].rssi = rssi;
        if (authmode != WIFI_AUTH_OPEN) hs_ap_targets[idx].authmode = authmode;
        return idx;
    }
    if (hs_ap_count >= HS_MAX_APS) return -1;
    
    idx = hs_ap_count++;
    memcpy(hs_ap_targets[idx].bssid, bssid, 6);
    if (ssid) strncpy(hs_ap_targets[idx].ssid, ssid, 32);
    hs_ap_targets[idx].ssid[32] = '\0';
    hs_ap_targets[idx].channel = channel;
    hs_ap_targets[idx].authmode = authmode;
    hs_ap_targets[idx].rssi = rssi;
    hs_ap_targets[idx].captured_m1 = false;
    hs_ap_targets[idx].captured_m2 = false;
    hs_ap_targets[idx].captured_m3 = false;
    hs_ap_targets[idx].captured_m4 = false;
    hs_ap_targets[idx].complete = false;
    hs_ap_targets[idx].beacon_captured = false;
    hs_ap_targets[idx].last_deauth_us = 0;
    
    // Check if we already have a handshake file for this network
    hs_ap_targets[idx].has_existing_file = 
        check_handshake_file_exists(ssid ? ssid : "") ||
        check_handshake_file_exists_by_bssid(bssid);
    
