brokali/projectZeroTouch/ESP32C5/main/main.c
            int ap_idx = hs_find_ap(ap_mac);
            if (ap_idx >= 0 && !hs_ap_targets[ap_idx].has_existing_file && !hs_ap_targets[ap_idx].complete) {
                hs_add_or_update_client(client_mac, ap_idx, pkt->rx_ctrl.rssi);
            }
        }
        return;
    }
    
    // ---- DATA frames: client detection + EAPOL capture ----
    if (type == WIFI_PKT_DATA) {
        uint8_t *client_mac = NULL;
        uint8_t *ap_mac = NULL;
        
        if (to_ds && !from_ds) {
            // STA -> AP
            ap_mac = addr1;
            client_mac = addr2;
        } else if (!to_ds && from_ds) {
            // AP -> STA
            ap_mac = addr2;
            client_mac = addr1;
        } else if (!to_ds && !from_ds) {
            // IBSS
            ap_mac = addr3;
            client_mac = addr2;
        } else {
            return; // WDS
        }
        
        // Skip broadcast/multicast client
        if (client_mac[0] & 0x01) return;
        
        int ap_idx = hs_find_ap(ap_mac);
        if (ap_idx < 0) return; // Unknown AP, ignore
        
        hs_ap_target_t *ap = &hs_ap_targets[ap_idx];
        if (ap->has_existing_file || ap->complete) return; // Already done
        
        // Register client
        hs_add_or_update_client(client_mac, ap_idx, pkt->rx_ctrl.rssi);
        
        // Check for EAPOL: parse the data frame for EAPOL packet
        // The frame payload is a data_frame_t (802.11 data header + LLC/SNAP + EAPOL)
        data_frame_t *data_frame = (data_frame_t *)frame;
        eapol_packet_t *eapol = parse_eapol_packet(data_frame);
        if (!eapol) return; // Not an EAPOL frame
        
        eapol_key_packet_t *eapol_key = parse_eapol_key_packet(eapol);
        if (!eapol_key) return; // Not EAPOL-Key
        
        uint8_t msg_num = hs_get_eapol_msg_num(eapol_key);
        if (msg_num == 0) return;
        
        hs_dwell_eapol_frames++;
        
        bool is_new = false;
        switch (msg_num) {
            case 1: if (!ap->captured_m1) { ap->captured_m1 = true; is_new = true; } break;
            case 2: if (!ap->captured_m2) { ap->captured_m2 = true; is_new = true; } break;
            case 3: if (!ap->captured_m3) { ap->captured_m3 = true; is_new = true; } break;
            case 4: if (!ap->captured_m4) { ap->captured_m4 = true; is_new = true; } break;
        }
        
        if (is_new) {
            MY_LOG_INFO(TAG, "[HS-SNIFF] EAPOL M%d captured for '%s' (%02X:%02X:%02X:%02X:%02X:%02X)",
                       msg_num, ap->ssid,
                       ap->bssid[0], ap->bssid[1], ap->bssid[2], 
                       ap->bssid[3], ap->bssid[4], ap->bssid[5]);
            
            // Append to PCAP
            pcap_serializer_append_frame(frame, len, pkt->rx_ctrl.timestamp);
            
            // Feed to HCCAPX serializer
            hccapx_serializer_add_frame(data_frame);
            
            // Check if complete
            if (ap->captured_m1 && ap->captured_m2 && ap->captured_m3 && ap->captured_m4) {
                ap->complete = true;
                // Tab5 parses: strstr("Handshake captured for") with SSID in quotes
                MY_LOG_INFO(TAG, "Handshake captured for '%s' - all 4 EAPOL messages!", ap->ssid);
            }
        }
    }
}

// Cleanup function for handshake attack
static void handshake_cleanup(void) {
    MY_LOG_INFO(TAG, "Handshake attack cleanup...");
    
    // Stop any active handshake attack (selected mode uses this)
    attack_handshake_stop();
    
    // Disable promiscuous mode (sniffer mode uses this)
    esp_wifi_set_promiscuous(false);
    
    // Reset state
    handshake_attack_active = false;
    handshake_attack_task_handle = NULL;
    handshake_target_count = 0;
    handshake_current_index = 0;
    memset(handshake_targets, 0, MAX_AP_CNT * sizeof(wifi_ap_record_t));
    memset(handshake_captured, 0, sizeof(handshake_captured));
    
    // Reset sniffer handshake state
    hs_ap_count = 0;
    hs_client_count = 0;
    hs_dwell_new_clients = 0;
    hs_dwell_eapol_frames = 0;
    if (hs_ap_targets) memset(hs_ap_targets, 0, HS_MAX_APS * sizeof(hs_ap_target_t));
    if (hs_clients) memset(hs_clients, 0, HS_MAX_CLIENTS * sizeof(hs_client_entry_t));
    
    // Restore idle LED
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED: %s", esp_err_to_name(led_err));
    }
    
    MY_LOG_INFO(TAG, "Handshake attack cleanup complete.");
}

// Quick scan all channels (both 2.4GHz and 5GHz) - 500ms per channel
// (kept for potential future use; currently unused since sniffer+D-UCB replaced scan-all mode)
static void __attribute__((unused)) quick_scan_all_channels(void) {
    MY_LOG_INFO(TAG, "Quick scanning all channels (2.4GHz + 5GHz)...");
    
    // Scan 2.4GHz channels
    for (int i = 0; i < NUM_CHANNELS_24GHZ && handshake_attack_active && !operation_stop_requested; i++) {
        uint8_t channel = channels_24ghz[i];
        esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
        vTaskDelay(pdMS_TO_TICKS(500)); // 500ms per channel
        
        // Scan would happen here via background scan
        // For now we'll use the global scan results
    }
    
    // Scan 5GHz channels  
    for (int i = 0; i < NUM_CHANNELS_5GHZ && handshake_attack_active && !operation_stop_requested; i++) {
        uint8_t channel = channels_5ghz[i];
        esp_wifi_set_channel(channel, WIFI_SECOND_CHAN_NONE);
        vTaskDelay(pdMS_TO_TICKS(500)); // 500ms per channel
    }
    
    MY_LOG_INFO(TAG, "Channel scan complete");
}

// Attack network with deauth burst (5 packets)
static void attack_network_with_burst(const wifi_ap_record_t *ap) {
    MY_LOG_INFO(TAG, "Burst attacking '%s' (Ch %d, RSSI: %d dBm)", 
                ap->ssid, ap->primary, ap->rssi);
    
    char burst_l2[64], burst_l3[64];
    snprintf(burst_l2, sizeof(burst_l2), ">> %s", (const char *)ap->ssid);
    snprintf(burst_l3, sizeof(burst_l3), "  Ch %d  %ddB", ap->primary, ap->rssi);
    
