brokali/projectZeroTouch/ESP32C5/main/main.c
    const char *name_end = sep;
    while (name_end > start && isspace((unsigned char)*(name_end - 1))) {
        name_end--;
    }

    const char *token_start = sep + 1;
    while (*token_start && isspace((unsigned char)*token_start)) {
        token_start++;
    }

    const char *token_end = token_start + strlen(token_start);
    while (token_end > token_start && isspace((unsigned char)*(token_end - 1))) {
        token_end--;
    }

    size_t name_len = (size_t)(name_end - start);
    size_t token_len = (size_t)(token_end - token_start);
    if (name_len == 0 || token_len == 0) {
        return false;
    }
    if (name_len >= api_name_sz || token_len >= api_token_sz) {
        return false;
    }

    memcpy(api_name, start, name_len);
    api_name[name_len] = '\0';
    memcpy(api_token, token_start, token_len);
    api_token[token_len] = '\0';
    return true;
}

// True for the output of wardrive_fix. That file used to land straight in the working
// directory as "<base>.fixed.log", where the directory scans picked it up as a second
// upload candidate sitting next to its own original — which is how
// 20260826_102219.fixed.log came to be uploaded alongside the file it was repaired
// from. Repaired copies now go to /sdcard/lab/wardrives/fixed/ (see
// wardrive_build_fixed_path), and the suffix stays excluded here so any file left over
// from the old layout is ignored too.
//
// Deliberately NOT folded into wigle_is_upload_candidate() /
// wdgwars_is_upload_candidate(): those two also back wigle_resolve_upload_target() and
// wdgwars_resolve_upload_target(), which wardrive_fix uses to resolve its own INPUT and
// which an explicit "wigle_upload <file>" goes through. Rejecting the suffix there
// would make a repaired file impossible to re-fix or to upload by hand.
static bool wardrive_is_fixed_output(const char *filename) {
    if (!filename) {
        return false;
    }
    size_t len = strlen(filename);
    return len > 10 && strcasecmp(filename + len - 10, ".fixed.log") == 0;
}

static bool wigle_is_upload_candidate(const char *filename) {
    if (!filename) {
        return false;
    }
    if (filename[0] == '.' || strcmp(filename, "upload_state.csv") == 0) {
        return false;
    }
    size_t len = strlen(filename);
    if (len > 4 && strcasecmp(filename + len - 4, ".log") == 0) {
        return true;
    }
    if (len > 4 && strcasecmp(filename + len - 4, ".txt") == 0) {
        return true;
    }
    if (len > 4 && strcasecmp(filename + len - 4, ".csv") == 0) {
        return true;
    }
    return false;
}

static bool wdgwars_is_upload_candidate(const char *filename) {
    if (!filename) {
        return false;
    }
    if (filename[0] == '.' || strcmp(filename, "upload_state.csv") == 0) {
        return false;
    }
    size_t len = strlen(filename);
    if (len > 4 && strcasecmp(filename + len - 4, ".log") == 0) {
        return true;
    }
    if (len > 4 && strcasecmp(filename + len - 4, ".csv") == 0) {
        return true;
    }
    if (len > 3 && strcasecmp(filename + len - 3, ".gz") == 0) {
        return true;
    }
    return false;
}

static const char *wigle_basename(const char *path) {
    if (!path) {
        return NULL;
    }
    const char *base = path;
    const char *slash = strrchr(path, '/');
    const char *bslash = strrchr(path, '\\');
    if (slash && bslash) {
        base = (slash > bslash) ? (slash + 1) : (bslash + 1);
    } else if (slash) {
        base = slash + 1;
    } else if (bslash) {
        base = bslash + 1;
    }
    return base;
}

static bool wigle_resolve_upload_target(const char *arg, char *out_path, size_t out_path_sz, char *out_name, size_t out_name_sz) {
    if (!arg || !out_path || !out_name || out_path_sz == 0 || out_name_sz == 0) {
        return false;
    }

    const char *name = wigle_basename(arg);
    if (!name || name[0] == '\0' || !wigle_is_upload_candidate(name)) {
        return false;
    }

    if (strchr(arg, '/') || strchr(arg, '\\')) {
        if (strncmp(arg, "/sdcard/", 8) == 0) {
            snprintf(out_path, out_path_sz, "%s", arg);
        } else if (strncmp(arg, "sdcard/", 7) == 0) {
            snprintf(out_path, out_path_sz, "/%s", arg);
        } else {
            return false;
        }
    } else {
        snprintf(out_path, out_path_sz, "/sdcard/lab/wardrives/%s", name);
    }

    snprintf(out_name, out_name_sz, "%s", name);

    struct stat st;
    if (stat(out_path, &st) != 0 || !S_ISREG(st.st_mode)) {
        return false;
    }
    return true;
}

static bool wdgwars_resolve_upload_target(const char *arg, char *out_path, size_t out_path_sz, char *out_name, size_t out_name_sz) {
    if (!arg || !out_path || !out_name || out_path_sz == 0 || out_name_sz == 0) {
        return false;
    }

    const char *name = wigle_basename(arg);
    if (!name || name[0] == '\0' || !wdgwars_is_upload_candidate(name)) {
        return false;
    }

    if (strchr(arg, '/') || strchr(arg, '\\')) {
        if (strncmp(arg, "/sdcard/", 8) == 0) {
            snprintf(out_path, out_path_sz, "%s", arg);
        } else if (strncmp(arg, "sdcard/", 7) == 0) {
            snprintf(out_path, out_path_sz, "/%s", arg);
        } else {
            return false;
        }
    } else {
        snprintf(out_path, out_path_sz, "/sdcard/lab/wardrives/%s", name);
    }

    snprintf(out_name, out_name_sz, "%s", name);

    struct stat st;
    if (stat(out_path, &st) != 0 || !S_ISREG(st.st_mode)) {
        return false;
    }
    return true;
}

typedef struct {
    int data_rows;
    int wifi_rows;
    int ble_rows;
    int bt_rows;
    int bad_rows;
    bool has_wigle_header;
    bool has_schema_header;
} wdgwars_wigle_stats_t;

#define WDGWARS_SANITIZED_UPLOAD_PATH "/sdcard/lab/wardrives/.wdgwars_upload.tmp"
#define UPLOAD_STATE_PATH "/sdcard/lab/wardrives/upload_state.csv"
#define WDGWARS_WIGLE_HEADER "WigleWifi-1.6,appRelease=v1.1,model=MonsterC5,release=v1.0,device=MonsterC5,display=SPI TFT,board=ESP32C5,brand=LAB5"
#define WDGWARS_WIGLE_SCHEMA "MAC,SSID,AuthMode,FirstSeen,Channel,Frequency,RSSI,CurrentLatitude,CurrentLongitude,AltitudeMeters,AccuracyMeters,RCOIs,MfgrId,Type"

static int count_csv_fields_simple(const char *line) {
    if (!line || line[0] == '\0') {
        return 0;
    }

    int fields = 1;
    bool quoted = false;
    for (const char *p = line; *p != '\0'; p++) {
        if (*p == '"') {
            if (quoted && p[1] == '"') {
                p++;
            } else {
                quoted = !quoted;
            }
        } else if (*p == ',' && !quoted) {
            fields++;
        }
    }
    return fields;
}

static bool csv_last_field_is_type(const char *line, const char *type) {
    if (!line || !type) {
        return false;
    }

    const char *last = strrchr(line, ',');
    if (!last) {
        return false;
    }
    last++;
    while (*last == ' ' || *last == '\t') {
        last++;
    }
    return strcasecmp(last, type) == 0;
}

// The same single-pass classification wdgwars_sanitize_wigle_file() performs, minus the
// sanitized copy. Listing and cleanup only ever wanted the counts, but the only way to
// get them was to run the sanitizer — which read the file a second time and wrote a full
// copy of it that was unlinked moments later. For 63 files that was 25.7 MB read and
// 25.7 MB written per listing, on a card the host is waiting on.
//
// Produces a byte-identical wdgwars_wigle_stats_t (including the .gz and unreadable-file
// cases) and stays silent: the per-file "Preflight WigleWifi-1.6: ..." lines doubled the
// UART traffic of a listing that the host then had to skip over.
static bool wdgwars_scan_wigle_stats(const char *filepath, wdgwars_wigle_stats_t *stats) {
    if (!stats) {
        return false;
    }

