brokali/projectZeroTouch/ESP32C5/main/main.c
    memset(stats, 0, sizeof(*stats));
    if (!filepath) {
        return false;
    }

    size_t path_len = strlen(filepath);
    if (path_len > 3 && strcasecmp(filepath + path_len - 3, ".gz") == 0) {
        // Compressed: not inspectable without inflating, reported as all-zero exactly
        // as the sanitizer's early return does.
        return true;
    }

    FILE *in = fopen(filepath, "r");
    if (!in) {
        return false;
    }

    char line[512];
    while (fgets(line, sizeof(line), in)) {
        line[strcspn(line, "\r\n")] = '\0';
        if (line[0] == '\0') {
            continue;
        }

        if (strncmp(line, "WigleWifi-1.6", 13) == 0) {
            stats->has_wigle_header = true;
            continue;
        }
        if (strcmp(line, WDGWARS_WIGLE_SCHEMA) == 0) {
            stats->has_schema_header = true;
            continue;
        }
        if (strncmp(line, "MAC,SSID,", 9) == 0) {
            stats->bad_rows++;
            continue;
        }

        if (count_csv_fields_simple(line) != 14) {
            stats->bad_rows++;
            continue;
        }

        if (csv_last_field_is_type(line, "WIFI")) {
            stats->wifi_rows++;
        } else if (csv_last_field_is_type(line, "BLE")) {
            stats->ble_rows++;
        } else if (csv_last_field_is_type(line, "BT")) {
            stats->bt_rows++;
        } else {
            stats->bad_rows++;
            continue;
        }

        stats->data_rows++;
    }

    fclose(in);
    return true;
}

static bool wdgwars_sanitize_wigle_file(const char *filepath, wdgwars_wigle_stats_t *stats, bool *use_sanitized) {
    if (use_sanitized) {
        *use_sanitized = false;
    }
    if (!filepath || !stats || !use_sanitized) {
        return false;
    }

    memset(stats, 0, sizeof(*stats));
    size_t path_len = strlen(filepath);
    if (path_len > 3 && strcasecmp(filepath + path_len - 3, ".gz") == 0) {
        MY_LOG_INFO(TAG, "  Preflight WigleWifi-1.6: skipped for compressed .gz file");
        return true;
    }

    FILE *in = fopen(filepath, "r");
    if (!in) {
        MY_LOG_INFO(TAG, "  Preflight: cannot open file for schema check");
        return false;
    }

    FILE *out = fopen(WDGWARS_SANITIZED_UPLOAD_PATH, "w");
    if (!out) {
        fclose(in);
        MY_LOG_INFO(TAG, "  Preflight: cannot create sanitized upload file");
        return false;
    }

    fprintf(out, "%s\n%s\n", WDGWARS_WIGLE_HEADER, WDGWARS_WIGLE_SCHEMA);

    char line[512];
    while (fgets(line, sizeof(line), in)) {
        line[strcspn(line, "\r\n")] = '\0';
        if (line[0] == '\0') {
            continue;
        }

        if (strncmp(line, "WigleWifi-1.6", 13) == 0) {
            stats->has_wigle_header = true;
            continue;
        }
        if (strcmp(line, WDGWARS_WIGLE_SCHEMA) == 0) {
            stats->has_schema_header = true;
            continue;
        }
        if (strncmp(line, "MAC,SSID,", 9) == 0) {
            stats->bad_rows++;
            continue;
        }

        int fields = count_csv_fields_simple(line);
        if (fields != 14) {
            stats->bad_rows++;
            continue;
        }

        const char *type = NULL;
        if (csv_last_field_is_type(line, "WIFI")) {
            stats->wifi_rows++;
            type = "WIFI";
        } else if (csv_last_field_is_type(line, "BLE")) {
            stats->ble_rows++;
            type = "BLE";
        } else if (csv_last_field_is_type(line, "BT")) {
            stats->bt_rows++;
            type = "BT";
        }

        if (!type) {
            stats->bad_rows++;
            continue;
        }

        stats->data_rows++;
        fprintf(out, "%s\n", line);
    }

    fclose(in);
    fclose(out);

    bool changed = stats->bad_rows > 0 || !stats->has_wigle_header || !stats->has_schema_header;
    *use_sanitized = changed;

    MY_LOG_INFO(TAG, "  Preflight WigleWifi-1.6: header=%s schema=%s rows=%d wifi=%d ble=%d bt=%d bad=%d",
                stats->has_wigle_header ? "yes" : "no",
                stats->has_schema_header ? "yes" : "no",
                stats->data_rows, stats->wifi_rows, stats->ble_rows,
                stats->bt_rows, stats->bad_rows);

    if (changed) {
        MY_LOG_INFO(TAG, "  Sanitized copy prepared: removed %d bad row(s), added missing headers if needed",
                    stats->bad_rows);
    } else {
        unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
    }
    return true;
}

#define WARDRIVE_FIXED_DIR "/sdcard/lab/wardrives/fixed"

// Repaired copies go to a sibling directory, not back into the working directory.
// Writing "<base>.fixed.log" next to its original made it a second upload candidate
// for the very same data, and both got uploaded.
//
// The alternative — replacing the original in place — was rejected: it changes the
// file's size and hash, and upload_state.csv keys its rows on exactly that pair. Every
// journal row for that file would stop resolving and an already-uploaded wardrive would
// come back as "pending", which is the failure the journal exists to prevent.
static void wardrive_build_fixed_path(const char *filename, char *out, size_t out_sz) {
    char base[128];
    snprintf(base, sizeof(base), "%s", filename ? filename : "wardrive.log");
    char *dot = strrchr(base, '.');
    if (dot && dot != base) {
        *dot = '\0';
    }
    snprintf(out, out_sz, WARDRIVE_FIXED_DIR "/%s.fixed.log", base);
}

static bool wardrive_fix_file_soft(const char *filepath, const char *filename,
                                   char *out_path, size_t out_path_sz,
                                   wdgwars_wigle_stats_t *stats) {
    if (!filepath || !filename || !out_path || out_path_sz == 0 || !stats) {
        return false;
    }

    memset(stats, 0, sizeof(*stats));
    size_t path_len = strlen(filepath);
    if (path_len > 3 && strcasecmp(filepath + path_len - 3, ".gz") == 0) {
        MY_LOG_INFO(TAG, "wardrive_fix does not repair compressed .gz files");
        return false;
    }

    FILE *in = fopen(filepath, "r");
    if (!in) {
        MY_LOG_INFO(TAG, "wardrive_fix: cannot open %s", filepath);
        return false;
    }

