brokali/projectZeroTouch/ESP32C5/main/main.c
    wardrive_build_fixed_path(filename, out_path, out_path_sz);
    sd_mkdir_recursive(WARDRIVE_FIXED_DIR);
    FILE *out = fopen(out_path, "w");
    if (!out) {
        fclose(in);
        MY_LOG_INFO(TAG, "wardrive_fix: cannot create %s", out_path);
        return false;
    }

    fprintf(out, "%s\n%s\n", WDGWARS_WIGLE_HEADER, WDGWARS_WIGLE_SCHEMA);

    char line[512];
    while (fgets(line, sizeof(line), in)) {
        line[strcspn(line, "\r\n")] = '\0';
        if (line[0] == '\0') {
            continue;
        }

        if (strncmp(line, "WigleWifi-1.6", 13) == 0) {
            stats->has_wigle_header = true;
            continue;
        }
        if (strcmp(line, WDGWARS_WIGLE_SCHEMA) == 0) {
            stats->has_schema_header = true;
            continue;
        }
        if (strncmp(line, "MAC,SSID,", 9) == 0) {
            stats->bad_rows++;
            continue;
        }

        if (count_csv_fields_simple(line) != 14) {
            stats->bad_rows++;
            continue;
        }

        if (csv_last_field_is_type(line, "WIFI")) {
            stats->wifi_rows++;
        } else if (csv_last_field_is_type(line, "BLE")) {
            stats->ble_rows++;
        } else if (csv_last_field_is_type(line, "BT")) {
            stats->bt_rows++;
        } else {
            stats->bad_rows++;
            continue;
        }

        stats->data_rows++;
        fprintf(out, "%s\n", line);
    }

    fclose(in);
    fclose(out);
    sd_sync();

    // Future hard-repair concept:
    // Keep a bounded accumulator (for example 2 KB), append up to a few physical
    // lines when CSV quotes are unbalanced or field count is wrong, and emit the
    // merged record only if it becomes a valid 14-field WigleWifi row. This is
    // intentionally not automatic yet because guessing broken records can corrupt
    // coordinates or device identity; the soft mode only drops unsafe rows.
    return true;
}

// Finalize a truncated wardrive trace KML: copy everything up to and including the last
// complete </Placemark>, then append the closing tags and publish as the final
// "_track.kml". Fixes files left by a hard power-off (dead battery) that Google Earth
// refuses to open because the document is not closed.
static bool wardrive_kml_finalize_orphan(const char *inprogress_path) {
    if (!inprogress_path) return false;

    FILE *in = fopen(inprogress_path, "r");
    if (!in) return false;

    // Pass 1: byte offset just past the last complete "</Placemark>" line. Anything
    // after it is a half-written record from the power-loss and gets dropped.
    long cut = 0;
    char line[512];
    while (fgets(line, sizeof(line), in)) {
        if (strstr(line, "</Placemark>") != NULL) {
            cut = ftell(in);
        }
    }
    if (cut <= 0) {
        fclose(in);
        MY_LOG_INFO(TAG, "wardrive_fix_kml: no complete placemark in %s", inprogress_path);
        return false;
    }

    // Derive the final path: "..._track.inprogress.kml" -> "..._track.kml".
    char final_path[128];
    snprintf(final_path, sizeof(final_path), "%s", inprogress_path);
    char *ip = strstr(final_path, ".inprogress.kml");
    if (ip) {
        snprintf(ip, sizeof(final_path) - (size_t)(ip - final_path), ".kml");
    } else {
        snprintf(final_path, sizeof(final_path), "%s.fixed.kml", inprogress_path);
    }

    FILE *out = fopen(final_path, "w");
    if (!out) {
        fclose(in);
        return false;
    }

    // Pass 2: copy the valid prefix, then close the KML document.
    rewind(in);
    long remaining = cut;
    char buf[512];
    while (remaining > 0) {
        size_t want = remaining < (long)sizeof(buf) ? (size_t)remaining : sizeof(buf);
        size_t got = fread(buf, 1, want, in);
        if (got == 0) break;
        fwrite(buf, 1, got, out);
        remaining -= (long)got;
    }
    fprintf(out, "  </Folder>\n</Document>\n</kml>\n");
    fclose(in);
    fclose(out);
    sd_sync();

    // Drop the broken in-progress file now that a valid copy exists.
    unlink(inprogress_path);
    sd_sync();
    return true;
}

// Scan the wardrives folder and finalize any orphaned "*_track.inprogress.kml" left by a
// session that didn't stop cleanly. Names are collected before repairing so the directory
// is not modified mid-iteration. Called at wardrive start (SD is mounted then).
static void wardrive_kml_repair_orphans(void) {
    DIR *dir = opendir("/sdcard/lab/wardrives");
    if (!dir) return;

    char names[8][96];
    int n = 0;
    const char *suffix = "_track.inprogress.kml";
    size_t slen = strlen(suffix);
    struct dirent *entry;
    while (n < 8 && (entry = readdir(dir)) != NULL) {
        const char *nm = entry->d_name;
        size_t len = strlen(nm);
        if (len > slen && strcmp(nm + len - slen, suffix) == 0) {
            snprintf(names[n], sizeof(names[n]), "%.95s", nm);
            n++;
        }
    }
    closedir(dir);

    int fixed = 0;
    for (int i = 0; i < n; i++) {
        char path[128];
        snprintf(path, sizeof(path), "/sdcard/lab/wardrives/%s", names[i]);
        if (wardrive_kml_finalize_orphan(path)) {
            fixed++;
            MY_LOG_INFO(TAG, "Repaired orphaned trace KML: %s", names[i]);
        }
    }
    if (fixed > 0) {
        MY_LOG_INFO(TAG, "Wardrive: finalized %d orphaned trace KML file(s).", fixed);
    }
}

// Command: repair one truncated trace KML on demand (mirrors wardrive_fix for .log).
static int cmd_wardrive_fix_kml(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wardrive_fix_kml <file>");
        return 1;
    }
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char path[128];
    if (argv[1][0] == '/') snprintf(path, sizeof(path), "%s", argv[1]);
    else snprintf(path, sizeof(path), "/sdcard/lab/wardrives/%s", argv[1]);

    printf("[WARD_FIX_KML] BEGIN\n");
    if (wardrive_kml_finalize_orphan(path)) {
        printf("[WARD_FIX_KML] file=%s status=ok\n", argv[1]);
        printf("[WARD_FIX_KML] END\n");
        return 0;
    }
    printf("[WARD_FIX_KML] file=%s status=failed\n", argv[1]);
    printf("[WARD_FIX_KML] END\n");
    return 1;
}

