brokali/projectZeroTouch/ESP32C5/main/main.c
static bool wardrive_collect_file_id(const char *filepath, long *out_size, uint32_t *out_hash) {
    const size_t CHUNK_SIZE = 2048;
    FILE *f = fopen(filepath, "rb");
    if (!f) {
        return false;
    }

    uint8_t *buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!buf) {
        buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (!buf) {
        fclose(f);
        return false;
    }

    uint32_t hash = 2166136261u; // FNV-1a 32-bit
    long size = 0;
    while (1) {
        size_t n = fread(buf, 1, CHUNK_SIZE, f);
        for (size_t i = 0; i < n; i++) {
            hash ^= buf[i];
            hash *= 16777619u;
        }
        size += (long)n;
        if (n < CHUNK_SIZE) {
            if (ferror(f)) {
                free(buf);
                fclose(f);
                return false;
            }
            break;
        }
    }

    free(buf);
    fclose(f);
    if (out_size) {
        *out_size = size;
    }
    if (out_hash) {
        *out_hash = hash;
    }
    return true;
}

/* ---------------------------------------------------------------------------
 * Wardrive scan cache
 *
 * Listing and cleanup used to cost O(all bytes in /sdcard/lab/wardrives): every
 * candidate was hashed in full and then run through the sanitizer, which read it
 * again and wrote a complete copy that was immediately unlinked. For a real card
 * with 63 files and 25.7 MB that is ~52 MB read and ~26 MB written per command,
 * which is why `wardrive_files` produced 48 of 63 entries in 131 s and never
 * reached its END marker before the host gave up at 120 s.
 *
 * A row here records what a full scan of one file produced, keyed on the triple
 * (filename, size, mtime). All three must match for a hit; anything else falls
 * through to the original full-scan path, so a missing or unparsable cache simply
 * costs what the command cost before.
 *
 * This is deliberately a separate file from upload_state.csv. That one is the
 * durable upload journal whose rows must keep resolving for files that no longer
 * exist; this one is a disposable accelerator that may be deleted at any moment.
 * ------------------------------------------------------------------------- */
#define WARDRIVE_SCAN_CACHE_PATH   "/sdcard/lab/wardrives/.scan_cache.csv"
#define WARDRIVE_SCAN_CACHE_TMP    "/sdcard/lab/wardrives/.scan_cache.tmp"
#define WARDRIVE_SCAN_CACHE_HEADER "filename,size,mtime,hash,rows,wifi,ble,bt,bad"
#define WARDRIVE_SCAN_CACHE_MAX_ROWS 512
#define WARDRIVE_SCAN_CACHE_NAME_MAX 128
/* FAT timestamps advance in 2 s steps, so a file written "now" can carry a stamp a
 * couple of seconds stale, and a clock stepped by a GPS fix can briefly put it in the
 * future. Anything inside this window is treated as still moving. */
#define WARDRIVE_SCAN_CACHE_FRESH_S  5
/* 1980-01-01, the FAT epoch. A system clock below this has not been seeded yet, so
 * "now" carries no information and no freshness test based on it can be trusted. */
#define WARDRIVE_CLOCK_VALID_EPOCH   315532800L

typedef struct {
    char name[WARDRIVE_SCAN_CACHE_NAME_MAX];
    long size;
    long mtime;
    uint32_t hash;
    int rows;
    int wifi;
    int ble;
    int bt;
    int bad;
} wardrive_scan_cache_row_t;

typedef struct {
    wardrive_scan_cache_row_t *rows;
    int count;
    int capacity;
    bool dirty;
} wardrive_scan_cache_t;

static bool wardrive_scan_cache_init(wardrive_scan_cache_t *cache) {
    if (!cache) {
        return false;
    }
    memset(cache, 0, sizeof(*cache));

    size_t bytes = (size_t)WARDRIVE_SCAN_CACHE_MAX_ROWS * sizeof(wardrive_scan_cache_row_t);
    cache->rows = (wardrive_scan_cache_row_t *)heap_caps_malloc(bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!cache->rows) {
        cache->rows = (wardrive_scan_cache_row_t *)heap_caps_malloc(bytes, MALLOC_CAP_8BIT);
    }
    if (!cache->rows) {
        return false;
    }
    cache->capacity = WARDRIVE_SCAN_CACHE_MAX_ROWS;
    return true;
}

static void wardrive_scan_cache_free(wardrive_scan_cache_t *cache) {
    if (!cache) {
        return;
    }
    free(cache->rows);
    cache->rows = NULL;
    cache->count = 0;
    cache->capacity = 0;
}

/* Read once per command. A malformed row is skipped rather than invalidating the
 * whole file: it simply becomes a miss and gets recomputed and rewritten. */
static void wardrive_scan_cache_load(wardrive_scan_cache_t *cache) {
    if (!cache || !cache->rows) {
        return;
    }

    FILE *f = fopen(WARDRIVE_SCAN_CACHE_PATH, "r");
    if (!f) {
        return;
    }

    char line[320];
    while (cache->count < cache->capacity && fgets(line, sizeof(line), f)) {
        line[strcspn(line, "\r\n")] = '\0';
        if (line[0] == '\0' || strncmp(line, "filename,", 9) == 0) {
            continue;
        }

        char *fields[9] = {0};
        int n = 0;
        char *save = NULL;
        char *tok = strtok_r(line, ",", &save);
        while (tok && n < 9) {
            fields[n++] = tok;
            tok = strtok_r(NULL, ",", &save);
        }
        if (n < 9) {
            continue;
        }

        wardrive_scan_cache_row_t *row = &cache->rows[cache->count];
        snprintf(row->name, sizeof(row->name), "%s", fields[0]);
        row->size  = strtol(fields[1], NULL, 10);
        row->mtime = strtol(fields[2], NULL, 10);
        row->hash  = (uint32_t)strtoul(fields[3], NULL, 16);
        row->rows  = atoi(fields[4]);
        row->wifi  = atoi(fields[5]);
        row->ble   = atoi(fields[6]);
        row->bt    = atoi(fields[7]);
        row->bad   = atoi(fields[8]);
        cache->count++;
    }
    fclose(f);
}

/* One gate, consulted both before trusting a row and before storing one. Splitting
 * the two checks would let a file that must never be cached still be served from a
 * row written earlier under different conditions — after a GPS fix seeds the clock,
 * for instance. */
static bool wardrive_scan_cache_is_cacheable(const char *name, const struct stat *st, time_t now) {
    if (!name || !st) {
        return false;
    }
    if ((long)now < WARDRIVE_CLOCK_VALID_EPOCH) {
        return false;
    }
    if (st->st_mtime <= 0) {
        return false;
    }
    /* llabs, not (now - mtime): FatFs stamps 1980 while the clock still reads 1970,
     * which would make a plain subtraction look comfortably old. */
    if (llabs((long long)now - (long long)st->st_mtime) < WARDRIVE_SCAN_CACHE_FRESH_S) {
        return false;
    }
    if (strchr(name, ',') != NULL) {
        return false;
    }
    if (strlen(name) >= WARDRIVE_SCAN_CACHE_NAME_MAX) {
        /* Truncating the name would let two files share a cache key. */
        return false;
    }
    if (wardrive_active_log_name[0] != '\0' && strcmp(name, wardrive_active_log_name) == 0) {
        return false;
    }
    return true;
}

static bool wardrive_scan_cache_lookup(const wardrive_scan_cache_t *cache, const char *name,
                                       long size, long mtime, wardrive_scan_cache_row_t *out) {
    if (!cache || !cache->rows || !name) {
        return false;
    }
    for (int i = 0; i < cache->count; i++) {
        const wardrive_scan_cache_row_t *row = &cache->rows[i];
        if (row->size == size && row->mtime == mtime && strcmp(row->name, name) == 0) {
            if (out) {
                *out = *row;
            }
            return true;
        }
    }
    return false;
}

static void wardrive_scan_cache_put(wardrive_scan_cache_t *cache, const char *name, long size,
                                    long mtime, uint32_t hash, const wdgwars_wigle_stats_t *stats) {
    if (!cache || !cache->rows || !name || !stats) {
        return;
    }

    wardrive_scan_cache_row_t *row = NULL;
    for (int i = 0; i < cache->count; i++) {
        if (strcmp(cache->rows[i].name, name) == 0) {
            /* Same file, new size or mtime: the old row is stale by definition. */
            row = &cache->rows[i];
            break;
        }
    }
    if (!row) {
        if (cache->count >= cache->capacity) {
            /* Full: this file just stays uncached and is rescanned next time. */
            return;
        }
        row = &cache->rows[cache->count++];
    }

    snprintf(row->name, sizeof(row->name), "%s", name);
    row->size  = size;
    row->mtime = mtime;
    row->hash  = hash;
    row->rows  = stats->data_rows;
    row->wifi  = stats->wifi_rows;
    row->ble   = stats->ble_rows;
    row->bt    = stats->bt_rows;
    row->bad   = stats->bad_rows;
    cache->dirty = true;
}

/* Written once, at the end of a command, and only when something changed. Rows whose
 * file has disappeared are dropped here — that is the whole garbage collection story,
 * and it is why wardrive_cleanup (which renames files out of the directory) has to
 * call this too rather than leaving dozens of dead rows behind. */
static void wardrive_scan_cache_writeback(wardrive_scan_cache_t *cache) {
    if (!cache || !cache->rows || !cache->dirty) {
        return;
    }

    FILE *f = fopen(WARDRIVE_SCAN_CACHE_TMP, "w");
    if (!f) {
        return;
    }

