brokali/projectZeroTouch/ESP32C5/main/main.c
    fprintf(f, "%s\n", WARDRIVE_SCAN_CACHE_HEADER);
    for (int i = 0; i < cache->count; i++) {
        const wardrive_scan_cache_row_t *row = &cache->rows[i];
        char path[300];
        struct stat st;
        snprintf(path, sizeof(path), "/sdcard/lab/wardrives/%s", row->name);
        if (stat(path, &st) != 0 || !S_ISREG(st.st_mode)) {
            continue;
        }
        fprintf(f, "%s,%ld,%ld,%08lX,%d,%d,%d,%d,%d\n",
                row->name, row->size, row->mtime, (unsigned long)row->hash,
                row->rows, row->wifi, row->ble, row->bt, row->bad);
    }
    fclose(f);

    /* FatFs f_rename refuses an existing target, so the old file has to go first.
     * That leaves a brief window with no cache at all; the worst outcome of losing
     * the race is a cold rebuild on the next command, never a half-written cache
     * being trusted. */
    unlink(WARDRIVE_SCAN_CACHE_PATH);
    if (rename(WARDRIVE_SCAN_CACHE_TMP, WARDRIVE_SCAN_CACHE_PATH) != 0) {
        unlink(WARDRIVE_SCAN_CACHE_TMP);
        return;
    }
    cache->dirty = false;
}

static bool upload_state_ensure_file(void) {
    struct stat st;
    if (stat(UPLOAD_STATE_PATH, &st) == 0) {
        return true;
    }

    sd_mkdir_recursive("/sdcard/lab/wardrives");

    FILE *f = fopen(UPLOAD_STATE_PATH, "w");
    if (!f) {
        MY_LOG_INFO(TAG, "Upload state: cannot create %s", UPLOAD_STATE_PATH);
        return false;
    }
    fprintf(f, "service,filename,size,hash,status,uploaded_at,wifi,ble,bt,bad\n");
    fclose(f);
    sd_sync();
    return true;
}

static bool upload_state_parse_line(char *line, char *service, size_t service_sz,
                                    char *filename, size_t filename_sz, long *size,
                                    uint32_t *hash, char *status, size_t status_sz,
                                    int *wifi, int *ble, int *bt, int *bad) {
    if (!line || strncmp(line, "service,", 8) == 0) {
        return false;
    }

    char *fields[10] = {0};
    int count = 0;
    char *save = NULL;
    char *tok = strtok_r(line, ",", &save);
    while (tok && count < 10) {
        fields[count++] = tok;
        tok = strtok_r(NULL, ",", &save);
    }
    if (count < 10) {
        return false;
    }

    snprintf(service, service_sz, "%s", fields[0]);
    snprintf(filename, filename_sz, "%s", fields[1]);
    if (size) {
        *size = strtol(fields[2], NULL, 10);
    }
    if (hash) {
        *hash = (uint32_t)strtoul(fields[3], NULL, 16);
    }
    snprintf(status, status_sz, "%s", fields[4]);
    if (wifi) *wifi = atoi(fields[6]);
    if (ble)  *ble  = atoi(fields[7]);
    if (bt)   *bt   = atoi(fields[8]);
    if (bad)  *bad  = atoi(fields[9]);
    return true;
}

static bool upload_state_is_done(const char *service, const char *filename, long size, uint32_t hash) {
    FILE *f = fopen(UPLOAD_STATE_PATH, "r");
    if (!f) {
        return false;
    }

    bool done = false;
    char line[256];
    while (fgets(line, sizeof(line), f)) {
        line[strcspn(line, "\r\n")] = '\0';
        char svc[16], fn[128], status[16];
        long rec_size = 0;
        uint32_t rec_hash = 0;
        if (!upload_state_parse_line(line, svc, sizeof(svc), fn, sizeof(fn),
                                     &rec_size, &rec_hash, status, sizeof(status),
                                     NULL, NULL, NULL, NULL)) {
            continue;
        }
        if (strcmp(svc, service) == 0 && strcmp(fn, filename) == 0 &&
            rec_size == size && rec_hash == hash) {
            if (strcmp(status, "done") == 0) {
                done = true;
            }
        }
    }
    fclose(f);
    return done;
}

static bool upload_state_append(const char *service, const char *filename, long size,
                                uint32_t hash, const char *status,
                                const wdgwars_wigle_stats_t *stats) {
    if (!upload_state_ensure_file()) {
        return false;
    }

    FILE *f = fopen(UPLOAD_STATE_PATH, "a");
    if (!f) {
        MY_LOG_INFO(TAG, "Upload state: cannot append to %s", UPLOAD_STATE_PATH);
        return false;
    }

    char timestamp[32];
    get_timestamp_string(timestamp, sizeof(timestamp));
    fprintf(f, "%s,%s,%ld,%08lX,%s,%s,%d,%d,%d,%d\n",
            service, filename, size, (unsigned long)hash, status, timestamp,
            stats ? stats->wifi_rows : 0,
            stats ? stats->ble_rows : 0,
            stats ? stats->bt_rows : 0,
            stats ? stats->bad_rows : 0);
    fclose(f);
    sd_sync();
    return true;
}

static void upload_state_get_status(const char *service, const char *filename, long size,
                                    uint32_t hash, char *out, size_t out_sz) {
    snprintf(out, out_sz, "pending");
    FILE *f = fopen(UPLOAD_STATE_PATH, "r");
    if (!f) {
        return;
    }

    char line[256];
    while (fgets(line, sizeof(line), f)) {
        line[strcspn(line, "\r\n")] = '\0';
        char svc[16], fn[128], status[16];
        long rec_size = 0;
        uint32_t rec_hash = 0;
        if (!upload_state_parse_line(line, svc, sizeof(svc), fn, sizeof(fn),
                                     &rec_size, &rec_hash, status, sizeof(status),
                                     NULL, NULL, NULL, NULL)) {
            continue;
        }
        if (strcmp(svc, service) == 0 && strcmp(fn, filename) == 0 &&
            rec_size == size && rec_hash == hash) {
            if (strcmp(out, "done") == 0) {
                continue;
            }
            snprintf(out, out_sz, "%s", status);
        }
    }
    fclose(f);
}

/* ---------------------------------------------------------------------------
 * upload_state.csv, resolved once into RAM
 *
 * upload_state_get_status() reopens and rescans the whole journal for every file and
 * every service — 126 opens and full scans for a 63-file listing. Loading it once and
 * answering from memory removes that entirely.
 *
 * The two lookups below are NOT interchangeable and must stay separate. Cleanup
 * decides what to archive with get_status, the upload loops decide what to skip with
 * is_done; collapsing them into one rule would make the "Archive done" button move a
 * different set of files than the listing had just shown as done.
 * ------------------------------------------------------------------------- */
#define UPLOAD_STATE_TBL_MAX_ROWS 1024

