brokali/projectZeroTouch/ESP32C5/main/main.c
typedef struct {
    char service[16];
    char filename[128];
    long size;
    uint32_t hash;
    char status[16];
} upload_state_row_t;

typedef struct {
    upload_state_row_t *rows;
    int count;
    /* The journal is append-only and grows with every upload attempt, so it can
     * eventually outgrow the table. Rather than silently answering from a partial
     * copy, an overflowed table defers to the original file-scanning functions:
     * slow, but it cannot report a file as pending that the journal says is done. */
    bool overflow;
} upload_state_table_t;

static bool upload_state_table_load(upload_state_table_t *tbl) {
    if (!tbl) {
        return false;
    }
    memset(tbl, 0, sizeof(*tbl));

    size_t bytes = (size_t)UPLOAD_STATE_TBL_MAX_ROWS * sizeof(upload_state_row_t);
    tbl->rows = (upload_state_row_t *)heap_caps_malloc(bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!tbl->rows) {
        tbl->rows = (upload_state_row_t *)heap_caps_malloc(bytes, MALLOC_CAP_8BIT);
    }
    if (!tbl->rows) {
        return false;
    }

    FILE *f = fopen(UPLOAD_STATE_PATH, "r");
    if (!f) {
        /* No journal yet: every lookup resolves to "pending", as before. */
        return true;
    }

    char line[256];
    while (fgets(line, sizeof(line), f)) {
        if (tbl->count >= UPLOAD_STATE_TBL_MAX_ROWS) {
            tbl->overflow = true;
            break;
        }
        line[strcspn(line, "\r\n")] = '\0';
        upload_state_row_t *row = &tbl->rows[tbl->count];
        if (!upload_state_parse_line(line, row->service, sizeof(row->service),
                                     row->filename, sizeof(row->filename),
                                     &row->size, &row->hash,
                                     row->status, sizeof(row->status),
                                     NULL, NULL, NULL, NULL)) {
            continue;
        }
        tbl->count++;
    }
    fclose(f);
    return true;
}

static void upload_state_table_free(upload_state_table_t *tbl) {
    if (!tbl) {
        return;
    }
    free(tbl->rows);
    tbl->rows = NULL;
    tbl->count = 0;
}

/* Mirrors upload_state_get_status(): the last matching row wins, except that "done"
 * latches — once seen it cannot be downgraded by a later row. */
static void upload_tbl_get_status(const upload_state_table_t *tbl, const char *service,
                                  const char *filename, long size, uint32_t hash,
                                  char *out, size_t out_sz) {
    if (!tbl || !tbl->rows || tbl->overflow) {
        upload_state_get_status(service, filename, size, hash, out, out_sz);
        return;
    }

    snprintf(out, out_sz, "pending");
    for (int i = 0; i < tbl->count; i++) {
        const upload_state_row_t *row = &tbl->rows[i];
        if (row->size != size || row->hash != hash) {
            continue;
        }
        if (strcmp(row->service, service) != 0 || strcmp(row->filename, filename) != 0) {
            continue;
        }
        if (strcmp(out, "done") == 0) {
            continue;
        }
        snprintf(out, out_sz, "%s", row->status);
    }
}

/* Mirrors upload_state_is_done(): order-independent, any matching row marked done. */
static bool upload_tbl_is_done(const upload_state_table_t *tbl, const char *service,
                               const char *filename, long size, uint32_t hash) {
    if (!tbl || !tbl->rows || tbl->overflow) {
        return upload_state_is_done(service, filename, size, hash);
    }

    for (int i = 0; i < tbl->count; i++) {
        const upload_state_row_t *row = &tbl->rows[i];
        if (row->size != size || row->hash != hash) {
            continue;
        }
        if (strcmp(row->service, service) != 0 || strcmp(row->filename, filename) != 0) {
            continue;
        }
        if (strcmp(row->status, "done") == 0) {
            return true;
        }
    }
    return false;
}

/* The single place a wardrive file's identity (size + FNV-1a hash) and its row
 * statistics come from, cached or freshly computed. Six call sites used to derive this
 * inline, each with its own error handling; wiring a cache into all six separately
 * would have turned one behaviour into six subtly different ones. Callers keep their
 * own reporting — only the work is shared.
 *
 * The three outcomes are distinct because the listing has to account for every file it
 * announced. WARDRIVE_ID_ABSENT means the name is no longer a regular file and no row
 * should exist for it at all; WARDRIVE_ID_READ_FAILED means the file is there but could
 * not be read, and `*out_size` still carries the size stat() reported so the caller can
 * emit an honest row instead of dropping the file silently. */
typedef enum {
    WARDRIVE_ID_OK = 0,       /* size, hash and stats are all real */
    WARDRIVE_ID_READ_FAILED,  /* exists but unreadable; size from stat(), hash 0, stats zeroed */
    WARDRIVE_ID_ABSENT,       /* not a regular file any more: emit nothing */
} wardrive_identity_t;

static wardrive_identity_t wardrive_file_identity(const char *filepath, const char *name,
                                                  wardrive_scan_cache_t *cache,
                                                  long *out_size, uint32_t *out_hash,
                                                  wdgwars_wigle_stats_t *out_stats) {
    if (out_size) *out_size = 0;
    if (out_hash) *out_hash = 0;
    if (out_stats) memset(out_stats, 0, sizeof(*out_stats));

    if (!filepath || !name) {
        return WARDRIVE_ID_ABSENT;
    }

    struct stat st;
    if (stat(filepath, &st) != 0 || !S_ISREG(st.st_mode)) {
        return WARDRIVE_ID_ABSENT;
    }
    bool cacheable = cache && cache->rows &&
                     wardrive_scan_cache_is_cacheable(name, &st, time(NULL));

    if (cacheable) {
        wardrive_scan_cache_row_t row;
        if (wardrive_scan_cache_lookup(cache, name, (long)st.st_size, (long)st.st_mtime, &row)) {
            if (out_size) *out_size = row.size;
            if (out_hash) *out_hash = row.hash;
            if (out_stats) {
                out_stats->data_rows = row.rows;
                out_stats->wifi_rows = row.wifi;
                out_stats->ble_rows  = row.ble;
                out_stats->bt_rows   = row.bt;
                out_stats->bad_rows  = row.bad;
            }
            return WARDRIVE_ID_OK;
        }
    }

    long size = 0;
    uint32_t hash = 0;
    if (!wardrive_collect_file_id(filepath, &size, &hash)) {
        /* Hand back what stat() knows. The listing announced this file in its count
         * and has to print a row for it; a silent skip is what made the host's
         * completeness check fire on listings that were in fact complete. */
        if (out_size) *out_size = (long)st.st_size;
        return WARDRIVE_ID_READ_FAILED;
    }

    /* Return value deliberately ignored, matching what the listing has always done:
     * a file that cannot be reopened for the stats pass reports zero rows rather than
     * disappearing from the listing. The scanner zeroes the struct on entry. */
    wdgwars_wigle_stats_t stats;
    (void)wdgwars_scan_wigle_stats(filepath, &stats);

    if (out_size) *out_size = size;
    if (out_hash) *out_hash = hash;
    if (out_stats) *out_stats = stats;

    /* Only cache what this pass actually measured. wardrive_collect_file_id() reports
     * the number of bytes it read, which is what every marker line prints as `size=`;
     * storing that while keying on st_size would let a hit print a different size than
     * the cold run did for a file that grew between the two syscalls. */
    if (cacheable && size == (long)st.st_size) {
        wardrive_scan_cache_put(cache, name, size, (long)st.st_mtime, hash, &stats);
    }
    return WARDRIVE_ID_OK;
}

