brokali/projectZeroTouch/ESP32C5/main/main.c
static int cmd_upload_state(int argc, char **argv) {
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    if (argc > 1 && strcasecmp(argv[1], "clear") == 0) {
        unlink(UPLOAD_STATE_PATH);
        if (upload_state_ensure_file()) {
            MY_LOG_INFO(TAG, "Upload state cleared: %s", UPLOAD_STATE_PATH);
            return 0;
        }
        return 1;
    }

    upload_state_ensure_file();

    FILE *f = fopen(UPLOAD_STATE_PATH, "r");
    printf("[UPLOAD_STATE] BEGIN\n");
    if (f) {
        char line[256];
        while (fgets(line, sizeof(line), f)) {
            line[strcspn(line, "\r\n")] = '\0';
            char svc[16], fn[128], status[16];
            long size = 0;
            uint32_t hash = 0;
            int wifi = 0, ble = 0, bt = 0, bad = 0;
            if (!upload_state_parse_line(line, svc, sizeof(svc), fn, sizeof(fn),
                                         &size, &hash, status, sizeof(status),
                                         &wifi, &ble, &bt, &bad)) {
                continue;
            }
            printf("[UPLOAD_STATE] service=%s filename=%s size=%ld hash=%08lX status=%s wifi=%d ble=%d bt=%d bad=%d\n",
                   svc, fn, size, (unsigned long)hash, status, wifi, ble, bt, bad);
        }
        fclose(f);
    }
    printf("[UPLOAD_STATE] END\n");
    return 0;
}

static int cmd_wardrive_files(int argc, char **argv) {
    (void)argc;
    (void)argv;

    /* Every exit runs through `out:` so the host always receives BEGIN, a SUMMARY and
     * END. This used to return early when the SD card or the directory could not be
     * opened, leaving the Tab5 blocked until its own 120 s timeout waiting for a
     * terminator that was never going to arrive. */
    int rc = 0;
    int total_files = 0;
    long total_bytes = 0;
    int total_rows = 0;
    int total_wifi = 0;
    int total_ble = 0;
    int total_bt = 0;
    int total_bad = 0;
    int wigle_pending = 0;
    int wigle_ok = 0;
    int wigle_failed = 0;
    int wigle_rate_limited = 0;
    int wdgwars_pending = 0;
    int wdgwars_ok = 0;
    int wdgwars_failed = 0;
    int wdgwars_rate_limited = 0;

    DIR *dir = NULL;
    struct dirent *entry = NULL;
    wardrive_scan_cache_t cache;
    upload_state_table_t upload_tbl;
    bool cache_ready = false;
    bool tbl_ready = false;
    int candidates = 0;
    int scanning_idx = 0;
    esp_err_t ret = init_sd_card();

    if (ret != ESP_OK) {
        printf("[WARD_FILE] BEGIN count=0\n");
        printf("[WARD_FILE] ERROR reason=sd_init detail=%s\n", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        rc = 1;
        goto out;
    }
    upload_state_ensure_file();

    dir = opendir("/sdcard/lab/wardrives");
    if (!dir) {
        printf("[WARD_FILE] BEGIN count=0\n");
        printf("[WARD_FILE] ERROR reason=opendir path=/sdcard/lab/wardrives errno=%d\n", errno);
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        rc = 1;
        goto out;
    }

    /* One stat() per name and nothing else. This number is the host's completeness
     * check — it compares the filename= lines it parsed against it and shows a
     * "listing truncated" banner when they differ — so it has to be the count *after*
     * every filter and skip, not the raw directory enumeration. That holds only
     * because the loop below emits a row for every file counted here, including one
     * that turns out to be unreadable. Counting before the per-file work and then
     * dropping a failed file would put the host in a permanent false alarm on a
     * listing that was in fact complete.
     *
     * Nothing is opened here, and nothing may be slow: the host aborts the read if it
     * sees 1.5 s of silence before BEGIN arrives. */
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wardrive_is_fixed_output(entry->d_name)) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name) && !wdgwars_is_upload_candidate(entry->d_name)) {
            continue;
        }

        char probe_path[280];
        struct stat probe_st;
        snprintf(probe_path, sizeof(probe_path), "/sdcard/lab/wardrives/%s", entry->d_name);
        if (stat(probe_path, &probe_st) != 0 || !S_ISREG(probe_st.st_mode)) {
            continue;
        }
        candidates++;
    }
    rewinddir(dir);

    printf("[WARD_FILE] BEGIN count=%d\n", candidates);

    cache_ready = wardrive_scan_cache_init(&cache);
    if (cache_ready) {
        wardrive_scan_cache_load(&cache);
    }
    tbl_ready = upload_state_table_load(&upload_tbl);

    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wardrive_is_fixed_output(entry->d_name)) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name) && !wdgwars_is_upload_candidate(entry->d_name)) {
            continue;
        }

        char filepath[280];
        snprintf(filepath, sizeof(filepath), "/sdcard/lab/wardrives/%s", entry->d_name);

        /* Emitted before the work, not after: on a cold cache hashing and scanning a
         * 3 MB log takes tens of seconds, and silence is indistinguishable from a dead
         * module. The key is `name=`, deliberately not `filename=`, because the host
         * counts "[WARD_FILE] filename=" occurrences to drive its progress display and
         * reusing that key would count every file twice. */
        scanning_idx++;
        printf("[WARD_FILE] SCANNING %d/%d name=%s\n", scanning_idx, candidates, entry->d_name);

        long size = 0;
        uint32_t hash = 0;
        wdgwars_wigle_stats_t stats;
        wardrive_identity_t id = wardrive_file_identity(filepath, entry->d_name,
                                                        cache_ready ? &cache : NULL,
                                                        &size, &hash, &stats);
        if (id == WARDRIVE_ID_ABSENT) {
            /* No longer a regular file. The counting pass applied the same stat()
             * predicate, so it was not counted either and the total stays exact. */
            continue;
        }

        char wigle_status[16], wdgwars_status[16];
        upload_tbl_get_status(tbl_ready ? &upload_tbl : NULL, "wigle", entry->d_name, size, hash,
                              wigle_status, sizeof(wigle_status));
        upload_tbl_get_status(tbl_ready ? &upload_tbl : NULL, "wdgwars", entry->d_name, size, hash,
                              wdgwars_status, sizeof(wdgwars_status));

