brokali/projectZeroTouch/ESP32C5/main/main.c
        total_files++;
        total_bytes += size;
        total_rows += stats.data_rows;
        total_wifi += stats.wifi_rows;
        total_ble += stats.ble_rows;
        total_bt += stats.bt_rows;
        total_bad += stats.bad_rows;

        if (strcmp(wigle_status, "done") == 0) {
            wigle_ok++;
        } else if (strcmp(wigle_status, "failed") == 0) {
            wigle_failed++;
        } else if (strcmp(wigle_status, "rate_limited") == 0) {
            wigle_rate_limited++;
        } else {
            wigle_pending++;
        }

        if (strcmp(wdgwars_status, "done") == 0) {
            wdgwars_ok++;
        } else if (strcmp(wdgwars_status, "failed") == 0) {
            wdgwars_failed++;
        } else if (strcmp(wdgwars_status, "rate_limited") == 0) {
            wdgwars_rate_limited++;
        } else {
            wdgwars_pending++;
        }

        /* An unreadable file still gets a row, with the size stat() reported, a zero
         * hash, zeroed counts and a trailing error=read. The field is appended, so a
         * host that does not know it ignores it and simply shows the file with empty
         * counts — which beats the file disappearing from a listing that announced it. */
        printf("[WARD_FILE] filename=%s size=%ld hash=%08lX wifi=%d ble=%d bt=%d bad=%d wigle=%s wdgwars=%s%s\n",
               entry->d_name, size, (unsigned long)hash,
               stats.wifi_rows, stats.ble_rows, stats.bt_rows, stats.bad_rows,
               wigle_status, wdgwars_status,
               (id == WARDRIVE_ID_READ_FAILED) ? " error=read" : "");
    }

out:
    if (dir) {
        closedir(dir);
    }
    if (cache_ready) {
        wardrive_scan_cache_writeback(&cache);
        wardrive_scan_cache_free(&cache);
    }
    if (tbl_ready) {
        upload_state_table_free(&upload_tbl);
    }

    printf("[WARD_FILE] SUMMARY files=%d bytes=%ld rows=%d devices=%d wifi=%d ble=%d bt=%d bad=%d wigle_ok=%d wigle_pending=%d wigle_failed=%d wigle_rate_limited=%d wdgwars_ok=%d wdgwars_pending=%d wdgwars_failed=%d wdgwars_rate_limited=%d\n",
           total_files, total_bytes, total_rows, total_rows, total_wifi, total_ble, total_bt, total_bad,
           wigle_ok, wigle_pending, wigle_failed, wigle_rate_limited,
           wdgwars_ok, wdgwars_pending, wdgwars_failed, wdgwars_rate_limited);
    printf("[WARD_FILE] END\n");
    return rc;
}

static bool wardrive_cleanup_valid_service(const char *service) {
    return service &&
           (strcasecmp(service, "wigle") == 0 ||
            strcasecmp(service, "wdgwars") == 0 ||
            strcasecmp(service, "all") == 0);
}

static bool wardrive_cleanup_valid_status(const char *status) {
    return status &&
           (strcasecmp(status, "pending") == 0 ||
            strcasecmp(status, "done") == 0 ||
            strcasecmp(status, "ok") == 0 ||
            strcasecmp(status, "failed") == 0 ||
            strcasecmp(status, "fail") == 0 ||
            strcasecmp(status, "rate_limited") == 0);
}

static const char *wardrive_cleanup_normalize_status(const char *status) {
    if (status && strcasecmp(status, "ok") == 0) {
        return "done";
    }
    if (status && strcasecmp(status, "fail") == 0) {
        return "failed";
    }
    if (status && strcasecmp(status, "pending") == 0) {
        return "pending";
    }
    if (status && strcasecmp(status, "done") == 0) {
        return "done";
    }
    if (status && strcasecmp(status, "failed") == 0) {
        return "failed";
    }
    if (status && strcasecmp(status, "rate_limited") == 0) {
        return "rate_limited";
    }
    return status;
}

static const char *wardrive_cleanup_normalize_service(const char *service) {
    if (service && strcasecmp(service, "wigle") == 0) {
        return "wigle";
    }
    if (service && strcasecmp(service, "wdgwars") == 0) {
        return "wdgwars";
    }
    if (service && strcasecmp(service, "all") == 0) {
        return "all";
    }
    return service;
}

static bool wardrive_cleanup_status_matches(const char *service, const char *wanted_status,
                                            const char *wigle_status, const char *wdgwars_status) {
    if (strcasecmp(service, "all") == 0) {
        return strcmp(wigle_status, wanted_status) == 0 &&
               strcmp(wdgwars_status, wanted_status) == 0;
    }
    if (strcasecmp(service, "wigle") == 0) {
        return strcmp(wigle_status, wanted_status) == 0;
    }
    return strcmp(wdgwars_status, wanted_status) == 0;
}

static bool wardrive_cleanup_valid_subdir(const char *subdir) {
    if (!subdir || subdir[0] == '\0' || strcmp(subdir, ".") == 0 || strcmp(subdir, "..") == 0) {
        return false;
    }
    for (const char *p = subdir; *p; p++) {
        unsigned char c = (unsigned char)*p;
        if (!(isalnum(c) || c == '.' || c == '_' || c == '-')) {
            return false;
        }
    }
    return true;
}

static bool wardrive_cleanup_ensure_dir(const char *service, const char *status,
                                        const char *subdir, char *out_dir, size_t out_sz) {
    if (!service || !status || !out_dir || out_sz == 0) {
        return false;
    }

    mkdir("/sdcard/lab/wardrives/uploaded", 0755);

    char service_dir[384];
    int ret = snprintf(service_dir, sizeof(service_dir), "/sdcard/lab/wardrives/uploaded/%s", service);
    if (ret <= 0 || ret >= (int)sizeof(service_dir)) {
        return false;
    }
    mkdir(service_dir, 0755);

    ret = snprintf(out_dir, out_sz, "%s/%s", service_dir, status);
    if (ret <= 0 || ret >= (int)out_sz) {
        return false;
    }
    mkdir(out_dir, 0755);

    if (subdir && subdir[0] != '\0') {
        char status_dir[384];
        strlcpy(status_dir, out_dir, sizeof(status_dir));
        ret = snprintf(out_dir, out_sz, "%s/%s", status_dir, subdir);
        if (ret <= 0 || ret >= (int)out_sz) {
            return false;
        }
        mkdir(out_dir, 0755);
    }
    return true;
}

static int cmd_wardrive_cleanup(int argc, char **argv) {
    if (argc < 3 || argc > 5 ||
        !wardrive_cleanup_valid_service(argv[1]) ||
        !wardrive_cleanup_valid_status(argv[2])) {
        MY_LOG_INFO(TAG, "Usage: wardrive_cleanup <wigle|wdgwars|all> <pending|done|ok|failed|fail|rate_limited> [move [destination]]");
        return 1;
    }

    if (argc >= 4 && strcasecmp(argv[3], "move") != 0) {
        MY_LOG_INFO(TAG, "Usage: wardrive_cleanup <wigle|wdgwars|all> <pending|done|ok|failed|fail|rate_limited> [move [destination]]");
        return 1;
    }

    const char *service = wardrive_cleanup_normalize_service(argv[1]);
    const char *status = wardrive_cleanup_normalize_status(argv[2]);
    bool do_move = (argc >= 4 && strcasecmp(argv[3], "move") == 0);
    const char *dest_subdir = (argc >= 5) ? argv[4] : NULL;

    if (dest_subdir && !wardrive_cleanup_valid_subdir(dest_subdir)) {
        printf("[WARD_CLEANUP] BEGIN service=%s status=%s mode=move target= count=0\n", service, status);
        printf("[WARD_CLEANUP] filename=destination action=failed reason=invalid_destination destination=%s\n", dest_subdir ? dest_subdir : "");
        printf("[WARD_CLEANUP] SUMMARY scanned=0 matched=0 moved=0 failed=1 dry_run=0\n");
        printf("[WARD_CLEANUP] END\n");
        return 1;
    }

