brokali/projectZeroTouch/ESP32C5/main/main.c
    /* Like the listing, this backs a button on the host ("Archive done") and so has to
     * terminate its own output on every path, including the failures that used to
     * return silently. */
    int scanned = 0;
    int matched = 0;
    int moved = 0;
    int failed = 0;
    int candidates = 0;
    int scanning_idx = 0;
    DIR *dir = NULL;
    struct dirent *entry = NULL;
    wardrive_scan_cache_t cache;
    upload_state_table_t upload_tbl;
    bool cache_ready = false;
    bool tbl_ready = false;
    char target_dir[384];
    esp_err_t ret;

    target_dir[0] = '\0';

    ret = init_sd_card();
    if (ret != ESP_OK) {
        printf("[WARD_CLEANUP] BEGIN service=%s status=%s mode=%s target= count=0\n",
               service, status, do_move ? "move" : "dry-run");
        printf("[WARD_CLEANUP] ERROR reason=sd_init detail=%s\n", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        failed++;
        goto out;
    }
    upload_state_ensure_file();

    if (!wardrive_cleanup_ensure_dir(service, status, dest_subdir, target_dir, sizeof(target_dir))) {
        printf("[WARD_CLEANUP] BEGIN service=%s status=%s mode=%s target= count=0\n",
               service, status, do_move ? "move" : "dry-run");
        printf("[WARD_CLEANUP] ERROR reason=target_dir\n");
        MY_LOG_INFO(TAG, "wardrive_cleanup: failed to prepare target directory");
        failed++;
        goto out;
    }

    dir = opendir("/sdcard/lab/wardrives");
    if (!dir) {
        printf("[WARD_CLEANUP] BEGIN service=%s status=%s mode=%s target=%s count=0\n",
               service, status, do_move ? "move" : "dry-run", target_dir);
        printf("[WARD_CLEANUP] ERROR reason=opendir path=/sdcard/lab/wardrives errno=%d\n", errno);
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        failed++;
        goto out;
    }

    /* Must end up equal to the `scanned` the SUMMARY reports, so it applies exactly the
     * predicate the loop below uses before it increments `scanned`: the name filters,
     * a stat() that says regular file, and the same path-length limit. One stat() per
     * name, nothing opened — the host aborts on 1.5 s of silence before BEGIN. */
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wardrive_is_fixed_output(entry->d_name)) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name) && !wdgwars_is_upload_candidate(entry->d_name)) {
            continue;
        }

        char probe_path[384];
        struct stat probe_st;
        int probe_len = snprintf(probe_path, sizeof(probe_path), "/sdcard/lab/wardrives/%s", entry->d_name);
        if (probe_len <= 0 || probe_len >= (int)sizeof(probe_path)) {
            continue;
        }
        if (stat(probe_path, &probe_st) != 0 || !S_ISREG(probe_st.st_mode)) {
            continue;
        }
        candidates++;
    }
    rewinddir(dir);

    printf("[WARD_CLEANUP] BEGIN service=%s status=%s mode=%s target=%s count=%d\n",
           service, status, do_move ? "move" : "dry-run", target_dir, candidates);

    cache_ready = wardrive_scan_cache_init(&cache);
    if (cache_ready) {
        wardrive_scan_cache_load(&cache);
    }
    tbl_ready = upload_state_table_load(&upload_tbl);

    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wardrive_is_fixed_output(entry->d_name)) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name) && !wdgwars_is_upload_candidate(entry->d_name)) {
            continue;
        }

        char filepath[384];
        int path_len = snprintf(filepath, sizeof(filepath), "/sdcard/lab/wardrives/%s", entry->d_name);
        if (path_len <= 0 || path_len >= (int)sizeof(filepath)) {
            failed++;
            printf("[WARD_CLEANUP] filename=%s action=failed reason=path_too_long\n", entry->d_name);
            continue;
        }
        /* Heartbeat before the work, same reason and same `name=` key as the listing:
         * the cleanup popup on the host has a live log panel, and on a cold cache this
         * loop is silent for tens of seconds per file. */
        scanning_idx++;
        printf("[WARD_CLEANUP] SCANNING %d/%d name=%s\n", scanning_idx, candidates, entry->d_name);

        long size = 0;
        uint32_t hash = 0;
        wardrive_identity_t id = wardrive_file_identity(filepath, entry->d_name,
                                                        cache_ready ? &cache : NULL,
                                                        &size, &hash, NULL);
        if (id == WARDRIVE_ID_ABSENT) {
            /* The counting pass applied the same stat() predicate and skipped it too,
             * so `scanned` still matches the count announced on BEGIN. */
            continue;
        }
        scanned++;

        if (id == WARDRIVE_ID_READ_FAILED) {
            /* Counted, reported, but never matched or moved. The status lookup would
             * be keyed on a zero hash and could match the wanted status by accident —
             * archiving a file whose contents could not be read is not a risk worth
             * taking to save one line of output. */
            printf("[WARD_CLEANUP] filename=%s size=%ld action=skipped reason=read_error\n",
                   entry->d_name, size);
            continue;
        }

        char wigle_status[16], wdgwars_status[16];
        upload_tbl_get_status(tbl_ready ? &upload_tbl : NULL, "wigle", entry->d_name, size, hash,
                              wigle_status, sizeof(wigle_status));
        upload_tbl_get_status(tbl_ready ? &upload_tbl : NULL, "wdgwars", entry->d_name, size, hash,
                              wdgwars_status, sizeof(wdgwars_status));

        if (!wardrive_cleanup_status_matches(service, status, wigle_status, wdgwars_status)) {
            continue;
        }
        matched++;

        char target_path[512];
        path_len = snprintf(target_path, sizeof(target_path), "%s/%s", target_dir, entry->d_name);
        if (path_len <= 0 || path_len >= (int)sizeof(target_path)) {
            failed++;
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=failed reason=target_path_too_long\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status);
            continue;
        }

