brokali/projectZeroTouch/ESP32C5/main/main.c
        if (!do_move) {
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=would_move target=%s\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status, target_path);
            continue;
        }

        unlink(target_path);
        if (rename(filepath, target_path) == 0) {
            moved++;
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=moved target=%s\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status, target_path);

            size_t name_len = strlen(entry->d_name);
            if (name_len > 4 && strcasecmp(entry->d_name + name_len - 4, ".log") == 0) {
                char track_name[256];
                int track_name_len = snprintf(track_name, sizeof(track_name), "%.*s_track.kml",
                                              (int)(name_len - 4), entry->d_name);
                if (track_name_len <= 0 || track_name_len >= (int)sizeof(track_name)) {
                    failed++;
                    printf("[WARD_CLEANUP] filename=%s action=failed reason=track_name_too_long\n",
                           entry->d_name);
                } else {
                    char track_path[384];
                    char track_target_path[512];
                    int track_path_len = snprintf(track_path, sizeof(track_path), "/sdcard/lab/wardrives/%s", track_name);
                    int track_target_len = snprintf(track_target_path, sizeof(track_target_path), "%s/%s", target_dir, track_name);
                    if (track_path_len <= 0 || track_path_len >= (int)sizeof(track_path) ||
                        track_target_len <= 0 || track_target_len >= (int)sizeof(track_target_path)) {
                        failed++;
                        printf("[WARD_CLEANUP] filename=%s action=failed reason=track_path_too_long\n",
                               track_name);
                    } else if (access(track_path, F_OK) == 0) {
                        unlink(track_target_path);
                        if (rename(track_path, track_target_path) == 0) {
                            moved++;
                            printf("[WARD_CLEANUP] filename=%s action=moved target=%s\n",
                                   track_name, track_target_path);
                        } else {
                            failed++;
                            printf("[WARD_CLEANUP] filename=%s action=failed errno=%d target=%s\n",
                                   track_name, errno, track_target_path);
                        }
                    }
                }
            }
        } else {
            failed++;
            printf("[WARD_CLEANUP] filename=%s size=%ld hash=%08lX wigle=%s wdgwars=%s action=failed errno=%d target=%s\n",
                   entry->d_name, size, (unsigned long)hash, wigle_status, wdgwars_status, errno, target_path);
        }
    }

out:
    if (dir) {
        closedir(dir);
    }
    /* Runs after the renames, so the garbage collection pass inside sees the moved
     * files as gone and drops their rows. Without it an "Archive done" of sixty files
     * would leave sixty dead entries behind for the next command to walk. */
    if (cache_ready) {
        wardrive_scan_cache_writeback(&cache);
        wardrive_scan_cache_free(&cache);
    }
    if (tbl_ready) {
        upload_state_table_free(&upload_tbl);
    }
    if (do_move && moved > 0) {
        sd_sync();
    }

    printf("[WARD_CLEANUP] SUMMARY scanned=%d matched=%d moved=%d failed=%d dry_run=%d\n",
           scanned, matched, moved, failed, do_move ? 0 : 1);
    printf("[WARD_CLEANUP] END\n");
    return failed > 0 ? 1 : 0;
}

static int cmd_wardrive_fix(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wardrive_fix <file>");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char filepath[280];
    char upload_name[128];
    if (!wdgwars_resolve_upload_target(argv[1], filepath, sizeof(filepath), upload_name, sizeof(upload_name)) &&
        !wigle_resolve_upload_target(argv[1], filepath, sizeof(filepath), upload_name, sizeof(upload_name))) {
        MY_LOG_INFO(TAG, "wardrive_fix: invalid/missing file: %s", argv[1]);
        return 1;
    }

    char fixed_path[280];
    wdgwars_wigle_stats_t stats;
    printf("[WARD_FIX] BEGIN\n");
    if (!wardrive_fix_file_soft(filepath, upload_name, fixed_path, sizeof(fixed_path), &stats)) {
        printf("[WARD_FIX] filename=%s status=failed\n", upload_name);
        printf("[WARD_FIX] END\n");
        return 1;
    }

    const char *fixed_name = wigle_basename(fixed_path);
    long fixed_size = 0;
    uint32_t fixed_hash = 0;
    wardrive_collect_file_id(fixed_path, &fixed_size, &fixed_hash);

    // The repaired copy is reported with its directory, because it no longer sits next
    // to the original: it goes to /sdcard/lab/wardrives/fixed/ and the upload scans skip
    // "*.fixed.log", so it cannot become a second upload candidate for the same data.
    printf("[WARD_FIX] filename=%s output=fixed/%s size=%ld hash=%08lX kept=%d dropped=%d wifi=%d ble=%d bt=%d bad=%d status=ok\n",
           upload_name, fixed_name ? fixed_name : fixed_path,
           fixed_size, (unsigned long)fixed_hash,
           stats.data_rows, stats.bad_rows,
           stats.wifi_rows, stats.ble_rows, stats.bt_rows, stats.bad_rows);
    printf("[WARD_FIX] note=output_dir=%s excluded_from_uploads=yes\n", WARDRIVE_FIXED_DIR);
    MY_LOG_INFO(TAG, "wardrive_fix: repaired copy written to %s (excluded from upload scans)", fixed_path);
    printf("[WARD_FIX] END\n");
    return 0;
}

static int cmd_wpasec_key(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wpasec_key set <key> | wpasec_key read");
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (wpasec_api_key[0] == '\0') {
            MY_LOG_INFO(TAG, "WPA-SEC key: not set");
            MY_LOG_INFO(TAG, "Get your key at: https://wpa-sec.stanev.org/?get_key");
        } else {
            // Show first 4 chars, mask the rest
            MY_LOG_INFO(TAG, "WPA-SEC key: %.4s****", wpasec_api_key);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: wpasec_key set <key>");
            MY_LOG_INFO(TAG, "Get your key at: https://wpa-sec.stanev.org/?get_key");
            return 0;
        }
        const char *key = argv[2];
        if (strlen(key) == 0 || strlen(key) >= WPASEC_KEY_MAX_LEN) {
            MY_LOG_INFO(TAG, "Invalid key length (max %d chars)", WPASEC_KEY_MAX_LEN - 1);
            return 1;
        }
        if (wpasec_save_key_to_nvs(key)) {
            strncpy(wpasec_api_key, key, sizeof(wpasec_api_key) - 1);
            wpasec_api_key[sizeof(wpasec_api_key) - 1] = '\0';
            MY_LOG_INFO(TAG, "WPA-SEC key saved: %.4s****", wpasec_api_key);
        } else {
            MY_LOG_INFO(TAG, "Failed to save WPA-SEC key to NVS");
            return 1;
        }
        return 0;
    }

