brokali/projectZeroTouch/ESP32C5/main/main.c
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) continue;
        size_t nlen = strlen(entry->d_name);
        if (nlen <= 5 || strcasecmp(entry->d_name + nlen - 5, ".pcap") != 0) continue;

        current++;
        char filepath[280];
        snprintf(filepath, sizeof(filepath), "/sdcard/lab/handshakes/%s", entry->d_name);

        // Get file size for display
        struct stat st;
        long fsize = 0;
        if (stat(filepath, &st) == 0) {
            fsize = (long)st.st_size;
        }

        int result = wpasec_upload_file(filepath, entry->d_name);

        if (result == 0) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", current, total_files, entry->d_name, fsize);
            uploaded++;
        } else if (result == 1) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> already submitted", current, total_files, entry->d_name, fsize);
            duplicates++;
        } else {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", current, total_files, entry->d_name, fsize);
            failed++;
        }

        // Small delay between uploads to let WiFi stack settle
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    closedir(dir);

    MY_LOG_INFO(TAG, "Done: %d uploaded, %d duplicate, %d failed", uploaded, duplicates, failed);
    return (failed > 0) ? 1 : 0;
}

/**
 * @brief Upload a single Wardrive file (.log/.txt/.csv) to api.wigle.net
 *
 * @return 0 on success, 1 on duplicate/skipped, 2 on auth error, -1 on error
 */
static int wigle_upload_file(const char *filepath, const char *filename) {
    const size_t CHUNK_SIZE = 2048;
    const size_t HDR_BUF_SZ = 640;
    const size_t RESP_BUF_SZ = 640;
    int result = -1;
    FILE *f = NULL;
    esp_tls_t *tls = NULL;
    uint8_t *chunk_buf = NULL;
    char *http_headers = NULL;
    char *resp_buf = NULL;

    f = fopen(filepath, "rb");
    if (!f) {
        MY_LOG_INFO(TAG, "  Failed to open: %s", filepath);
        goto cleanup;
    }

    fseek(f, 0, SEEK_END);
    long file_size = ftell(f);
    fseek(f, 0, SEEK_SET);
    if (file_size <= 0 || file_size > 16L * 1024L * 1024L) {
        MY_LOG_INFO(TAG, "  Invalid file size: %ld bytes", file_size);
        goto cleanup;
    }

    char auth_plain[2 * WIGLE_KEY_MAX_LEN + 2];
    int auth_plain_len = snprintf(auth_plain, sizeof(auth_plain), "%s:%s", wigle_api_name, wigle_api_token);
    if (auth_plain_len <= 0 || auth_plain_len >= (int)sizeof(auth_plain)) {
        MY_LOG_INFO(TAG, "  WiGLE credentials are too long");
        goto cleanup;
    }

    unsigned char auth_b64[220];
    size_t auth_b64_len = 0;
    int b64_ret = mbedtls_base64_encode(auth_b64, sizeof(auth_b64) - 1, &auth_b64_len,
                                        (const unsigned char *)auth_plain, (size_t)auth_plain_len);
    if (b64_ret != 0 || auth_b64_len == 0 || auth_b64_len >= sizeof(auth_b64)) {
        MY_LOG_INFO(TAG, "  Failed to build WiGLE auth header");
        goto cleanup;
    }
    auth_b64[auth_b64_len] = '\0';

    char boundary[40];
    snprintf(boundary, sizeof(boundary), "----WiGLE%lu", (unsigned long)(esp_timer_get_time() / 1000));

    char body_start[256];
    int start_len = snprintf(body_start, sizeof(body_start),
                             "--%s\r\n"
                             "Content-Disposition: form-data; name=\"file\"; filename=\"%s\"\r\n"
                             "Content-Type: text/csv\r\n\r\n",
                             boundary, filename);
    if (start_len <= 0 || start_len >= (int)sizeof(body_start)) {
        MY_LOG_INFO(TAG, "  Failed to build multipart header");
        goto cleanup;
    }

    char body_end[64];
    int end_len = snprintf(body_end, sizeof(body_end), "\r\n--%s--\r\n", boundary);
    if (end_len <= 0 || end_len >= (int)sizeof(body_end)) {
        MY_LOG_INFO(TAG, "  Failed to build multipart footer");
        goto cleanup;
    }

    int64_t body_total_len_64 = (int64_t)start_len + (int64_t)file_size + (int64_t)end_len;
    if (body_total_len_64 <= 0 || body_total_len_64 > INT_MAX) {
        MY_LOG_INFO(TAG, "  File too large for HTTP content-length: %ld bytes", file_size);
        goto cleanup;
    }
    int body_total_len = (int)body_total_len_64;

    http_headers = (char *)heap_caps_malloc(HDR_BUF_SZ, MALLOC_CAP_8BIT);
    resp_buf = (char *)heap_caps_malloc(RESP_BUF_SZ, MALLOC_CAP_8BIT);
    chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!chunk_buf) {
        chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (!http_headers || !resp_buf || !chunk_buf) {
        MY_LOG_INFO(TAG, "  Buffer allocation failed (hdr/resp/chunk)");
        goto cleanup;
    }

    int hdr_len = snprintf(http_headers, HDR_BUF_SZ,
                           "POST /api/v2/file/upload HTTP/1.1\r\n"
                           "Host: api.wigle.net\r\n"
                           "Authorization: Basic %s\r\n"
                           "Content-Type: multipart/form-data; boundary=%s\r\n"
                           "Content-Length: %d\r\n"
                           "User-Agent: projectZero-wigle\r\n"
                           "Connection: close\r\n"
                           "\r\n",
                           (const char *)auth_b64, boundary, body_total_len);
    if (hdr_len <= 0 || hdr_len >= (int)HDR_BUF_SZ) {
        MY_LOG_INFO(TAG, "  Failed to build HTTP headers");
        goto cleanup;
    }

    esp_tls_cfg_t tls_cfg = {
        .crt_bundle_attach = NULL,
        .timeout_ms = 20000,
    };

    tls = esp_tls_init();
    if (!tls) {
        MY_LOG_INFO(TAG, "  TLS init failed");
        goto cleanup;
    }

    int ret = esp_tls_conn_http_new_sync(WIGLE_URL, &tls_cfg, tls);
    if (ret < 0) {
        MY_LOG_INFO(TAG, "  TLS connection failed");
        goto cleanup;
    }

    if (wpasec_tls_write_all(tls, http_headers, hdr_len) < 0 ||
        wpasec_tls_write_all(tls, body_start, start_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send request headers/body start");
        goto cleanup;
    }

    while (1) {
        size_t bytes_read = fread(chunk_buf, 1, CHUNK_SIZE, f);
        if (bytes_read > 0) {
            if (wpasec_tls_write_all(tls, (const char *)chunk_buf, (int)bytes_read) < 0) {
                MY_LOG_INFO(TAG, "  Failed to send file chunk");
                goto cleanup;
            }
        }
        if (bytes_read < CHUNK_SIZE) {
            if (ferror(f)) {
                MY_LOG_INFO(TAG, "  Read error while streaming file");
                goto cleanup;
            }
            break;
        }
    }

    if (wpasec_tls_write_all(tls, body_end, end_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send multipart footer");
        goto cleanup;
    }

