brokali/projectZeroTouch/ESP32C5/main/main.c
    memset(resp_buf, 0, RESP_BUF_SZ);
    int total_read = 0;
    while (total_read < (int)RESP_BUF_SZ - 1) {
        ret = esp_tls_conn_read(tls, resp_buf + total_read, RESP_BUF_SZ - 1 - total_read);
        if (ret <= 0) break;
        total_read += ret;
    }
    resp_buf[total_read] = '\0';

    int status = 0;
    if (total_read > 12 && strncmp(resp_buf, "HTTP/", 5) == 0) {
        const char *sp = strchr(resp_buf, ' ');
        if (sp) {
            status = atoi(sp + 1);
        }
    }

    bool duplicate = (strstr(resp_buf, "already") != NULL ||
                      strstr(resp_buf, "Already") != NULL ||
                      strstr(resp_buf, "duplicate") != NULL ||
                      strstr(resp_buf, "Duplicate") != NULL);
    bool success_false = (strstr(resp_buf, "\"success\":false") != NULL ||
                          strstr(resp_buf, "\"success\": false") != NULL);

    if (status == 200 || status == 201 || status == 202) {
        if (duplicate) {
            result = 1;
            goto cleanup;
        }
        if (success_false) {
            MY_LOG_INFO(TAG, "  WiGLE API returned success=false");
            result = -1;
            goto cleanup;
        }
        result = 0;
        goto cleanup;
    }

    if (status == 401 || status == 403) {
        result = 2;
        goto cleanup;
    }
    if (status == 409) {
        result = 1;
        goto cleanup;
    }

    MY_LOG_INFO(TAG, "  HTTP error %d", status);
    result = -1;

cleanup:
    if (f) {
        fclose(f);
    }
    if (tls) {
        esp_tls_conn_destroy(tls);
    }
    if (chunk_buf) {
        free(chunk_buf);
    }
    if (http_headers) {
        free(http_headers);
    }
    if (resp_buf) {
        free(resp_buf);
    }
    return result;
}

static int cmd_wigle_key(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token> | wigle_key set <api_name:api_token> | wigle_key read | wigle_key clear");
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (wigle_api_name[0] == '\0' || wigle_api_token[0] == '\0') {
            MY_LOG_INFO(TAG, "WiGLE key: not set");
            MY_LOG_INFO(TAG, "Set via: wigle_key set <api_name> <api_token>");
            MY_LOG_INFO(TAG, "Or place api_name:api_token in /sdcard/lab/wigle.txt before upload.");
        } else {
            MY_LOG_INFO(TAG, "WiGLE key: %.4s****:%.4s****", wigle_api_name, wigle_api_token);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "clear") == 0) {
        if (wigle_clear_key_from_nvs()) {
            wigle_api_name[0] = '\0';
            wigle_api_token[0] = '\0';
            MY_LOG_INFO(TAG, "WiGLE key cleared from NVS.");
        } else {
            MY_LOG_INFO(TAG, "Failed to clear WiGLE key from NVS.");
            return 1;
        }
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        char api_name[WIGLE_KEY_MAX_LEN] = {0};
        char api_token[WIGLE_KEY_MAX_LEN] = {0};

        if (argc >= 4) {
            if (strlen(argv[2]) >= sizeof(api_name) || strlen(argv[3]) >= sizeof(api_token)) {
                MY_LOG_INFO(TAG, "Invalid key length (max %d chars each)", WIGLE_KEY_MAX_LEN - 1);
                return 1;
            }
            snprintf(api_name, sizeof(api_name), "%s", argv[2]);
            snprintf(api_token, sizeof(api_token), "%s", argv[3]);
        } else if (argc == 3) {
            if (!wigle_split_key_pair(argv[2], api_name, sizeof(api_name), api_token, sizeof(api_token))) {
                MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token>");
                MY_LOG_INFO(TAG, "Or:    wigle_key set <api_name:api_token>");
                return 1;
            }
        } else {
            MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token>");
            MY_LOG_INFO(TAG, "Or:    wigle_key set <api_name:api_token>");
            return 0;
        }

        if (api_name[0] == '\0' || api_token[0] == '\0') {
            MY_LOG_INFO(TAG, "WiGLE API name/token must not be empty");
            return 1;
        }

        if (wigle_save_key_to_nvs(api_name, api_token)) {
            snprintf(wigle_api_name, sizeof(wigle_api_name), "%s", api_name);
            snprintf(wigle_api_token, sizeof(wigle_api_token), "%s", api_token);
            MY_LOG_INFO(TAG, "WiGLE key saved: %.4s****:%.4s****", wigle_api_name, wigle_api_token);
        } else {
            MY_LOG_INFO(TAG, "Failed to save WiGLE key to NVS");
            return 1;
        }
        return 0;
    }

    MY_LOG_INFO(TAG, "Usage: wigle_key set <api_name> <api_token> | wigle_key set <api_name:api_token> | wigle_key read | wigle_key clear");
    return 0;
}

static int cmd_wigle_upload(int argc, char **argv) {
    oled_display_update_full("> WiGLE", "  Sending files", "  api.wigle.net", "  Uploading...");

    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "WIFI NOT CONNECTED");
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    create_sd_directories();
    if (wigle_api_name[0] == '\0' || wigle_api_token[0] == '\0') {
        wigle_load_key_from_sd();
    }

    if (wigle_api_name[0] == '\0' || wigle_api_token[0] == '\0') {
        MY_LOG_INFO(TAG, "NO WIGLE CREDENTIALS");
        MY_LOG_INFO(TAG, "Use 'wigle_key set <api_name> <api_token>' or /sdcard/lab/wigle.txt");
        return 1;
    }

    int uploaded = 0;
    int skipped = 0;
    int failed = 0;
    bool auth_failed = false;
    bool force_all = (argc > 1 && strcasecmp(argv[1], "all") == 0);

    // If files are passed as args, upload only those selected files.
    if (argc > 1 && !force_all) {
        int total_files = argc - 1;
        MY_LOG_INFO(TAG, "Uploading %d selected Wardrive file(s) to api.wigle.net...", total_files);

        wardrive_scan_cache_t cache;
        upload_state_table_t upload_tbl;
        bool cache_ready = wardrive_scan_cache_init(&cache);
        if (cache_ready) {
            wardrive_scan_cache_load(&cache);
        }
        bool tbl_ready = upload_state_table_load(&upload_tbl);

        for (int i = 1; i < argc; i++) {
            const char *arg = argv[i];
            char filepath[280];
            char upload_name[128];

            if (!wigle_resolve_upload_target(arg, filepath, sizeof(filepath), upload_name, sizeof(upload_name))) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (invalid/missing file)", i, total_files, arg ? arg : "(null)");
                failed++;
                continue;
            }

            long fsize = 0;
            uint32_t hash = 0;
            wdgwars_wigle_stats_t wigle_stats;
            if (wardrive_file_identity(filepath, upload_name, cache_ready ? &cache : NULL,
                                       &fsize, &hash, &wigle_stats) != WARDRIVE_ID_OK) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (hash/read)", i, total_files, upload_name);
                failed++;
                continue;
            }

            /* Settled before any sanitizing. Building the tmp copy costs a full read
             * plus a full write of the file, and on a real card nearly every candidate
             * turns out to be uploaded already — 62 of 63 files each paying for a
             * sanitized copy that was unlinked seconds later without being sent. */
            if (upload_tbl_is_done(tbl_ready ? &upload_tbl : NULL, "wigle", upload_name, fsize, hash)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (already uploaded)", i, total_files, upload_name, fsize);
                skipped++;
                continue;
            }

            /* Only files that are really going to be sent get a sanitized copy. The
             * stats it recomputes match what the identity pass already produced; what
             * is wanted here is the tmp file itself. */
            bool use_sanitized = false;
            if (!wdgwars_sanitize_wigle_file(filepath, &wigle_stats, &use_sanitized)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED (preflight)", i, total_files, upload_name, fsize);
                failed++;
                continue;
            }

            const char *upload_path = use_sanitized ? WDGWARS_SANITIZED_UPLOAD_PATH : filepath;
            int result = wigle_upload_file(upload_path, upload_name);
            if (use_sanitized) {
                unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
            }
            if (result == 0) {
                upload_state_append("wigle", upload_name, fsize, hash, "done", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", i, total_files, upload_name, fsize);
                uploaded++;
            } else if (result == 1) {
                upload_state_append("wigle", upload_name, fsize, hash, "done", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (duplicate)", i, total_files, upload_name, fsize);
                skipped++;
            } else if (result == 2) {
                MY_LOG_INFO(TAG, "NO WIGLE CREDENTIALS");
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> AUTH FAILED", i, total_files, upload_name, fsize);
                failed++;
                auth_failed = true;
                break;
            } else {
                upload_state_append("wigle", upload_name, fsize, hash, "failed", &wigle_stats);
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", i, total_files, upload_name, fsize);
                failed++;
            }

