brokali/projectZeroTouch/ESP32C5/main/main.c
            vTaskDelay(pdMS_TO_TICKS(250));
        }

        if (cache_ready) {
            wardrive_scan_cache_writeback(&cache);
            wardrive_scan_cache_free(&cache);
        }
        if (tbl_ready) {
            upload_state_table_free(&upload_tbl);
        }

        MY_LOG_INFO(TAG, "Done: %d uploaded, %d skipped, %d failed", uploaded, skipped, failed);
        if (auth_failed) {
            return 1;
        }
        return (failed > 0) ? 1 : 0;
    }

    DIR *dir = opendir("/sdcard/lab/wardrives");
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        return 1;
    }

    struct dirent *entry;
    int total_files = 0;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wardrive_is_fixed_output(entry->d_name)) {
            continue;
        }
        if (wigle_is_upload_candidate(entry->d_name)) {
            total_files++;
        }
    }

    if (total_files == 0) {
        MY_LOG_INFO(TAG, "No Wardrive files (.log/.txt/.csv) found in /sdcard/lab/wardrives/");
        MY_LOG_INFO(TAG, "Done: 0 uploaded, 0 skipped, 0 failed");
        closedir(dir);
        return 0;
    }

    MY_LOG_INFO(TAG, "Uploading %d Wardrive file(s) to api.wigle.net%s...", total_files,
                force_all ? " (force all)" : "");

    rewinddir(dir);
    int current = 0;

    wardrive_scan_cache_t cache;
    upload_state_table_t upload_tbl;
    bool cache_ready = wardrive_scan_cache_init(&cache);
    if (cache_ready) {
        wardrive_scan_cache_load(&cache);
    }
    bool tbl_ready = upload_state_table_load(&upload_tbl);

    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wardrive_is_fixed_output(entry->d_name)) {
            continue;
        }
        if (!wigle_is_upload_candidate(entry->d_name)) {
            continue;
        }

        current++;
        char filepath[280];
        snprintf(filepath, sizeof(filepath), "/sdcard/lab/wardrives/%s", entry->d_name);

        long fsize = 0;
        uint32_t hash = 0;
        wdgwars_wigle_stats_t wigle_stats;
        if (wardrive_file_identity(filepath, entry->d_name, cache_ready ? &cache : NULL,
                                   &fsize, &hash, &wigle_stats) != WARDRIVE_ID_OK) {
            MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (hash/read)", current, total_files, entry->d_name);
            failed++;
            continue;
        }

        /* Settled before any sanitizing: see the selected-files branch above. */
        if (!force_all && upload_tbl_is_done(tbl_ready ? &upload_tbl : NULL, "wigle", entry->d_name, fsize, hash)) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (already uploaded)", current, total_files, entry->d_name, fsize);
            skipped++;
            continue;
        }

        bool use_sanitized = false;
        if (!wdgwars_sanitize_wigle_file(filepath, &wigle_stats, &use_sanitized)) {
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED (preflight)", current, total_files, entry->d_name, fsize);
            failed++;
            continue;
        }

        const char *upload_path = use_sanitized ? WDGWARS_SANITIZED_UPLOAD_PATH : filepath;
        int result = wigle_upload_file(upload_path, entry->d_name);
        if (use_sanitized) {
            unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
        }
        if (result == 0) {
            upload_state_append("wigle", entry->d_name, fsize, hash, "done", &wigle_stats);
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", current, total_files, entry->d_name, fsize);
            uploaded++;
        } else if (result == 1) {
            upload_state_append("wigle", entry->d_name, fsize, hash, "done", &wigle_stats);
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (duplicate)", current, total_files, entry->d_name, fsize);
            skipped++;
        } else if (result == 2) {
            MY_LOG_INFO(TAG, "NO WIGLE CREDENTIALS");
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> AUTH FAILED", current, total_files, entry->d_name, fsize);
            failed++;
            auth_failed = true;
            break;
        } else {
            upload_state_append("wigle", entry->d_name, fsize, hash, "failed", &wigle_stats);
            MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", current, total_files, entry->d_name, fsize);
            failed++;
        }

        vTaskDelay(pdMS_TO_TICKS(400));
    }

    closedir(dir);
    if (cache_ready) {
        wardrive_scan_cache_writeback(&cache);
        wardrive_scan_cache_free(&cache);
    }
    if (tbl_ready) {
        upload_state_table_free(&upload_tbl);
    }

    MY_LOG_INFO(TAG, "Done: %d uploaded, %d skipped, %d failed", uploaded, skipped, failed);
    if (auth_failed) {
        return 1;
    }
    return (failed > 0) ? 1 : 0;
}

static int wdgwars_parse_retry_after_ms(const char *resp) {
    if (!resp) {
        return 0;
    }

    const char *p = strcasestr(resp, "Retry-After:");
    if (!p) {
        return 0;
    }
    p += strlen("Retry-After:");
    while (*p == ' ' || *p == '\t') {
        p++;
    }
    int seconds = atoi(p);
    if (seconds <= 0) {
        return 0;
    }
    if (seconds > 3600) {
        seconds = 3600;
    }
    return seconds * 1000;
}

static int wdgwars_next_backoff_ms(int retry_after_ms) {
    if (retry_after_ms > 0) {
        return retry_after_ms;
    }

    int shift = wdgwars_rate_limit_streak;
    if (shift < 0) shift = 0;
    if (shift > 3) shift = 3;
    int backoff = WDGWARS_BACKOFF_BASE_MS << shift;
    if (backoff > WDGWARS_BACKOFF_MAX_MS) {
        backoff = WDGWARS_BACKOFF_MAX_MS;
    }
    backoff += (int)((esp_timer_get_time() / 1000) % 5000); // small deterministic jitter
    return backoff;
}

static void wdgwars_note_rate_limited(int retry_after_ms) {
    wdgwars_rate_limit_streak++;
    int backoff_ms = wdgwars_next_backoff_ms(retry_after_ms);
    wdgwars_circuit_open_until_us = esp_timer_get_time() + ((int64_t)backoff_ms * 1000LL);
    MY_LOG_INFO(TAG, "WDGWars rate limited (HTTP 429). Circuit open for %d s.",
                (backoff_ms + 999) / 1000);
}

static void wdgwars_note_success(void) {
    wdgwars_rate_limit_streak = 0;
    wdgwars_circuit_open_until_us = 0;
}

static bool wdgwars_circuit_allows_request(void) {
    int64_t now = esp_timer_get_time();
    if (wdgwars_circuit_open_until_us > now) {
        int wait_s = (int)((wdgwars_circuit_open_until_us - now + 999999LL) / 1000000LL);
        MY_LOG_INFO(TAG, "WDGWars circuit open, retry after %d s", wait_s);
        return false;
    }
    return true;
}

