brokali/projectZeroTouch/ESP32C5/main/main.c
    int64_t body_total_len_64 = (int64_t)start_len + (int64_t)file_size + (int64_t)end_len;
    if (body_total_len_64 <= 0 || body_total_len_64 > INT_MAX) {
        MY_LOG_INFO(TAG, "  File too large for HTTP content-length: %ld bytes", file_size);
        goto cleanup;
    }
    int body_total_len = (int)body_total_len_64;

    http_headers = (char *)heap_caps_malloc(HDR_BUF_SZ, MALLOC_CAP_8BIT);
    resp_buf = (char *)heap_caps_malloc(RESP_BUF_SZ, MALLOC_CAP_8BIT);
    chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!chunk_buf) {
        chunk_buf = (uint8_t *)heap_caps_malloc(CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (!http_headers || !resp_buf || !chunk_buf) {
        MY_LOG_INFO(TAG, "  Buffer allocation failed (hdr/resp/chunk)");
        goto cleanup;
    }

    int hdr_len = snprintf(http_headers, HDR_BUF_SZ,
                           "POST /api/v2/upload-csv HTTP/1.1\r\n"
                           "Host: wdgwars.pl\r\n"
                           "X-API-Key: %s\r\n"
                           "Content-Type: multipart/form-data; boundary=%s\r\n"
                           "Content-Length: %d\r\n"
                           "User-Agent: projectZero-wdgwars\r\n"
                           "Connection: close\r\n"
                           "\r\n",
                           wdgwars_api_key, boundary, body_total_len);
    if (hdr_len <= 0 || hdr_len >= (int)HDR_BUF_SZ) {
        MY_LOG_INFO(TAG, "  Failed to build HTTP headers");
        goto cleanup;
    }

    esp_tls_cfg_t tls_cfg = {
        .crt_bundle_attach = NULL,
        .timeout_ms = 20000,
    };

    tls = esp_tls_init();
    if (!tls) {
        MY_LOG_INFO(TAG, "  TLS init failed");
        goto cleanup;
    }

    int ret = esp_tls_conn_http_new_sync(WDGWARS_V2_URL, &tls_cfg, tls);
    if (ret < 0) {
        MY_LOG_INFO(TAG, "  TLS connection failed");
        goto cleanup;
    }

    if (wpasec_tls_write_all(tls, http_headers, hdr_len) < 0 ||
        wpasec_tls_write_all(tls, body_start, start_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send request headers/body start");
        goto cleanup;
    }

    while (1) {
        size_t bytes_read = fread(chunk_buf, 1, CHUNK_SIZE, f);
        if (bytes_read > 0) {
            if (wpasec_tls_write_all(tls, (const char *)chunk_buf, (int)bytes_read) < 0) {
                MY_LOG_INFO(TAG, "  Failed to send file chunk");
                goto cleanup;
            }
        }
        if (bytes_read < CHUNK_SIZE) {
            if (ferror(f)) {
                MY_LOG_INFO(TAG, "  Read error while streaming file");
                goto cleanup;
            }
            break;
        }
    }

    if (wpasec_tls_write_all(tls, body_end, end_len) < 0) {
        MY_LOG_INFO(TAG, "  Failed to send multipart footer");
        goto cleanup;
    }

    memset(resp_buf, 0, RESP_BUF_SZ);
    int total_read = 0;
    while (total_read < (int)RESP_BUF_SZ - 1) {
        ret = esp_tls_conn_read(tls, resp_buf + total_read, RESP_BUF_SZ - 1 - total_read);
        if (ret <= 0) break;
        total_read += ret;
    }
    resp_buf[total_read] = '\0';

    int status = 0;
    if (total_read > 12 && strncmp(resp_buf, "HTTP/", 5) == 0) {
        const char *sp = strchr(resp_buf, ' ');
        if (sp) {
            status = atoi(sp + 1);
        }
    }

    if (status == 401 || status == 403) {
        result = 2;
        goto cleanup;
    }
    if (status == 429) {
        wdgwars_note_rate_limited(wdgwars_parse_retry_after_ms(resp_buf));
        result = WDGWARS_RESULT_RATE_LIMITED;
        goto cleanup;
    }

    if (status == 200 || status == 201 || status == 202) {
        const char *json = strchr(resp_buf, '{');
        if (!json) {
            result = 0;
            goto cleanup;
        }

        cJSON *root = cJSON_Parse(json);
        if (!root) {
            MY_LOG_INFO(TAG, "  WDGWars response JSON parse failed");
            goto cleanup;
        }

        cJSON *job_id = cJSON_GetObjectItem(root, "job_id");
        if (cJSON_IsNumber(job_id)) {
            int id = job_id->valueint;
            cJSON_Delete(root);
            MY_LOG_INFO(TAG, "  WDGWars job %d queued", id);
            result = wdgwars_poll_upload_job(id);
            goto cleanup;
        }

        cJSON *ok = cJSON_GetObjectItem(root, "ok");
        if (cJSON_IsBool(ok) && cJSON_IsTrue(ok)) {
            result = 0;
        } else {
            MY_LOG_INFO(TAG, "  WDGWars response missing job_id");
            result = -1;
        }
        cJSON_Delete(root);
        goto cleanup;
    }
    if (status == 409) {
        result = 1;
        goto cleanup;
    }

    MY_LOG_INFO(TAG, "  HTTP error %d", status);
    result = -1;

cleanup:
    if (f) {
        fclose(f);
    }
    if (tls) {
        esp_tls_conn_destroy(tls);
    }
    if (chunk_buf) {
        free(chunk_buf);
    }
    if (http_headers) {
        free(http_headers);
    }
    if (resp_buf) {
        free(resp_buf);
    }
    return result;
}

static int cmd_wdgwars_key(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: wdgwars_key set <key> | wdgwars_key read | wdgwars_key clear");
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (wdgwars_api_key[0] == '\0') {
            MY_LOG_INFO(TAG, "WDGWars key: not set");
            MY_LOG_INFO(TAG, "Set via: wdgwars_key set <key>");
            MY_LOG_INFO(TAG, "Or place the API key in /sdcard/lab/wdgwars.txt before upload.");
        } else {
            MY_LOG_INFO(TAG, "WDGWars key: %.4s****", wdgwars_api_key);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "clear") == 0) {
        if (wdgwars_clear_key_from_nvs()) {
            wdgwars_api_key[0] = '\0';
            MY_LOG_INFO(TAG, "WDGWars key cleared from NVS.");
        } else {
            MY_LOG_INFO(TAG, "Failed to clear WDGWars key from NVS.");
            return 1;
        }
        return 0;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: wdgwars_key set <key>");
            return 0;
        }
        const char *key = argv[2];
        if (strlen(key) == 0 || strlen(key) >= WDGWARS_KEY_MAX_LEN) {
            MY_LOG_INFO(TAG, "Invalid key length (max %d chars)", WDGWARS_KEY_MAX_LEN - 1);
            return 1;
        }
        if (wdgwars_save_key_to_nvs(key)) {
            strncpy(wdgwars_api_key, key, sizeof(wdgwars_api_key) - 1);
            wdgwars_api_key[sizeof(wdgwars_api_key) - 1] = '\0';
            MY_LOG_INFO(TAG, "WDGWars key saved: %.4s****", wdgwars_api_key);
        } else {
            MY_LOG_INFO(TAG, "Failed to save WDGWars key to NVS");
            return 1;
        }
        return 0;
    }

