brokali/projectZeroTouch/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "Usage: wdgwars_key set <key> | wdgwars_key read | wdgwars_key clear");
    return 0;
}

static void wdgwars_log_history_result(cJSON *entry) {
    if (!entry) {
        return;
    }

    cJSON *endpoint = cJSON_GetObjectItem(entry, "endpoint");
    cJSON *file_size = cJSON_GetObjectItem(entry, "file_size");
    cJSON *created_at = cJSON_GetObjectItem(entry, "created_at");
    cJSON *result = cJSON_GetObjectItem(entry, "result");

    const char *endpoint_str = (cJSON_IsString(endpoint) && endpoint->valuestring) ? endpoint->valuestring : "unknown";
    const char *created_str = (cJSON_IsString(created_at) && created_at->valuestring) ? created_at->valuestring : "unknown";
    int size_val = cJSON_IsNumber(file_size) ? file_size->valueint : -1;

    MY_LOG_INFO(TAG, "  Upload history: endpoint=%s size=%d at=%s",
                endpoint_str, size_val, created_str);

    if (cJSON_IsObject(result)) {
        cJSON *imported = cJSON_GetObjectItem(result, "imported");
        cJSON *captured = cJSON_GetObjectItem(result, "captured");
        cJSON *updated = cJSON_GetObjectItem(result, "updated");
        cJSON *duplicates = cJSON_GetObjectItem(result, "duplicates");
        cJSON *no_gps = cJSON_GetObjectItem(result, "no_gps");
        cJSON *bad_rows = cJSON_GetObjectItem(result, "bad_rows");
        cJSON *cooldown = cJSON_GetObjectItem(result, "cooldown");

        MY_LOG_INFO(TAG, "  Result: imported=%d captured=%d updated=%d duplicates=%d no_gps=%d bad_rows=%d cooldown=%d",
                    cJSON_IsNumber(imported) ? imported->valueint : 0,
                    cJSON_IsNumber(captured) ? captured->valueint : 0,
                    cJSON_IsNumber(updated) ? updated->valueint : 0,
                    cJSON_IsNumber(duplicates) ? duplicates->valueint : 0,
                    cJSON_IsNumber(no_gps) ? no_gps->valueint : 0,
                    cJSON_IsNumber(bad_rows) ? bad_rows->valueint : 0,
                    cJSON_IsNumber(cooldown) ? cooldown->valueint : 0);
    }
}

/**
 * @brief Query upload history and check if filename appears in the last uploads.
 * @return true if found (upload confirmed), false otherwise
 */
static bool wdgwars_check_in_history(const char *filename) {
    const size_t RESP_BUF_SZ = 4096;
    bool found = false;
    esp_tls_t *tls = NULL;
    char *resp_buf = NULL;
    char *req_buf = NULL;

    resp_buf = (char *)heap_caps_malloc(RESP_BUF_SZ, MALLOC_CAP_8BIT);
    req_buf  = (char *)heap_caps_malloc(256, MALLOC_CAP_8BIT);
    if (!resp_buf || !req_buf) goto hist_cleanup;

    int req_len = snprintf(req_buf, 256,
                           "GET /api/upload-history?limit=5 HTTP/1.1\r\n"
                           "Host: wdgwars.pl\r\n"
                           "X-API-Key: %s\r\n"
                           "Connection: close\r\n"
                           "\r\n",
                           wdgwars_api_key);
    if (req_len <= 0 || req_len >= 256) goto hist_cleanup;

    esp_tls_cfg_t tls_cfg = { .crt_bundle_attach = NULL, .timeout_ms = 10000 };
    tls = esp_tls_init();
    if (!tls) goto hist_cleanup;
    if (esp_tls_conn_http_new_sync(WDGWARS_HISTORY_URL, &tls_cfg, tls) < 0) goto hist_cleanup;
    if (wpasec_tls_write_all(tls, req_buf, req_len) < 0) goto hist_cleanup;

    memset(resp_buf, 0, RESP_BUF_SZ);
    int total_read = 0;
    int ret;
    while (total_read < (int)RESP_BUF_SZ - 1) {
        ret = esp_tls_conn_read(tls, resp_buf + total_read, RESP_BUF_SZ - 1 - total_read);
        if (ret <= 0) break;
        total_read += ret;
    }
    resp_buf[total_read] = '\0';

    // Find JSON body after HTTP headers
    const char *body = strstr(resp_buf, "\r\n\r\n");
    if (!body) goto hist_cleanup;
    body += 4;

    cJSON *root = cJSON_Parse(body);
    if (!root) goto hist_cleanup;

    cJSON *uploads = cJSON_GetObjectItem(root, "uploads");
    if (cJSON_IsArray(uploads)) {
        int n = cJSON_GetArraySize(uploads);
        for (int i = 0; i < n && !found; i++) {
            cJSON *entry = cJSON_GetArrayItem(uploads, i);
            cJSON *fn = cJSON_GetObjectItem(entry, "filename");
            if (cJSON_IsString(fn) && fn->valuestring &&
                strcmp(fn->valuestring, filename) == 0) {
                found = true;
                wdgwars_log_history_result(entry);
            }
        }
    }
    cJSON_Delete(root);

hist_cleanup:
    if (tls) esp_tls_conn_destroy(tls);
    if (resp_buf) free(resp_buf);
    if (req_buf)  free(req_buf);
    return found;
}

static int wdgwars_upload_file_with_retry(const char *filepath, const char *filename) {
    if (!wdgwars_circuit_allows_request()) {
        return WDGWARS_RESULT_RATE_LIMITED;
    }

    int result = wdgwars_upload_file(filepath, filename);
    if (result == WDGWARS_RESULT_RATE_LIMITED) {
        return result;
    }
    if (result == 0) {
        wdgwars_note_success();
        vTaskDelay(pdMS_TO_TICKS(1000));
        if (wdgwars_check_in_history(filename)) {
            MY_LOG_INFO(TAG, "  Upload confirmed via history");
        }
        return 0;
    }
    if (result != -1) return result;

    // HTTP error (likely timeout reading response) — verify via history before retrying
    MY_LOG_INFO(TAG, "  Upload response not received, checking history...");
    vTaskDelay(pdMS_TO_TICKS(3000));
    if (wdgwars_check_in_history(filename)) {
        MY_LOG_INFO(TAG, "  Upload confirmed via history");
        return 0;
    }

    // Not in history yet — try once more
    MY_LOG_INFO(TAG, "  Not found in history, retrying upload...");
    if (!wdgwars_circuit_allows_request()) {
        return WDGWARS_RESULT_RATE_LIMITED;
    }
    result = wdgwars_upload_file(filepath, filename);
    if (result == WDGWARS_RESULT_RATE_LIMITED) {
        return result;
    }
    if (result == 1) {
        // Duplicate on retry = first attempt landed after all
        wdgwars_note_success();
        MY_LOG_INFO(TAG, "  Upload confirmed (duplicate on retry)");
        return 0;
    }
    if (result == 0) {
        wdgwars_note_success();
    }
    return result;
}

static int cmd_wdgwars_upload(int argc, char **argv) {
    oled_display_update_full("> WDGWars", "  Sending files", "  wdgwars.pl", "  Uploading...");

    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "WIFI NOT CONNECTED");
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return 1;
    }

