brokali/projectZeroTouch/ESP32C5/main/main.c
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    create_sd_directories();
    if (wdgwars_api_key[0] == '\0') {
        wdgwars_load_key_from_sd();
    }

    if (wdgwars_api_key[0] == '\0') {
        MY_LOG_INFO(TAG, "NO WDGWARS CREDENTIALS");
        MY_LOG_INFO(TAG, "Use 'wdgwars_key set <key>' or /sdcard/lab/wdgwars.txt");
        return 1;
    }

    if (!wdgwars_circuit_allows_request()) {
        return 0;
    }

    int uploaded = 0;
    int skipped = 0;
    int failed = 0;
    int rate_limited = 0;
    bool auth_failed = false;
    bool force_all = (argc > 1 && strcasecmp(argv[1], "all") == 0);

    if (argc > 1 && !force_all) {
        int total_files = argc - 1;
        MY_LOG_INFO(TAG, "Uploading %d selected Wardrive file(s) to wdgwars.pl...", total_files);

        wardrive_scan_cache_t cache;
        upload_state_table_t upload_tbl;
        bool cache_ready = wardrive_scan_cache_init(&cache);
        if (cache_ready) {
            wardrive_scan_cache_load(&cache);
        }
        bool tbl_ready = upload_state_table_load(&upload_tbl);

        for (int i = 1; i < argc; i++) {
            const char *arg = argv[i];
            char filepath[280];
            char upload_name[128];

            if (!wdgwars_resolve_upload_target(arg, filepath, sizeof(filepath), upload_name, sizeof(upload_name))) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (invalid/missing file)", i, total_files, arg ? arg : "(null)");
                failed++;
                continue;
            }

            struct stat st;
            long fsize = 0;
            wdgwars_wigle_stats_t wigle_stats;
            bool use_sanitized = false;
            uint32_t hash = 0;
            if (wardrive_file_identity(filepath, upload_name, cache_ready ? &cache : NULL,
                                       &fsize, &hash, &wigle_stats) != WARDRIVE_ID_OK) {
                MY_LOG_INFO(TAG, "[%d/%d] %s -> FAILED (hash/read)", i, total_files, upload_name);
                failed++;
                continue;
            }

            /* Settled before any sanitizing. Building the tmp copy reads and rewrites
             * the whole file, and on a real card nearly every candidate turns out to be
             * uploaded already — that is where the 200 s to send one file and skip 62
             * was going. */
            if (upload_tbl_is_done(tbl_ready ? &upload_tbl : NULL, "wdgwars", upload_name, fsize, hash)) {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped (already uploaded)", i, total_files, upload_name, fsize);
                skipped++;
                continue;
            }

            /* Only files that are really going to be sent get a sanitized copy. */
            if (wdgwars_sanitize_wigle_file(filepath, &wigle_stats, &use_sanitized)) {
                const char *upload_path = use_sanitized ? WDGWARS_SANITIZED_UPLOAD_PATH : filepath;
                if (use_sanitized && stat(upload_path, &st) == 0) {
                    /* Keep fsize/hash from the original file for upload_state identity. */
                }

                int result = wdgwars_upload_file_with_retry(upload_path, upload_name);
                if (use_sanitized) {
                    unlink(WDGWARS_SANITIZED_UPLOAD_PATH);
                }
                if (result == 0) {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "done", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> OK", i, total_files, upload_name, fsize);
                    uploaded++;
                } else if (result == 1) {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "done", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> skipped", i, total_files, upload_name, fsize);
                    skipped++;
                } else if (result == 2) {
                    MY_LOG_INFO(TAG, "WDGWARS AUTH FAILED");
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> AUTH FAILED", i, total_files, upload_name, fsize);
                    failed++;
                    auth_failed = true;
                    break;
                } else if (result == WDGWARS_RESULT_RATE_LIMITED) {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "rate_limited", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> RATE LIMITED", i, total_files, upload_name, fsize);
                    rate_limited++;
                    break;
                } else {
                    upload_state_append("wdgwars", upload_name, fsize, hash, "failed", &wigle_stats);
                    MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED", i, total_files, upload_name, fsize);
                    failed++;
                }
            } else {
                MY_LOG_INFO(TAG, "[%d/%d] %s (%ld bytes) -> FAILED (preflight)", i, total_files, upload_name, fsize);
                failed++;
            }

            vTaskDelay(pdMS_TO_TICKS(250));
        }

        if (cache_ready) {
            wardrive_scan_cache_writeback(&cache);
            wardrive_scan_cache_free(&cache);
        }
        if (tbl_ready) {
            upload_state_table_free(&upload_tbl);
        }

        MY_LOG_INFO(TAG, "Done: %d uploaded, %d skipped, %d failed, %d rate_limited", uploaded, skipped, failed, rate_limited);
        if (auth_failed) {
            return 1;
        }
        return (failed > 0) ? 1 : 0;
    }

    DIR *dir = opendir("/sdcard/lab/wardrives");
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/wardrives directory");
        return 1;
    }

    struct dirent *entry;
    int total_files = 0;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (wardrive_is_fixed_output(entry->d_name)) {
            continue;
        }
        if (wdgwars_is_upload_candidate(entry->d_name)) {
            total_files++;
        }
    }

    if (total_files == 0) {
        MY_LOG_INFO(TAG, "No Wardrive files (.log/.csv/.gz) found in /sdcard/lab/wardrives/");
        MY_LOG_INFO(TAG, "Done: 0 uploaded, 0 skipped, 0 failed");
        closedir(dir);
        return 0;
    }

    MY_LOG_INFO(TAG, "Uploading %d Wardrive file(s) to wdgwars.pl%s...", total_files,
                force_all ? " (force all)" : "");

    rewinddir(dir);
    int current = 0;

    wardrive_scan_cache_t cache;
    upload_state_table_t upload_tbl;
    bool cache_ready = wardrive_scan_cache_init(&cache);
    if (cache_ready) {
        wardrive_scan_cache_load(&cache);
    }
    bool tbl_ready = upload_state_table_load(&upload_tbl);

