brokali/projectZeroTouch/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "Beacon spam started. Use 'stop' to end.");
    return 0;
}

static int cmd_start_beacon_spam(int argc, char **argv) {
    {
        char oled_l3[24];
        snprintf(oled_l3, sizeof(oled_l3), "  %d fake SSIDs", argc - 1 > 0 ? argc - 1 : 0);
        oled_display_update_full("> Beacon Spam",
            argc >= 2 ? argv[1] : "  No SSIDs",
            oled_l3, "  Broadcast...");
    }
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: start_beacon_spam \"SSID1\" \"SSID2\" ...");
        return 1;
    }

    if (beacon_spam_active || beacon_spam_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Beacon spam already running. Use 'stop' first.");
        return 1;
    }

    beacon_ssid_count = 0;
    for (int i = 1; i < argc && beacon_ssid_count < MAX_BEACON_SSIDS; i++) {
        int len = strlen(argv[i]);
        if (len > 0 && len <= 32) {
            strncpy(beacon_ssids[beacon_ssid_count], argv[i], 32);
            beacon_ssids[beacon_ssid_count][32] = '\0';
            beacon_ssid_count++;
        } else {
            MY_LOG_INFO(TAG, "Warning: SSID %d invalid length (%d), skipping", i, len);
        }
    }

    if (beacon_ssid_count == 0) {
        MY_LOG_INFO(TAG, "No valid SSIDs provided");
        return 1;
    }

    return start_beacon_spam_internal();
}

static int cmd_start_beacon_spam_ssids(int argc, char **argv) {
    (void)argc; (void)argv;

    if (beacon_spam_active || beacon_spam_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Beacon spam already running. Use 'stop' first.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    FILE *f = fopen(SSIDS_FILE_PATH, "r");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "ssids.txt not found on SD card.");
        return 1;
    }

    beacon_ssid_count = 0;
    char line[96];
    while (beacon_ssid_count < MAX_BEACON_SSIDS && fgets(line, sizeof(line), f)) {
        char *s = line;
        while (*s && isspace((unsigned char)*s)) s++;
        char *e = s + strlen(s);
        while (e > s && (e[-1] == '\n' || e[-1] == '\r')) *--e = '\0';
        while (e > s && isspace((unsigned char)e[-1])) *--e = '\0';
        if (*s == '\0') continue;
        int len = strlen(s);
        if (len > 32) len = 32;
        strncpy(beacon_ssids[beacon_ssid_count], s, 32);
        beacon_ssids[beacon_ssid_count][32] = '\0';
        beacon_ssid_count++;
    }
    fclose(f);

    if (beacon_ssid_count == 0) {
        MY_LOG_INFO(TAG, "ssids.txt is empty - no SSIDs to broadcast");
        return 1;
    }

    {
        char oled_l3[24];
        snprintf(oled_l3, sizeof(oled_l3), "  %d SSIDs", beacon_ssid_count);
        oled_display_update_full("> Beacon Spam", "  from ssids.txt", oled_l3, "  Broadcast...");
    }

    return start_beacon_spam_internal();
}

static int cmd_stop(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> STOPPED", "  All ops halted", "", "  > Idle");
    MY_LOG_INFO(TAG, "Stop command received - stopping all operations...");

    // Sampled before any flag is cleared, so the acknowledgement at the end can tell
    // the host whether this stop actually stopped a wardrive or found nothing running.
    // The host stops and restarts scans back to back and had no way to confirm the
    // module went idle, so it needed a run generation counter to keep an old reader
    // task from being revived by the next start.
    bool wardrive_was_running = (wardrive_active || wardrive_task_handle != NULL ||
                                 wardrive_promisc_active || wardrive_promisc_task_handle != NULL);

    // Set global stop flags
    operation_stop_requested = true;
    wardrive_active = false;

    // Stop packet monitor if running
    packet_monitor_stop();

    // Stop nRF24 jammer if running
    nrf24_jammer_stop();

    // Stop 802.15.4 recon if running
    if (zig_recon_is_active() || current_radio_mode == RADIO_MODE_IEEE802154) {
        zig_recon_stop();
        current_radio_mode = RADIO_MODE_NONE;
        MY_LOG_INFO(TAG, "802.15.4 recon stopped.");
    }

    // Stop AP locator if running
    ap_locator_stop();

    // Stop PCAP capture if running
    if (pcap_capture_active) {
        if (pcap_capture_mode == PCAP_MODE_GATEWAY) {
            // Stop admitting new packets before draining the limiter. The saved
            // callbacks stay available to forward packets already accepted by
            // the limiter task.
            if (pcap_hooked_netif != NULL) {
                if (pcap_original_input != NULL) {
                    pcap_hooked_netif->input = pcap_original_input;
                }
                if (pcap_original_linkoutput != NULL) {
                    pcap_hooked_netif->linkoutput = pcap_original_linkoutput;
                }
            }
            pcap_rate_limiter_stop();
        }
        pcap_capture_active = false;

        if (pcap_capture_mode == PCAP_MODE_RADIO) {
            esp_wifi_set_promiscuous(false);
        } else if (pcap_capture_mode == PCAP_MODE_NET ||
                   pcap_capture_mode == PCAP_MODE_GATEWAY) {
            if (pcap_capture_mode == PCAP_MODE_NET && pcap_arp_active) {
                pcap_arp_active = false;
                for (int i = 0; i < 60 && pcap_arp_task_handle != NULL; i++) {
                    vTaskDelay(pdMS_TO_TICKS(100));
                }
                if (pcap_arp_task_handle != NULL) {
                    vTaskDelete(pcap_arp_task_handle);
                    pcap_arp_task_handle = NULL;
                    MY_LOG_INFO(TAG, "ARP spoof task force-deleted");
                }
                pcap_arp_host_count = 0;
            }

            // Idempotent for non-gateway capture and already-drained gateway.
            pcap_rate_limiter_stop();

            if (pcap_hooked_netif) {
                if (pcap_original_input) pcap_hooked_netif->input = pcap_original_input;
                if (pcap_original_linkoutput) pcap_hooked_netif->linkoutput = pcap_original_linkoutput;
            }
            pcap_original_input = NULL;
            pcap_original_linkoutput = NULL;
            pcap_hooked_netif = NULL;
        }

