brokali/projectZeroTouch/ESP32C5/main/main.c
        for (int i = 0; i < 200 && pcap_writer_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        if (pcap_writer_task_handle != NULL) {
            vTaskDelete(pcap_writer_task_handle);
            pcap_writer_task_handle = NULL;
        }

        if (pcap_packet_queue) {
            pcap_queued_frame_t *leftover = NULL;
            while (xQueueReceive(pcap_packet_queue, &leftover, 0) == pdTRUE) {
                heap_caps_free(leftover);
                portENTER_CRITICAL(&pcap_stats_lock);
                pcap_capture_drop_count++;
                pcap_capture_drop_queue_count++;
                portEXIT_CRITICAL(&pcap_stats_lock);
            }
            vQueueDelete(pcap_packet_queue);
            pcap_packet_queue = NULL;
        }

        if (pcap_capture_file) {
            fclose(pcap_capture_file);
            pcap_capture_file = NULL;
            sd_sync();
        }
        if (pcap_stdio_buffer != NULL) {
            heap_caps_free(pcap_stdio_buffer);
            pcap_stdio_buffer = NULL;
        }

        MY_LOG_INFO(TAG, "PCAP saved: %s (%lu frames, %lu drops)",
                    pcap_capture_filepath,
                    (unsigned long)pcap_capture_frame_count,
                    (unsigned long)pcap_capture_drop_count);
        printf("[PCAP_FINAL] file=%s frames=%lu drops=%lu drop_alloc=%lu drop_queue=%lu drop_write=%lu rate_queue_drops=%lu throttle_events=%lu pause_events=%lu filter_drops=%lu\n",
               pcap_capture_filepath,
               (unsigned long)pcap_capture_frame_count,
               (unsigned long)pcap_capture_drop_count,
               (unsigned long)pcap_capture_drop_alloc_count,
               (unsigned long)pcap_capture_drop_queue_count,
               (unsigned long)pcap_capture_drop_write_count,
               (unsigned long)pcap_rate_queue_drop_count,
               (unsigned long)pcap_rate_throttle_event_count,
               (unsigned long)pcap_rate_pause_event_count,
               (unsigned long)pcap_gateway_filtered_frame_count);
        pcap_capture_mode = PCAP_MODE_NONE;
    }

    // Disable routed gateway only after any gateway PCAP hook has been restored.
    if (capture_gateway_is_active()) {
        esp_err_t gateway_err = capture_gateway_stop();
        if (gateway_err == ESP_OK) {
            MY_LOG_INFO(TAG, "Capture Gateway stopped");
        } else {
            MY_LOG_INFO(TAG, "Capture Gateway stop warning: %s", esp_err_to_name(gateway_err));
        }
    }
    rogue_gitm_mode_active = false;

    // Stop handshake attack task if running
    if (handshake_attack_active || handshake_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping handshake attack task...");
        handshake_attack_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && handshake_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (handshake_attack_task_handle != NULL) {
            vTaskDelete(handshake_attack_task_handle);
            handshake_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "Handshake attack task forcefully stopped.");
        }
        
        // Stop any active handshake capture
        attack_handshake_stop();
        
        // Clean up state
        handshake_target_count = 0;
        handshake_current_index = 0;
        memset(handshake_targets, 0, MAX_AP_CNT * sizeof(wifi_ap_record_t));
        memset(handshake_captured, 0, sizeof(handshake_captured));
    } else {
        // Stop handshake attack if running (old non-task mode)
        attack_handshake_stop();
    }

    // Stop channel view monitor if running
    channel_view_stop();
    
    // Stop deauth attack task if running
    if (deauth_attack_active || deauth_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping deauth attack task...");
        deauth_attack_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && deauth_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (deauth_attack_task_handle != NULL) {
            vTaskDelete(deauth_attack_task_handle);
            deauth_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "Deauth attack task forcefully stopped.");
        }
        
        // Clear target BSSIDs
        target_bssid_count = 0;
        memset(target_bssids, 0, MAX_TARGET_BSSIDS * sizeof(target_bssid_t));
    }
    
    // Stop SAE overflow attack task if running
    if (sae_attack_active || sae_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping SAE overflow task...");
        sae_attack_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && sae_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (sae_attack_task_handle != NULL) {
            vTaskDelete(sae_attack_task_handle);
            sae_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "SAE overflow task forcefully stopped.");
        }
    }
    
    // Stop blackout attack task if running
    if (blackout_attack_active || blackout_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping blackout attack task...");
        blackout_attack_active = false;
        
        // Wait a bit for task to finish
        for (int i = 0; i < 20 && blackout_attack_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (blackout_attack_task_handle != NULL) {
            vTaskDelete(blackout_attack_task_handle);
            blackout_attack_task_handle = NULL;
            MY_LOG_INFO(TAG, "Blackout attack task forcefully stopped.");
        }
        
        // Clear target BSSIDs
        target_bssid_count = 0;
        memset(target_bssids, 0, MAX_TARGET_BSSIDS * sizeof(target_bssid_t));
    }
    
    // Stop beacon spam task if running
    if (beacon_spam_active || beacon_spam_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping beacon spam task...");
        beacon_spam_active = false;
        
