brokali/projectZeroTouch/ESP32C5/main/main.c
    // Stop wardrive promisc task if running
    if (wardrive_promisc_active || wardrive_promisc_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping wardrive promisc task...");
        wardrive_promisc_active = false;
        esp_wifi_set_promiscuous(false);
        
        for (int i = 0; i < 20 && wardrive_promisc_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        if (wardrive_promisc_task_handle != NULL) {
            vTaskDelete(wardrive_promisc_task_handle);
            wardrive_promisc_task_handle = NULL;
            MY_LOG_INFO(TAG, "Wardrive promisc task forcefully stopped.");
        }
    }

    // Both wardrive tasks clear this on their own way out, but a vTaskDelete above skips
    // their cleanup entirely. Left set, the name would keep the scan cache refusing to
    // store that log for the rest of the boot, so every listing would rehash it.
    wardrive_set_active_log(NULL);

    // Stop anti-surveillance task if running
    if (antisurv_active || antisurv_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping anti-surveillance task...");
        antisurv_active = false;
        bt_stop_scan();

        for (int i = 0; i < 20 && antisurv_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        if (antisurv_task_handle != NULL) {
            vTaskDelete(antisurv_task_handle);
            antisurv_task_handle = NULL;
            MY_LOG_INFO(TAG, "Anti-surveillance task forcefully stopped.");
        }
    }

    // Stop DarkSword if active
    if (darksword_active) {
        MY_LOG_INFO(TAG, "Stopping DarkSword...");
        darksword_active = false;

        // Stop exfil listener task
        if (darksword_exfil_task_handle != NULL) {
            if (darksword_exfil_socket >= 0) {
                close(darksword_exfil_socket);
                darksword_exfil_socket = -1;
            }
            for (int i = 0; i < 30 && darksword_exfil_task_handle != NULL; i++) {
                vTaskDelay(pdMS_TO_TICKS(100));
            }
            if (darksword_exfil_task_handle != NULL) {
                vTaskDelete(darksword_exfil_task_handle);
                darksword_exfil_task_handle = NULL;
                MY_LOG_INFO(TAG, "DarkSword exfil task force-deleted");
            }
        }

        // Free HTML buffer
        if (darksword_html != NULL) {
            heap_caps_free(darksword_html);
            darksword_html = NULL;
            darksword_html_len = 0;
            darksword_html_gzipped = false;
        }
        MY_LOG_INFO(TAG, "DarkSword stopped.");
    }

    // Stop portal if active
    if (portal_active) {
        MY_LOG_INFO(TAG, "Stopping portal...");
        portal_active = false;
        karma_mode_active = false;
        rogueap_mode_active = false;

        // Stop DNS server task
        if (dns_server_task_handle != NULL) {
            // Wait for DNS task to finish (it checks portal_active flag)
            for (int i = 0; i < 30 && dns_server_task_handle != NULL; i++) {
                vTaskDelay(pdMS_TO_TICKS(100));
            }
            
            // Force cleanup if still running
            if (dns_server_task_handle != NULL) {
                vTaskDelete(dns_server_task_handle);
                dns_server_task_handle = NULL;
                if (dns_server_socket >= 0) {
                    close(dns_server_socket);
                    dns_server_socket = -1;
                }
            }
        }
        
        // Stop HTTP server
        if (portal_server != NULL) {
            httpd_stop(portal_server);
            portal_server = NULL;
            MY_LOG_INFO(TAG, "HTTP server stopped.");
        }
        
        // Stop DHCP server
        esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
        if (ap_netif) {
            esp_netif_dhcps_stop(ap_netif);
        }
        
        // Stop AP mode - full reset for clean state on next portal start
        esp_wifi_stop();
        esp_wifi_deinit();
        MY_LOG_INFO(TAG, "Portal stopped.");

        // Destroy AP netif so next portal start recreates AP mode cleanly
        ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
        if (ap_netif) {
            esp_netif_destroy(ap_netif);
        }
        ap_netif_handle = NULL;

        // Re-initialize WiFi fresh (STA mode)
        wifi_initialized = false;
        current_radio_mode = RADIO_MODE_NONE;
        if (!ensure_wifi_mode()) {
            MY_LOG_INFO(TAG, "Warning: Failed to reinitialize WiFi after portal stop");
        }
        
        // Clean up portal SSID
        if (portalSSID != NULL) {
            free(portalSSID);
            portalSSID = NULL;
        }
    }
    
    // Stop ARP ban if active
    if (arp_ban_active || arp_ban_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Stopping ARP ban...");
        arp_ban_active = false;
        
        // Wait for task to finish
        for (int i = 0; i < 20 && arp_ban_task_handle != NULL; i++) {
            vTaskDelay(pdMS_TO_TICKS(50));
        }
        
        // Force delete if still running
        if (arp_ban_task_handle != NULL) {
            vTaskDelete(arp_ban_task_handle);
            arp_ban_task_handle = NULL;
            MY_LOG_INFO(TAG, "ARP ban task forcefully stopped.");
        }
    }
    
    // Stop BLE scanner if running
    bt_scan_stop();
    
    // Disconnect from AP if connected via wifi_connect and reset WiFi
    if (current_radio_mode == RADIO_MODE_WIFI && wifi_initialized) {
        wifi_ap_record_t ap_info;
        if (esp_wifi_sta_get_ap_info(&ap_info) == ESP_OK) {
            MY_LOG_INFO(TAG, "Disconnecting from AP '%s'...", ap_info.ssid);
            esp_wifi_disconnect();
        }
        
        // Reset WiFi to clean state
        MY_LOG_INFO(TAG, "Resetting WiFi...");
        esp_wifi_stop();
        esp_wifi_deinit();
        
        // Destroy AP netif if exists
        esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
        if (ap_netif) {
            esp_netif_destroy(ap_netif);
        }
        ap_netif_handle = NULL;
        
        wifi_initialized = false;
        current_radio_mode = RADIO_MODE_NONE;
        
        // Reinitialize WiFi fresh (STA mode)
        if (!ensure_wifi_mode()) {
            MY_LOG_INFO(TAG, "Warning: Failed to reinitialize WiFi after stop");
        }
    }
    
    // Restore LED to idle (ignore errors if LED is in invalid state)
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED after stop (state: %s), ignoring...", esp_err_to_name(led_err));
    }
    
    MY_LOG_INFO(TAG, "All operations stopped.");
    // Deterministic and idempotent: printed on every stop, including one that found
    // nothing running, so the host can wait for a known state instead of flushing the
    // UART and assuming. The human-readable "Wardrive promisc stopped ..." line the
    // monitor task greps is emitted by the task itself and is untouched.
    printf("[WARDRIVE] STOPPED running=%d\n", wardrive_was_running ? 1 : 0);
    return 0;
}

