brokali/projectZeroTouch/ESP32C5/main/main.c
static bool zig_recon_radio_busy(char *reason, size_t reason_len)
{
    const char *why = NULL;
    if (g_scan_in_progress) why = "wifi_scan";
    else if (sniffer_active || sniffer_channel_task_handle != NULL) why = "sniffer";
    else if (packet_monitor_active || packet_monitor_task_handle != NULL) why = "packet_monitor";
    else if (ap_locator_active || ap_locator_task_handle != NULL) why = "ap_locator";
    else if (channel_view_active || channel_view_task_handle != NULL) why = "channel_view";
    else if (pcap_capture_active || pcap_writer_task_handle != NULL) why = "pcap";
    else if (capture_gateway_is_active()) why = "capture_gateway";
    else if (deauth_attack_active || deauth_attack_task_handle != NULL) why = "deauth";
    else if (blackout_attack_active || blackout_attack_task_handle != NULL) why = "blackout";
    else if (sae_attack_active || sae_attack_task_handle != NULL) why = "sae_overflow";
    else if (sniffer_dog_active || sniffer_dog_task_handle != NULL) why = "sniffer_dog";
    else if (deauth_detector_active || deauth_detector_task_handle != NULL) why = "deauth_detector";
    else if (handshake_attack_active || handshake_attack_task_handle != NULL) why = "handshake";
    else if (beacon_spam_active || beacon_spam_task_handle != NULL) why = "beacon_spam";
    else if (portal_active || darksword_active) why = "portal";
    else if (wardrive_active || wardrive_task_handle != NULL) why = "wardrive";
    else if (wardrive_promisc_active || wardrive_promisc_task_handle != NULL) why = "wardrive_promisc";
    else if (antisurv_active || antisurv_task_handle != NULL) why = "antisurveillance";
    else if (bt_scan_active || bt_airtag_scan_active || bt_scan_task_handle != NULL) why = "ble_scan";
    else if (nrf24_jammer_is_running()) why = "nrf24";

    if (why && reason && reason_len) {
        snprintf(reason, reason_len, "%s", why);
    }
    return why != NULL;
}

static bool zig_recon_parse_u16(const char *text, uint16_t *out)
{
    if (!text || !out || *text == '\0') {
        return false;
    }
    char *end = NULL;
    unsigned long value = strtoul(text, &end, 0);
    if (end == text || *end != '\0' || value > 0xffffUL) {
        return false;
    }
    *out = (uint16_t)value;
    return true;
}

static bool zig_recon_parse_channels(const char *arg, uint32_t *out_mask)
{
    if (!arg || !out_mask) {
        return false;
    }
    if (strcasecmp(arg, "all") == 0) {
        *out_mask = ZIG_RECON_ALL_CHANNELS_MASK;
        return true;
    }

    char buf[96];
    strlcpy(buf, arg, sizeof(buf));
    uint32_t mask = 0;
    char *saveptr = NULL;
    for (char *tok = strtok_r(buf, ",:", &saveptr); tok; tok = strtok_r(NULL, ",:", &saveptr)) {
        char *end = NULL;
        long ch = strtol(tok, &end, 10);
        if (end == tok || *end != '\0' || ch < ZIG_RECON_MIN_CHANNEL || ch > ZIG_RECON_MAX_CHANNEL) {
            return false;
        }
        mask |= (1UL << ch);
    }
    if (mask == 0) {
        return false;
    }
    *out_mask = mask;
    return true;
}

static void zig_recon_format_channels(uint32_t mask, char *out, size_t out_len)
{
    if (!out || out_len == 0) {
        return;
    }
    out[0] = '\0';
    bool first = true;
    for (uint8_t ch = ZIG_RECON_MIN_CHANNEL; ch <= ZIG_RECON_MAX_CHANNEL; ch++) {
        if (!(mask & (1UL << ch))) {
            continue;
        }
        char part[8];
        snprintf(part, sizeof(part), "%s%u", first ? "" : ",", ch);
        strlcat(out, part, out_len);
        first = false;
    }
    if (out[0] == '\0') {
        strlcpy(out, "none", out_len);
    }
}

static const char *zig_recon_pan_kind(uint16_t pan_id)
{
    return pan_id == 0xffff ? "broadcast" : "network";
}

static void zig_recon_format_ext(uint64_t value, char *out, size_t out_len)
{
    if (!out || out_len == 0) {
        return;
    }
    snprintf(out, out_len, "%08lx%08lx",
             (unsigned long)(value >> 32),
             (unsigned long)(value & 0xffffffffUL));
}

static zig_recon_snapshot_t *zig_recon_alloc_snapshot(void)
{
    return heap_caps_calloc(1, sizeof(zig_recon_snapshot_t), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
}

static int cmd_start_zig_recon(int argc, char **argv)
{
    if (argc > 3) {
        printf("Usage: start_zig_recon [all|11,15,20] [dwell_ms]\n");
        return 1;
    }
    if (zig_recon_is_active()) {
        printf("802.15.4 recon already running. Use 'stop' first.\n");
        return 1;
    }

    char busy[32] = {0};
    if (zig_recon_radio_busy(busy, sizeof(busy))) {
        printf("FAILED: radio busy (%s). Use 'stop' first.\n", busy);
        return 1;
    }

    zig_recon_config_t cfg = {
        .channel_mask = ZIG_RECON_ALL_CHANNELS_MASK,
        .dwell_ms = 250,
    };
    if (argc >= 2 && !zig_recon_parse_channels(argv[1], &cfg.channel_mask)) {
        printf("Usage: start_zig_recon [all|11,15,20] [dwell_ms]\n");
        return 1;
    }
    if (argc >= 3) {
        int dwell = atoi(argv[2]);
        if (dwell < 50 || dwell > 5000) {
            printf("dwell_ms must be 50-5000\n");
            return 1;
        }
        cfg.dwell_ms = (uint16_t)dwell;
    }

    if (!ensure_ieee802154_mode()) {
        printf("FAILED: unable to switch to 802.15.4 radio mode\n");
        return 1;
    }

    esp_err_t err = zig_recon_start(&cfg);
    if (err != ESP_OK) {
        current_radio_mode = RADIO_MODE_NONE;
        printf("FAILED: zig_recon_start: %s\n", esp_err_to_name(err));
        return 1;
    }

    operation_stop_requested = false;
    char channels[64];
    zig_recon_format_channels(cfg.channel_mask, channels, sizeof(channels));
    printf("802.15.4 recon started. channels=%s dwell_ms=%u mode=passive. Use 'stop' to end.\n",
           channels, cfg.dwell_ms);
    oled_display_update_full("> 802.15.4", "  Recon active", "  passive RX", "  > stop to end");
    return 0;
}

static int cmd_zig_recon_status(int argc, char **argv)
{
    (void)argc; (void)argv;
    zig_recon_snapshot_t *snap = zig_recon_alloc_snapshot();
    if (!snap) {
        printf("FAILED: no PSRAM for zig_recon_status snapshot\n");
        printf("[ZIG] END\n");
        return 1;
    }
    zig_recon_get_snapshot(snap);
    char channels[64];
    zig_recon_format_channels(snap->channel_mask, channels, sizeof(channels));

    printf("802.15.4 Recon: %s\n", snap->active ? "running" : "idle");
    printf("Channel: %u  Packets: %lu  Networks: %u  Dropped: %lu\n",
           snap->current_channel,
           (unsigned long)snap->packets_total,
           snap->pan_count,
           (unsigned long)snap->dropped_frames);
    printf("Hopping: %s dwell=%ums  Mode: passive\n", channels, snap->dwell_ms);
    printf("[ZIG] status active=%d channel=%u packets=%lu pans=%u nodes=%u dropped=%lu dwell_ms=%u channels=0x%08lx\n",
           snap->active ? 1 : 0,
           snap->current_channel,
           (unsigned long)snap->packets_total,
           snap->pan_count,
           snap->node_count,
           (unsigned long)snap->dropped_frames,
           snap->dwell_ms,
           (unsigned long)snap->channel_mask);
    printf("[ZIG] END\n");
    heap_caps_free(snap);
    return 0;
}

