brokali/projectZeroTouch/ESP32C5/main/main.c
static int cmd_zig_recon_list(int argc, char **argv)
{
    bool show_all = argc >= 2 && strcasecmp(argv[1], "all") == 0;
    if (argc > 2 || (argc == 2 && !show_all)) {
        printf("Usage: zig_recon_list [all]\n");
        return 1;
    }

    zig_recon_snapshot_t *snap = zig_recon_alloc_snapshot();
    if (!snap) {
        printf("FAILED: no PSRAM for zig_recon_list snapshot\n");
        printf("[ZIG] END\n");
        return 1;
    }
    zig_recon_get_snapshot(snap);
    printf("PAN       Proto       Ch                 Nodes  Packets  RSSI  Last\n");
    uint16_t printed = 0;
    uint16_t hidden = 0;
    uint32_t now = (uint32_t)(esp_timer_get_time() / 1000ULL);
    for (uint16_t i = 0; i < snap->pan_count; i++) {
        const zig_recon_pan_t *pan = &snap->pans[i];
        if (!show_all && pan->pan_id == 0xffff) {
            hidden++;
            continue;
        }
        if (!show_all && printed >= 20) {
            hidden++;
            continue;
        }
        char channels[64];
        zig_recon_format_channels(pan->channel_mask, channels, sizeof(channels));
        uint32_t age_ms = pan->last_seen_ms ? (now - pan->last_seen_ms) : 0;
        uint32_t age_s = age_ms / 1000U;
        printf("0x%04X    %-10s  %-17s  %5u  %7lu  %4d  %lus\n",
               pan->pan_id,
               zig_recon_proto_name(pan->proto),
               channels,
               pan->nodes,
               (unsigned long)pan->packets,
               pan->last_rssi,
               (unsigned long)age_s);
        printf("[ZIG] pan id=0x%04X kind=%s proto=%s confidence=%s channels=0x%08lx nodes=%u packets=%lu best_rssi=%d last_rssi=%d last_seen_ms=%lu age_ms=%lu\n",
               pan->pan_id,
               zig_recon_pan_kind(pan->pan_id),
               zig_recon_proto_token(pan->proto),
               zig_recon_confidence_token(pan->confidence),
               (unsigned long)pan->channel_mask,
               pan->nodes,
               (unsigned long)pan->packets,
               pan->best_rssi,
               pan->last_rssi,
               (unsigned long)pan->last_seen_ms,
               (unsigned long)age_ms);
        printed++;
    }
    if (!show_all && hidden > 0) {
        printf("... %u more hidden PANs/broadcast entries (use zig_recon_list all)\n", hidden);
    }
    printf("[ZIG] END\n");
    heap_caps_free(snap);
    return 0;
}

static int cmd_zig_recon_nodes(int argc, char **argv)
{
    if (argc != 2) {
        printf("Usage: zig_recon_nodes <pan_id|all>\n");
        return 1;
    }
    bool show_all = strcasecmp(argv[1], "all") == 0;
    uint16_t pan_id = 0;
    if (!show_all && !zig_recon_parse_u16(argv[1], &pan_id)) {
        printf("Usage: zig_recon_nodes <pan_id|all>\n");
        return 1;
    }

    zig_recon_snapshot_t *snap = zig_recon_alloc_snapshot();
    if (!snap) {
        printf("FAILED: no PSRAM for zig_recon_nodes snapshot\n");
        printf("[ZIG] END\n");
        return 1;
    }
    zig_recon_get_snapshot(snap);
    const zig_recon_pan_t *pan = NULL;
    if (!show_all) {
        for (uint16_t i = 0; i < snap->pan_count; i++) {
            if (snap->pans[i].pan_id == pan_id) {
                pan = &snap->pans[i];
                break;
            }
        }
        if (!pan) {
            printf("PAN 0x%04X not found\n", pan_id);
            printf("[ZIG] END\n");
            heap_caps_free(snap);
            return 1;
        }
    }

    if (show_all) {
        printf("All discovered 802.15.4 nodes\n");
    } else {
        char channels[64];
        zig_recon_format_channels(pan->channel_mask, channels, sizeof(channels));
        printf("PAN 0x%04X  Proto: %s  Channels: %s  Packets: %lu\n",
               pan_id, zig_recon_proto_name(pan->proto), channels, (unsigned long)pan->packets);
    }
    printf(show_all ? "PAN       ADDR    ROLE         PKTS  RSSI  LAST\n"
                    : "ADDR      ROLE         PKTS  RSSI  LAST\n");
    uint32_t now = (uint32_t)(esp_timer_get_time() / 1000ULL);
    for (uint16_t i = 0; i < snap->node_count; i++) {
        const zig_recon_node_t *node = &snap->nodes[i];
        if (!show_all && node->pan_id != pan_id) {
            continue;
        }
        uint32_t age_ms = node->last_seen_ms ? (now - node->last_seen_ms) : 0;
        uint32_t age_s = age_ms / 1000U;
        char ext[17];
        zig_recon_format_ext(node->ext_addr, ext, sizeof(ext));
        char short_text[8];
        char ext_text[19];
        if (node->has_short_addr) {
            snprintf(short_text, sizeof(short_text), "0x%04X", node->short_addr);
        } else {
            strlcpy(short_text, "na", sizeof(short_text));
        }
        if (node->has_ext_addr) {
            snprintf(ext_text, sizeof(ext_text), "0x%s", ext);
        } else {
            strlcpy(ext_text, "na", sizeof(ext_text));
        }
        char lqi_text[8];
        if (node->has_lqi) {
            snprintf(lqi_text, sizeof(lqi_text), "%u", node->last_lqi);
        } else {
            strlcpy(lqi_text, "na", sizeof(lqi_text));
        }
        char channel_text[8];
        if (node->last_channel >= ZIG_RECON_MIN_CHANNEL && node->last_channel <= ZIG_RECON_MAX_CHANNEL) {
            snprintf(channel_text, sizeof(channel_text), "%u", node->last_channel);
        } else {
            strlcpy(channel_text, "na", sizeof(channel_text));
        }
        if (show_all) {
            if (node->has_short_addr) {
                printf("0x%04X    0x%04X  %-11s  %4lu  %4d  %lus\n",
                       node->pan_id,
                       node->short_addr,
                       zig_recon_role_name(node->role),
                       (unsigned long)node->packets,
                       node->last_rssi,
                       (unsigned long)age_s);
            } else {
                printf("0x%04X    EXT     %-11s  %4lu  %4d  %lus\n",
                       node->pan_id,
                       zig_recon_role_name(node->role),
                       (unsigned long)node->packets,
                       node->last_rssi,
                       (unsigned long)age_s);
            }
        } else {
            if (node->has_short_addr) {
                printf("0x%04X    %-11s  %4lu  %4d  %lus\n",
                       node->short_addr,
                       zig_recon_role_name(node->role),
                       (unsigned long)node->packets,
                       node->last_rssi,
                       (unsigned long)age_s);
            } else {
                printf("EXT       %-11s  %4lu  %4d  %lus\n",
                       zig_recon_role_name(node->role),
                       (unsigned long)node->packets,
                       node->last_rssi,
                       (unsigned long)age_s);
            }
        }
        printf("[ZIG] node pan=0x%04X addr_type=%s short=%s ext=%s role=%s packets=%lu last_rssi=%d best_rssi=%d avg_rssi=%d lqi=%s sample_count=%lu last_channel=%s vendor=na device_hint=na battery=na last_seen_ms=%lu age_ms=%lu\n",
               node->pan_id,
               node->has_short_addr ? "short" : (node->has_ext_addr ? "ext" : "unknown"),
               short_text,
               ext_text,
               zig_recon_role_token(node->role),
               (unsigned long)node->packets,
               node->last_rssi,
               node->best_rssi,
               node->avg_rssi,
               lqi_text,
               (unsigned long)node->sample_count,
               channel_text,
               (unsigned long)node->last_seen_ms,
               (unsigned long)age_ms);
    }
    printf("[ZIG] END\n");
    heap_caps_free(snap);
    return 0;
}

