brokali/projectZeroTouch/ESP32C5/main/main.c
static int cmd_zig_recon_clear(int argc, char **argv)
{
    (void)argc; (void)argv;
    zig_recon_clear();
    printf("[ZIG] cleared\n");
    printf("[ZIG] END\n");
    return 0;
}

static bool parse_ipv4_arg(const char *arg, esp_ip4_addr_t *out) {
    if (!arg || !out) {
        return false;
    }
    ip4_addr_t tmp = { 0 };
    if (ip4addr_aton(arg, &tmp) == 0) {
        return false;
    }
    out->addr = tmp.addr;
    return true;
}

static bool line_ends_with_space(const char *line) {
    if (!line) {
        return false;
    }
    size_t len = strlen(line);
    if (len == 0) {
        return false;
    }
    char last = line[len - 1];
    return last == ' ' || last == '\t';
}

typedef struct {
    const char *command;
    const char *hint;
} cli_hint_t;

static const cli_hint_t k_cli_hints[] = {
    { "packet_monitor", " <channel>" },
    { "start_ap_locator", "" },
    { "deauth_detector", " [index1 index2 ...]" },
    { "select_networks", " <index1> [index2] ..." },
    { "select_stations", " <MAC1> [MAC2] ..." },
    { "sniffer_debug", " <0|1>" },
    { "start_gps_raw", " [baud]" },
    { "gps_set", " <m5|atgm|external|cap>" },
    { "set_gps_position", " <lat> <lon> [alt] [acc]" },
    { "set_gps_position_cap", " <lat> <lon> [alt] [acc]" },
    { "start_portal", " <SSID>" },
    { "start_admin_portal", " <password>" },
    { "start_karma", " <index>" },
    { "start_nmap", " [quick|medium|heavy] [IP]" },
    { "start_zig_recon", " [all|11,15,20] [dwell_ms]" },
    { "zig_recon_nodes", " <pan_id|all>" },
    { "vendor", " set <on|off> | read" },
    { "boot_button", " read|list|set <short|long> <command[, command...]> | status <short|long> <on|off>" },
    { "led", " set <on|off> | level <1-100> | read" },
    { "channel_time", " set <min|max> <ms> | read <min|max>" },
    { "wifi_connect", " <SSID> [Password|--saved] [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]" },
    { "capture_gateway", " start <capture_ssid> [capture_password] [--pcap-name <name>] | status | stop" },
    { "start_rogue_gitm", " <SSID> <password> [--pcap-name <name>]" },
    { "sd_benchmark", " [size_mb]" },
    { "start_pcap", " radio|net|gateway" },
    { "ota_channel", " [main|dev]" },
    { "ota_boot", " <ota_0|ota_1>" },
    { "arp_ban", " <MAC> [IP]" },
    { "show_pass", " [portal|evil]" },
    { "list_dir", " [path] [-s]" },
    { "send_file", " <path> [offset] [bsize]" },
    { "uart_baud", " <115200|230400|460800|921600|1000000|1500000|2000000|3000000|4000000>" },
    { "uart_baud_confirm", "" },
    { "uart_baud_status", "" },
    { "file_delete", " <path> [path2 ...]" },
    { "select_html", " <index>" },
    { "set_html", " <html>" },
    { "wpasec_key", " set <key> | read" },
    { "wpasec_upload", "" },
    { "wigle_key", " set <api_name> <api_token> | read | clear" },
    { "wigle_upload", " [file1 file2 ...]" },
    { "wdgwars_key", " set <key> | read | clear" },
    { "wdgwars_upload", " [file1 file2 ...]" },
    { "upload_state", "" },
    { "wardrive_files", "" },
    { "wardrive_cleanup", " <wigle|wdgwars|all> <pending|done|ok|failed|fail|rate_limited> [move [destination]]" },
    { "wardrive_fix", " <file>" },
    { "add_ssid", " <SSID>" },
    { "remove_ssid", " <index>" },
};

static const char *lookup_cli_hint(const char *command) {
    if (!command) {
        return NULL;
    }
    for (size_t i = 0; i < (sizeof(k_cli_hints) / sizeof(k_cli_hints[0])); i++) {
        if (strcmp(k_cli_hints[i].command, command) == 0) {
            return k_cli_hints[i].hint;
        }
    }
    return NULL;
}

static const char *wifi_connect_dynamic_hint(const char *buf, int *color, int *bold) {
    static const char *hint_ssid = " <SSID> [Password|--saved] [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]";
    static const char *hint_pass = " [Password|--saved] [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]";
    static const char *hint_optional = " [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]";
    static const char *hint_ip_optional = " [<IP> <Netmask> <GW> [DNS1] [DNS2]]";
    static const char *hint_mask = " <Netmask> <GW> [DNS1] [DNS2]";
    static const char *hint_gw = " <GW> [DNS1] [DNS2]";
    static const char *hint_dns1 = " [DNS1] [DNS2]";
    static const char *hint_dns2 = " [DNS2]";

    if (!buf) {
        return NULL;
    }
    if (color) {
        *color = 39;
    }
    if (bold) {
        *bold = 0;
    }

    char line[128];
    size_t len = strnlen(buf, sizeof(line) - 1);
    memcpy(line, buf, len);
    line[len] = '\0';

    char *argv[10];
    size_t argc = esp_console_split_argv(line, argv, sizeof(argv) / sizeof(argv[0]));
    if (argc == 0) {
        return NULL;
    }
    if (strcmp(argv[0], "wifi_connect") != 0) {
        return NULL;
    }

    if (argc == 1) {
        return hint_ssid;
    }

    if (!line_ends_with_space(buf)) {
        return NULL;
    }

    if (argc == 2) {
        return hint_pass;
    }
    if (argc == 3) {
        return hint_optional;
    }

    bool has_ota = (strcasecmp(argv[3], "ota") == 0);
    int ip_start = has_ota ? 4 : 3;
    int ip_args = (int)argc - ip_start;

    if (ip_args <= 0) {
        return hint_ip_optional;
    }
    if (ip_args == 1) {
        return hint_mask;
    }
    if (ip_args == 2) {
        return hint_gw;
    }
    if (ip_args == 3) {
        return hint_dns1;
    }
    if (ip_args == 4) {
        return hint_dns2;
    }

    return NULL;
}

static const char *generic_cli_hint(const char *buf, int *color, int *bold) {
    if (!buf) {
        return NULL;
    }

    char line[128];
    size_t len = strnlen(buf, sizeof(line) - 1);
    memcpy(line, buf, len);
    line[len] = '\0';

    char *argv[10];
    size_t argc = esp_console_split_argv(line, argv, sizeof(argv) / sizeof(argv[0]));
    if (argc == 0) {
        return NULL;
    }

    if (strcmp(argv[0], "wifi_connect") == 0) {
        return NULL;
    }

    if (argc != 1 && !line_ends_with_space(buf)) {
        return NULL;
    }

    const char *hint = esp_console_get_hint(argv[0], color, bold);
    if (hint) {
        return hint;
    }

    hint = lookup_cli_hint(argv[0]);
    if (hint && hint[0] != '\0') {
        if (color) {
            *color = 39;
        }
        if (bold) {
            *bold = 0;
        }
        return hint;
    }

