brokali/projectZeroTouch/ESP32C5/main/main.c
    return NULL;
}

static char *janos_console_hint(const char *buf, int *color, int *bold) {
    const char *hint = wifi_connect_dynamic_hint(buf, color, bold);
    if (hint != NULL) {
        return (char *)hint;
    }
    hint = generic_cli_hint(buf, color, bold);
    if (hint != NULL) {
        return (char *)hint;
    }
    return (char *)esp_console_get_hint(buf, color, bold);
}

static bool wait_for_sta_ip_info(esp_netif_ip_info_t *out_info, int timeout_ms) {
    if (!out_info) {
        return false;
    }

    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        return false;
    }

    if (esp_netif_get_ip_info(sta_netif, out_info) == ESP_OK && out_info->ip.addr != 0) {
        return true;
    }

    int loops = timeout_ms / 100;
    for (int i = 0; i < loops; i++) {
        vTaskDelay(pdMS_TO_TICKS(100));
        if (esp_netif_get_ip_info(sta_netif, out_info) == ESP_OK && out_info->ip.addr != 0) {
            return true;
        }
    }

    return false;
}

static int cmd_wifi_disconnect(int argc, char **argv) {
    if (argc != 1) {
        MY_LOG_INFO(TAG, "Usage: wifi_disconnect");
        return 0;
    }

    if (capture_gateway_is_active()) {
        MY_LOG_INFO(TAG, "Capture Gateway is active. Use 'capture_gateway stop' or 'stop' first.");
        return 1;
    }

    if (current_radio_mode != RADIO_MODE_WIFI || !wifi_initialized) {
        MY_LOG_INFO(TAG, "WiFi not initialized");
        return 0;
    }

    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Not connected to any AP.");
        return 0;
    }

    MY_LOG_INFO(TAG, "Disconnecting from AP '%s'...", ap_info.ssid);
    esp_wifi_disconnect();
    return 0;
}

static bool csv_get_quoted_field(const char *line, int wanted_idx, char *out, size_t out_sz) {
    if (!line || !out || out_sz == 0 || wanted_idx < 0) {
        return false;
    }

    int idx = 0;
    const char *p = line;
    while (*p) {
        while (*p && *p != '"') {
            p++;
        }
        if (*p != '"') {
            return false;
        }
        p++;

        char tmp[128];
        size_t pos = 0;
        while (*p) {
            if (*p == '"') {
                if (p[1] == '"') {
                    if (pos < sizeof(tmp) - 1) {
                        tmp[pos++] = '"';
                    }
                    p += 2;
                    continue;
                }
                p++;
                break;
            }
            if (pos < sizeof(tmp) - 1) {
                tmp[pos++] = *p;
            }
            p++;
        }
        tmp[pos] = '\0';

        if (idx == wanted_idx) {
            snprintf(out, out_sz, "%s", tmp);
            return true;
        }
        idx++;
    }
    return false;
}

static bool wifi_lookup_eviltwin_password(const char *ssid, char *out, size_t out_sz) {
    FILE *file = fopen("/sdcard/lab/eviltwin.txt", "r");
    if (!file) {
        return false;
    }

    bool found = false;
    char line[256];
    while (fgets(line, sizeof(line), file)) {
        char saved_ssid[64];
        char saved_pass[96];
        if (csv_get_quoted_field(line, 0, saved_ssid, sizeof(saved_ssid)) &&
            csv_get_quoted_field(line, 1, saved_pass, sizeof(saved_pass)) &&
            strcmp(saved_ssid, ssid) == 0 && saved_pass[0] != '\0') {
            snprintf(out, out_sz, "%s", saved_pass);
            found = true;
        }
    }
    fclose(file);
    return found;
}

static bool wifi_lookup_portal_password(const char *ssid, char *out, size_t out_sz) {
    FILE *file = fopen("/sdcard/lab/portals.txt", "r");
    if (!file) {
        return false;
    }

    bool found = false;
    char line[384];
    while (fgets(line, sizeof(line), file)) {
        char saved_ssid[64];
        if (!csv_get_quoted_field(line, 0, saved_ssid, sizeof(saved_ssid)) ||
            strcmp(saved_ssid, ssid) != 0) {
            continue;
        }

        for (int i = 1; i < 12; i++) {
            char field[128];
            if (!csv_get_quoted_field(line, i, field, sizeof(field))) {
                break;
            }
            char *eq = strchr(field, '=');
            if (!eq) {
                continue;
            }
            *eq = '\0';
            const char *key = field;
            const char *val = eq + 1;
            if ((strcasecmp(key, "password") == 0 ||
                 strcasecmp(key, "pass") == 0 ||
                 strcasecmp(key, "wifi_password") == 0) &&
                val[0] != '\0') {
                snprintf(out, out_sz, "%s", val);
                found = true;
            }
        }
    }
    fclose(file);
    return found;
}

static bool wifi_lookup_home_password(const char *ssid, char *out, size_t out_sz) {
    FILE *file = fopen(HOME_FILE_PATH, "r");
    if (!file) {
        return false;
    }

    bool found = false;
    char line[256];
    while (fgets(line, sizeof(line), file)) {
        char saved_ssid[64];
        char saved_pass[96];
        if (csv_get_quoted_field(line, 0, saved_ssid, sizeof(saved_ssid)) &&
            csv_get_quoted_field(line, 1, saved_pass, sizeof(saved_pass)) &&
            strcmp(saved_ssid, ssid) == 0 && saved_pass[0] != '\0') {
            snprintf(out, out_sz, "%s", saved_pass);
            found = true;
        }
    }
    fclose(file);
    return found;
}

static bool wifi_lookup_known_password(const char *ssid, char *out, size_t out_sz) {
    if (!ssid || !out || out_sz == 0) {
        return false;
    }
    out[0] = '\0';

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        return false;
    }

    if (wifi_lookup_eviltwin_password(ssid, out, out_sz)) {
        MY_LOG_INFO(TAG, "wifi_connect: using saved password from eviltwin.txt for '%s'", ssid);
        return true;
    }
    if (wifi_lookup_portal_password(ssid, out, out_sz)) {
        MY_LOG_INFO(TAG, "wifi_connect: using saved password from portals.txt for '%s'", ssid);
        return true;
    }
    if (wifi_lookup_home_password(ssid, out, out_sz)) {
        MY_LOG_INFO(TAG, "wifi_connect: using saved password from home.txt for '%s'", ssid);
        return true;
    }
    return false;
}

static bool wifi_already_connected_to_ssid(const char *ssid, esp_netif_ip_info_t *ip_info)
{
    if (!ssid || current_radio_mode != RADIO_MODE_WIFI || !wifi_initialized) {
        return false;
    }

    wifi_ap_record_t ap_info = {0};
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        return false;
    }
    if (strcmp((const char *)ap_info.ssid, ssid) != 0) {
        return false;
    }

    esp_netif_ip_info_t current_ip = {0};
    if (!wait_for_sta_ip_info(&current_ip, 1000)) {
        return false;
    }
    if (ip_info) {
        *ip_info = current_ip;
    }
    return true;
}

