brokali/projectZeroTouch/ESP32C5/main/main.c
static int cmd_wifi_connect(int argc, char **argv) {
    oled_display_update_full("> WiFi Connect",
        argc >= 2 ? argv[1] : "  No SSID",
        "  STA Mode", "  Connecting...");
    if (argc < 2 || argc > 9) {
        MY_LOG_INFO(TAG, "Usage: wifi_connect <SSID> [Password|--saved] [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]");
        return 0;
    }

    if (capture_gateway_is_active()) {
        MY_LOG_INFO(TAG, "Capture Gateway is active. Use 'capture_gateway stop' or 'stop' first.");
        return 1;
    }
    
    const char *ssid = argv[1];
    char saved_password[65] = "";
    bool use_saved_password = (argc >= 3 && strcasecmp(argv[2], "--saved") == 0);
    bool explicit_password = (argc >= 3 && !use_saved_password && strcasecmp(argv[2], "ota") != 0);
    const char *password = explicit_password ? argv[2] : "";
    bool ota_after_connect = false;
    bool use_static_ip = false;
    esp_ip4_addr_t static_ip = { 0 };
    esp_ip4_addr_t static_mask = { 0 };
    esp_ip4_addr_t static_gw = { 0 };
    bool use_dns1 = false;
    bool use_dns2 = false;
    esp_ip4_addr_t static_dns1 = { 0 };
    esp_ip4_addr_t static_dns2 = { 0 };

    if (use_saved_password) {
        wifi_lookup_known_password(ssid, saved_password, sizeof(saved_password));
        if (saved_password[0] != '\0') {
            password = saved_password;
        } else {
            MY_LOG_INFO(TAG, "wifi_connect: no saved password found for '%s'", ssid);
        }
    }

    int argi = (explicit_password || use_saved_password) ? 3 : 2;
    if (argc > argi && strcasecmp(argv[argi], "ota") == 0) {
        ota_after_connect = true;
        argi++;
    }

    int remaining = argc - argi;
    if (remaining != 0 && remaining != 3 && remaining != 4 && remaining != 5) {
        MY_LOG_INFO(TAG, "Usage: wifi_connect <SSID> [Password|--saved] [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]");
        return 0;
    }
    if (remaining >= 3) {
        if (!parse_ipv4_arg(argv[argi], &static_ip) ||
            !parse_ipv4_arg(argv[argi + 1], &static_mask) ||
            !parse_ipv4_arg(argv[argi + 2], &static_gw)) {
            MY_LOG_INFO(TAG, "Invalid IP/netmask/gateway. Example: 192.168.1.10 255.255.255.0 192.168.1.1");
            return 0;
        }
        use_static_ip = true;
    }
    if (remaining >= 4) {
        if (!parse_ipv4_arg(argv[argi + 3], &static_dns1)) {
            MY_LOG_INFO(TAG, "Invalid DNS1. Example: 8.8.8.8");
            return 0;
        }
        use_dns1 = true;
    }
    if (remaining == 5) {
        if (!parse_ipv4_arg(argv[argi + 4], &static_dns2)) {
            MY_LOG_INFO(TAG, "Invalid DNS2. Example: 1.1.1.1");
            return 0;
        }
        use_dns2 = true;
    }
    
    MY_LOG_INFO(TAG, "Connecting to AP '%s'...", ssid);
    if (password[0] != '\0') {
        MY_LOG_INFO(TAG, "wifi_connect: password source=%s", explicit_password ? "argument" : "saved");
    } else if (use_saved_password) {
        MY_LOG_INFO(TAG, "wifi_connect: saved password requested but missing, trying open network");
    } else {
        MY_LOG_INFO(TAG, "wifi_connect: trying open network");
    }

    esp_netif_ip_info_t existing_ip = {0};
    if (!use_static_ip && wifi_already_connected_to_ssid(ssid, &existing_ip)) {
        MY_LOG_INFO(TAG, "Wi-Fi: already connected to SSID='%s'", ssid);
        MY_LOG_INFO(TAG, "SUCCESS: Connected to '%s'", ssid);
        MY_LOG_INFO(TAG, "DHCP IP: " IPSTR ", Netmask: " IPSTR ", GW: " IPSTR,
                    IP2STR(&existing_ip.ip), IP2STR(&existing_ip.netmask), IP2STR(&existing_ip.gw));
        if (ota_after_connect && !ota_start_check(NULL, false)) {
            return 0;
        }
        return 0;
    }
    
    // Reset WiFi (same as mode switching)
    esp_wifi_disconnect();
    esp_wifi_stop();
    esp_wifi_deinit();
    
    // Destroy AP netif if exists
    esp_netif_t *ap_netif = esp_netif_get_handle_from_ifkey("WIFI_AP_DEF");
    if (ap_netif) {
        esp_netif_destroy(ap_netif);
    }
    ap_netif_handle = NULL;
    
    wifi_initialized = false;
    current_radio_mode = RADIO_MODE_NONE;
    
    // Reinitialize WiFi
    if (!ensure_wifi_mode()) {
        MY_LOG_INFO(TAG, "Failed to reinitialize WiFi");
        return 0;
    }
    
    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        MY_LOG_INFO(TAG, "STA interface not found");
        return 0;
    }

    if (use_static_ip) {
        esp_netif_dhcpc_stop(sta_netif);
        esp_netif_ip_info_t ip_info = { 0 };
        ip_info.ip = static_ip;
        ip_info.netmask = static_mask;
        ip_info.gw = static_gw;
        esp_err_t ret = esp_netif_set_ip_info(sta_netif, &ip_info);
        if (ret != ESP_OK) {
            MY_LOG_INFO(TAG, "Failed to set static IP: %s", esp_err_to_name(ret));
            return 0;
        }
        if (use_dns1) {
            esp_netif_dns_info_t dns = { 0 };
            dns.ip.u_addr.ip4 = static_dns1;
            dns.ip.type = IPADDR_TYPE_V4;
            ret = esp_netif_set_dns_info(sta_netif, ESP_NETIF_DNS_MAIN, &dns);
            if (ret != ESP_OK) {
                MY_LOG_INFO(TAG, "Failed to set DNS1: %s", esp_err_to_name(ret));
            }
        }
        if (use_dns2) {
            esp_netif_dns_info_t dns = { 0 };
            dns.ip.u_addr.ip4 = static_dns2;
            dns.ip.type = IPADDR_TYPE_V4;
            ret = esp_netif_set_dns_info(sta_netif, ESP_NETIF_DNS_BACKUP, &dns);
            if (ret != ESP_OK) {
                MY_LOG_INFO(TAG, "Failed to set DNS2: %s", esp_err_to_name(ret));
            }
        }
    } else {
        esp_netif_dhcpc_start(sta_netif);
    }

    // Configure STA and connect
    wifi_config_t sta_config = { 0 };
    strncpy((char *)sta_config.sta.ssid, ssid, sizeof(sta_config.sta.ssid) - 1);
    if (password[0] != '\0') {
        strncpy((char *)sta_config.sta.password, password, sizeof(sta_config.sta.password) - 1);
        sta_config.sta.threshold.authmode = WIFI_AUTH_WPA2_PSK;
    } else {
        // Open path. Also cover OWE (Enhanced Open) APs, e.g. modern Android
        // hotspots, which advertise no password but require the OWE handshake +
        // PMF. Threshold stays OPEN so plain-open APs still pass; owe_enabled is
        // opt-in capability so plain-open association is unaffected.
        sta_config.sta.threshold.authmode = WIFI_AUTH_OPEN;
        sta_config.sta.owe_enabled = true;
        sta_config.sta.pmf_cfg.capable = true;
    }

    esp_wifi_set_config(WIFI_IF_STA, &sta_config);

    // Reset result flag before connecting
    wifi_connect_result = 0;
    wifi_connect_fail_reason = 0;
    esp_wifi_connect();
    
    MY_LOG_INFO(TAG, "Waiting for connection result...");
    
    // Wait for connection result (max 15 seconds)
    for (int i = 0; i < 150 && wifi_connect_result == 0; i++) {
        vTaskDelay(pdMS_TO_TICKS(100));
    }
    
    if (wifi_connect_result == 1) {
        esp_netif_ip_info_t ip_info = { 0 };
        bool has_ip = wait_for_sta_ip_info(&ip_info, 5000);
        MY_LOG_INFO(TAG, "SUCCESS: Connected to '%s'", ssid);
        if (password[0] != '\0') {
            save_evil_twin_password(ssid, password);
        }
        if (has_ip) {
            if (use_static_ip) {
                MY_LOG_INFO(TAG, "Static IP: " IPSTR ", Netmask: " IPSTR ", GW: " IPSTR,
                            IP2STR(&ip_info.ip), IP2STR(&ip_info.netmask), IP2STR(&ip_info.gw));
                if (use_dns1) {
                    MY_LOG_INFO(TAG, "DNS1: " IPSTR, IP2STR(&static_dns1));
                }
                if (use_dns2) {
                    MY_LOG_INFO(TAG, "DNS2: " IPSTR, IP2STR(&static_dns2));
                }
            } else {
                MY_LOG_INFO(TAG, "DHCP IP: " IPSTR ", Netmask: " IPSTR ", GW: " IPSTR,
                            IP2STR(&ip_info.ip), IP2STR(&ip_info.netmask), IP2STR(&ip_info.gw));
            }
        } else {
            MY_LOG_INFO(TAG, "No IP assigned yet. Wait for DHCP.");
        }
        if (ota_after_connect) {
            if (!has_ip) {
                MY_LOG_INFO(TAG, "OTA: no IP yet. Wait for DHCP.");
                return 0;
            }
            if (!ota_start_check(NULL, false)) {
                return 0;
            }
        }
        return 0;
    } else if (wifi_connect_result == -1) {
        MY_LOG_INFO(TAG, "FAILED: Connection to '%s' failed (reason=%d). Check SSID/password and signal.",
                    ssid, wifi_connect_fail_reason);
        return 0;
    } else {
        MY_LOG_INFO(TAG, "TIMEOUT: Connection to '%s' timed out", ssid);
        return 0;
    }
}

