brokali/projectZeroTouch/ESP32C5/main/main.c
static bool capture_gateway_wait_for_upstream(int timeout_ms,
                                              wifi_ap_record_t *ap_info,
                                              esp_netif_ip_info_t *ip_info)
{
    int loops = timeout_ms / 100;
    for (int i = 0; i <= loops; i++) {
        wifi_ap_record_t current_ap = {0};
        esp_netif_ip_info_t current_ip = {0};
        esp_netif_t *sta = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        if (sta != NULL &&
            esp_wifi_sta_get_ap_info(&current_ap) == ESP_OK &&
            esp_netif_get_ip_info(sta, &current_ip) == ESP_OK &&
            current_ip.ip.addr != 0) {
            if (ap_info != NULL) {
                *ap_info = current_ap;
            }
            if (ip_info != NULL) {
                *ip_info = current_ip;
            }
            return true;
        }
        if (i < loops) {
            vTaskDelay(pdMS_TO_TICKS(100));
        }
    }
    return false;
}

static void capture_gateway_print_status(void)
{
    capture_gateway_status_t status;
    capture_gateway_get_status(&status);
    if (!status.active) {
        MY_LOG_INFO(TAG, "Capture Gateway: idle");
        printf("[CGW] status active=0\n");
        printf("[CGW] END\n");
        return;
    }

    MY_LOG_INFO(TAG, "Capture Gateway: active SSID='%s' security=%s clients=%u channel=%u upstream=%s NAPT=%s",
                status.ssid,
                status.open_network ? "open" : "wpa2",
                status.connected_clients,
                status.channel,
                status.upstream_ready ? "up" : "down",
                status.napt_enabled ? "on" : "off");
    MY_LOG_INFO(TAG, "Capture Gateway: AP=" IPSTR " STA=" IPSTR " DNS=" IPSTR
                " (proxy=%s upstream_dns=" IPSTR ")",
                IP2STR(&status.downstream_ip.ip),
                IP2STR(&status.upstream_ip.ip),
                IP2STR(&status.advertised_dns.ip.u_addr.ip4),
                status.dns_proxy ? "on" : "off",
                IP2STR(&status.upstream_dns.ip.u_addr.ip4));
    printf("[CGW] status active=1 upstream=%d napt=%d clients=%u channel=%u\n",
           status.upstream_ready ? 1 : 0,
           status.napt_enabled ? 1 : 0,
           status.connected_clients,
           status.channel);
    printf("[CGW] ssid=%s security=%s upstream_ssid=%s\n",
           status.ssid, status.open_network ? "open" : "wpa2",
           status.upstream_ssid);
    printf("[CGW] ap_ip=" IPSTR " sta_ip=" IPSTR " dns=" IPSTR
           " dns_proxy=%s upstream_dns=" IPSTR "\n",
           IP2STR(&status.downstream_ip.ip),
           IP2STR(&status.upstream_ip.ip),
           IP2STR(&status.advertised_dns.ip.u_addr.ip4),
           status.dns_proxy ? "on" : "off",
           IP2STR(&status.upstream_dns.ip.u_addr.ip4));

    bool gateway_capture_active = pcap_capture_active &&
                                  pcap_capture_mode == PCAP_MODE_GATEWAY;
    pcap_stats_snapshot_t capture_stats = {0};
    pcap_stats_snapshot(&capture_stats);
    UBaseType_t rate_queue_depth = pcap_rate_packet_queue != NULL
                                      ? uxQueueMessagesWaiting(pcap_rate_packet_queue)
                                      : 0;
    MY_LOG_INFO(TAG, "Capture Gateway PCAP: packets=%lu drops=%lu size=%" PRIu64 " bytes queue=%lu/%d",
                (unsigned long)capture_stats.packets,
                (unsigned long)capture_stats.drops,
                capture_stats.file_bytes,
                (unsigned long)capture_stats.queue_depth,
                PCAP_PACKET_QUEUE_LENGTH);
    printf("[CGW] capture=%s file=%s packets=%lu frames=%lu drops=%lu file_bytes=%" PRIu64 "\n",
           gateway_capture_active ? "active" : "inactive",
           gateway_capture_active ? pcap_capture_filepath : "-",
           (unsigned long)capture_stats.packets,
           (unsigned long)capture_stats.packets,
           (unsigned long)capture_stats.drops,
           capture_stats.file_bytes);
    printf("[CGW] recorder drop_alloc=%lu drop_queue=%lu drop_write=%lu queue_depth=%lu queue_capacity=%d queue_high_water=%lu\n",
           (unsigned long)capture_stats.drop_alloc,
           (unsigned long)capture_stats.drop_queue,
           (unsigned long)capture_stats.drop_write,
           (unsigned long)capture_stats.queue_depth,
           PCAP_PACKET_QUEUE_LENGTH,
           (unsigned long)capture_stats.queue_high_water);
    printf("[CGW] rate_limit_kbps=%lu rate_effective_kbps=%lu adaptive=%s throttle_events=%lu pause_events=%lu rate_queue_depth=%lu rate_queue_capacity=%d rate_queue_drops=%lu rate_queue_high_water=%lu\n",
           (unsigned long)PCAP_GATEWAY_RATE_LIMIT_KBPS,
           (unsigned long)capture_stats.rate_effective_kbps,
           "on",
           (unsigned long)capture_stats.rate_throttle_events,
           (unsigned long)capture_stats.rate_pause_events,
           (unsigned long)rate_queue_depth,
           PCAP_RATE_QUEUE_LENGTH,
           (unsigned long)capture_stats.rate_queue_drops,
           (unsigned long)capture_stats.rate_queue_high_water);
    printf("[CGW] pcap_scope=softap_10_42 filter_drops=%lu\n",
           (unsigned long)capture_stats.gateway_filtered);
    printf("[CGW] client_isolation=off\n");

    wifi_sta_list_t wifi_clients = {0};
    wifi_sta_mac_ip_list_t ip_clients = {0};
    esp_err_t clients_err = esp_wifi_ap_get_sta_list(&wifi_clients);
    if (clients_err == ESP_OK) {
        clients_err = esp_wifi_ap_get_sta_list_with_ip(&wifi_clients, &ip_clients);
    }
    if (clients_err == ESP_OK) {
        for (int i = 0; i < ip_clients.num; i++) {
            printf("[CGW_CLIENT] mac=%02X:%02X:%02X:%02X:%02X:%02X ip=" IPSTR "\n",
                   ip_clients.sta[i].mac[0], ip_clients.sta[i].mac[1],
                   ip_clients.sta[i].mac[2], ip_clients.sta[i].mac[3],
                   ip_clients.sta[i].mac[4], ip_clients.sta[i].mac[5],
                   IP2STR(&ip_clients.sta[i].ip));
        }
    } else {
        printf("[CGW] client_inventory_error=%s\n", esp_err_to_name(clients_err));
    }
    printf("[CGW] END\n");
}

/**
 * Start Capture Gateway SoftAP/NAPT and arm gateway PCAP.
 * @param password empty string creates an open SoftAP; otherwise WPA2-PSK.
 * @param normalized_pcap_name empty for automatic sniff_N.pcap naming.
 * @param oled_title short OLED header (e.g. "> Capture GW").
 * @return 0 on success.
 */
static int capture_gateway_start_session(const char *ssid,
                                         const char *password,
                                         const char *normalized_pcap_name,
                                         const char *oled_title)
{
    if (ssid == NULL || password == NULL) {
        return 1;
    }
    if (capture_gateway_is_active()) {
        MY_LOG_INFO(TAG, "Capture Gateway is already active");
        capture_gateway_print_status();
        return 1;
    }

    size_t ssid_len = strlen(ssid);
    size_t password_len = strlen(password);
    if (ssid_len == 0 || ssid_len > CAPTURE_GATEWAY_SSID_MAX_LEN ||
        (password_len > 0 &&
         (password_len < CAPTURE_GATEWAY_PASSWORD_MIN_LEN ||
          password_len > CAPTURE_GATEWAY_PASSWORD_MAX_LEN))) {
        MY_LOG_INFO(TAG, "Capture SSID must be 1-32 bytes; optional password must be 8-63 bytes");
        return 1;
    }

    char busy[32] = {0};
    if (zig_recon_radio_busy(busy, sizeof(busy))) {
        MY_LOG_INFO(TAG, "Cannot start Capture Gateway: radio busy (%s). Use 'stop' first.", busy);
        return 1;
    }
    if (current_radio_mode != RADIO_MODE_WIFI || !wifi_initialized) {
        MY_LOG_INFO(TAG, "WiFi is not initialized. Use 'wifi_connect' first.");
        return 1;
    }

