brokali/projectZeroTouch/ESP32C5/main/main.c
    wifi_ap_record_t upstream_ap = {0};
    esp_netif_ip_info_t upstream_ip = {0};
    if (!capture_gateway_wait_for_upstream(0, &upstream_ap, &upstream_ip)) {
        MY_LOG_INFO(TAG, "No upstream IPv4 connection. Use 'wifi_connect' first.");
        return 1;
    }

    esp_netif_t *ap_netif = ensure_ap_mode();
    if (ap_netif == NULL) {
        MY_LOG_INFO(TAG, "Failed to enable APSTA mode");
        return 1;
    }

    if (!capture_gateway_wait_for_upstream(500, &upstream_ap, &upstream_ip)) {
        esp_err_t connect_err = esp_wifi_connect();
        if (connect_err != ESP_OK) {
            MY_LOG_INFO(TAG, "Capture Gateway: STA reconnect request: %s",
                        esp_err_to_name(connect_err));
        }
        if (!capture_gateway_wait_for_upstream(15000, &upstream_ap, &upstream_ip)) {
            esp_wifi_set_mode(WIFI_MODE_STA);
            MY_LOG_INFO(TAG, "Capture Gateway: upstream did not recover after APSTA switch");
            return 1;
        }
    }

    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (sta_netif == NULL) {
        esp_wifi_set_mode(WIFI_MODE_STA);
        MY_LOG_INFO(TAG, "Capture Gateway: STA netif not found");
        return 1;
    }

    capture_gateway_config_t config = {
        .ssid = ssid,
        .password = password,
        .channel = upstream_ap.primary,
        .max_clients = CAPTURE_GATEWAY_DEFAULT_MAX_CLIENTS,
    };
    esp_err_t err = capture_gateway_start(ap_netif, sta_netif, &config);
    if (err != ESP_OK) {
        esp_wifi_set_mode(WIFI_MODE_STA);
        MY_LOG_INFO(TAG, "Capture Gateway start failed: %s", esp_err_to_name(err));
        return 1;
    }

    operation_stop_requested = false;
    if (normalized_pcap_name != NULL && normalized_pcap_name[0] != '\0') {
        strlcpy(pcap_next_basename, normalized_pcap_name, sizeof(pcap_next_basename));
    } else {
        pcap_next_basename[0] = '\0';
    }
    char *pcap_argv[] = {"start_pcap", "gateway"};
    if (cmd_start_pcap(2, pcap_argv) != 0) {
        esp_err_t rollback_err = capture_gateway_stop();
        esp_err_t mode_err = esp_wifi_set_mode(WIFI_MODE_STA);
        MY_LOG_INFO(TAG, "Capture Gateway: recorder failed to arm; gateway rolled back");
        if (rollback_err != ESP_OK) {
            MY_LOG_INFO(TAG, "Capture Gateway rollback warning: %s",
                        esp_err_to_name(rollback_err));
        }
        if (mode_err != ESP_OK) {
            MY_LOG_INFO(TAG, "Capture Gateway STA mode rollback warning: %s",
                        esp_err_to_name(mode_err));
        }
        return 1;
    }

    oled_display_update_full(oled_title != NULL ? oled_title : "> Capture GW",
                             ssid, "  APSTA + NAPT", "  PCAP armed");
    MY_LOG_INFO(TAG,
                "Capture Gateway ready and recording. Any authorized client joining '%s' is captured.",
                ssid);
    capture_gateway_print_status();
    return 0;
}

static int cmd_capture_gateway(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: capture_gateway start <capture_ssid> [capture_password] [--pcap-name <name>] | status | stop");
        return 1;
    }

    if (strcasecmp(argv[1], "status") == 0) {
        if (argc != 2) {
            MY_LOG_INFO(TAG, "Usage: capture_gateway status");
            return 1;
        }
        capture_gateway_print_status();
        return 0;
    }

    if (strcasecmp(argv[1], "stop") == 0) {
        if (argc != 2) {
            MY_LOG_INFO(TAG, "Usage: capture_gateway stop");
            return 1;
        }
        if (!capture_gateway_is_active()) {
            MY_LOG_INFO(TAG, "Capture Gateway is not active");
            return 0;
        }
        if (pcap_capture_active && pcap_capture_mode == PCAP_MODE_GATEWAY) {
            MY_LOG_INFO(TAG, "Gateway PCAP is active. Use 'stop' so the writer and hooks are finalized first.");
            return 1;
        }

        esp_err_t err = capture_gateway_stop();
        esp_err_t mode_err = esp_wifi_set_mode(WIFI_MODE_STA);
        if (err != ESP_OK) {
            MY_LOG_INFO(TAG, "Capture Gateway stop warning: %s", esp_err_to_name(err));
        }
        if (mode_err != ESP_OK) {
            MY_LOG_INFO(TAG, "Failed to return WiFi to STA mode: %s", esp_err_to_name(mode_err));
            return 1;
        }
        rogue_gitm_mode_active = false;
        oled_display_update_full("> Capture GW", "  Gateway stopped", "  STA remains up", "  > Idle");
        MY_LOG_INFO(TAG, "Capture Gateway stopped; STA connection preserved");
        printf("[CGW] stopped\n[CGW] END\n");
        return err == ESP_OK ? 0 : 1;
    }

    if (strcasecmp(argv[1], "start") != 0 || argc < 3) {
        MY_LOG_INFO(TAG, "Usage: capture_gateway start <capture_ssid> [capture_password] [--pcap-name <name>] | status | stop");
        return 1;
    }

    const char *capture_password = "";
    const char *requested_pcap_name = NULL;
    for (int i = 3; i < argc; i++) {
        if (strcmp(argv[i], "--pcap-name") == 0) {
            if (requested_pcap_name != NULL || i + 1 >= argc) {
                MY_LOG_INFO(TAG, "--pcap-name requires exactly one filename");
                return 1;
            }
            requested_pcap_name = argv[++i];
        } else if (strncmp(argv[i], "--", 2) == 0) {
            MY_LOG_INFO(TAG, "Unexpected option: %s", argv[i]);
            return 1;
        } else if (capture_password[0] == '\0') {
            capture_password = argv[i];
        } else {
            MY_LOG_INFO(TAG, "Unexpected argument: %s", argv[i]);
            return 1;
        }
    }

    char normalized_pcap_name[PCAP_BASENAME_MAX_LEN + 1] = {0};
    if (requested_pcap_name != NULL &&
        !pcap_normalize_basename(requested_pcap_name, normalized_pcap_name,
                                 sizeof(normalized_pcap_name))) {
        MY_LOG_INFO(TAG,
                    "PCAP name must fit in %d characters including optional .pcap and use only letters, digits, '.', '_' or '-'; paths are not allowed",
                    PCAP_BASENAME_MAX_LEN);
        return 1;
    }

    return capture_gateway_start_session(argv[2], capture_password,
                                         normalized_pcap_name, "> Capture GW");
}

static int cmd_start_rogue_gitm(int argc, char **argv)
{
    if (argc < 3) {
        MY_LOG_INFO(TAG, "Usage: start_rogue_gitm <SSID> <password> [--pcap-name <name>]");
        MY_LOG_INFO(TAG, "Requires wifi_connect first. Optional select_networks for same-channel deauth.");
        return 1;
    }

    const char *ssid = argv[1];
    const char *password = argv[2];
    const char *requested_pcap_name = NULL;
    for (int i = 3; i < argc; i++) {
        if (strcmp(argv[i], "--pcap-name") == 0) {
            if (requested_pcap_name != NULL || i + 1 >= argc) {
                MY_LOG_INFO(TAG, "--pcap-name requires exactly one filename");
                return 1;
            }
            requested_pcap_name = argv[++i];
        } else if (strncmp(argv[i], "--", 2) == 0) {
            MY_LOG_INFO(TAG, "Unexpected option: %s", argv[i]);
            return 1;
        } else {
            MY_LOG_INFO(TAG, "Unexpected argument: %s", argv[i]);
            return 1;
        }
    }

    size_t ssid_len = strlen(ssid);
    size_t password_len = strlen(password);
    if (ssid_len == 0 || ssid_len > CAPTURE_GATEWAY_SSID_MAX_LEN) {
        MY_LOG_INFO(TAG, "SSID length must be between 1 and 32 characters");
        return 1;
    }
    if (password_len < CAPTURE_GATEWAY_PASSWORD_MIN_LEN ||
        password_len > CAPTURE_GATEWAY_PASSWORD_MAX_LEN) {
        MY_LOG_INFO(TAG, "Password length must be between 8 and 63 characters for WPA2");
        return 1;
    }

    char normalized_pcap_name[PCAP_BASENAME_MAX_LEN + 1] = {0};
    if (requested_pcap_name != NULL &&
        !pcap_normalize_basename(requested_pcap_name, normalized_pcap_name,
                                 sizeof(normalized_pcap_name))) {
        MY_LOG_INFO(TAG,
                    "PCAP name must fit in %d characters including optional .pcap and use only letters, digits, '.', '_' or '-'; paths are not allowed",
                    PCAP_BASENAME_MAX_LEN);
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal already running. Use 'stop' to stop it first.");
        return 1;
    }
    if (deauth_attack_active || deauth_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Deauth attack already running. Use 'stop' to stop it first.");
        return 1;
    }
    if (pcap_capture_active) {
        MY_LOG_INFO(TAG, "PCAP capture already active. Use 'stop' first.");
        return 1;
    }
    if (capture_gateway_is_active()) {
        MY_LOG_INFO(TAG, "Capture Gateway is already active. Use 'stop' first.");
        capture_gateway_print_status();
        return 1;
    }

