brokali/projectZeroTouch/ESP32C5/main/main.c
    wifi_ap_record_t upstream_ap = {0};
    esp_netif_ip_info_t upstream_ip = {0};
    if (current_radio_mode != RADIO_MODE_WIFI || !wifi_initialized ||
        !capture_gateway_wait_for_upstream(0, &upstream_ap, &upstream_ip)) {
        MY_LOG_INFO(TAG, "No upstream IPv4 connection. Use 'wifi_connect' first.");
        return 1;
    }

    bool deauth_enabled = (g_selected_count > 0);
    if (deauth_enabled) {
        if (!g_scan_done) {
            MY_LOG_INFO(TAG, "No scan results for selected networks. Run scan_networks first.");
            return 1;
        }
        uint8_t upstream_channel = upstream_ap.primary;
        bool channel_ok = true;
        bool uplink_collision = false;
        for (int i = 0; i < g_selected_count; i++) {
            int idx = g_selected_indices[i];
            if (idx < 0 || idx >= (int)g_scan_count) {
                MY_LOG_INFO(TAG, "Invalid selected network index %d", idx);
                return 1;
            }
            const wifi_ap_record_t *ap = &g_scan_results[idx];
            if (memcmp(ap->bssid, upstream_ap.bssid, 6) == 0) {
                MY_LOG_INFO(TAG,
                           "Rogue GITM: selected '%s' (%02X:%02X:%02X:%02X:%02X:%02X) is the STA uplink BSSID — deauth would kill Internet",
                           ap->ssid,
                           ap->bssid[0], ap->bssid[1], ap->bssid[2],
                           ap->bssid[3], ap->bssid[4], ap->bssid[5]);
                uplink_collision = true;
            }
            if (ap->primary != upstream_channel) {
                MY_LOG_INFO(TAG,
                           "Rogue GITM: selected '%s' (%02X:%02X:%02X:%02X:%02X:%02X) is on channel %u, upstream is channel %u",
                           ap->ssid,
                           ap->bssid[0], ap->bssid[1], ap->bssid[2],
                           ap->bssid[3], ap->bssid[4], ap->bssid[5],
                           ap->primary, upstream_channel);
                channel_ok = false;
            }
        }
        if (uplink_collision) {
            MY_LOG_INFO(TAG,
                        "Rogue GITM refused: do not select the upstream STA BSSID for deauth. Use a different uplink (wifi_connect) than the mirror/deauth target.");
            return 1;
        }
        if (!channel_ok) {
            MY_LOG_INFO(TAG,
                        "Rogue GITM refused: all selected deauth targets must share the upstream STA channel (%u)",
                        upstream_channel);
            return 1;
        }
        MY_LOG_INFO(TAG, "Networks selected: %d - deauth will run alongside Rogue GITM on channel %u",
                    g_selected_count, upstream_channel);
    } else {
        MY_LOG_INFO(TAG, "No networks selected - Rogue GITM SoftAP only (no deauth)");
    }

    int start_err = capture_gateway_start_session(ssid, password, normalized_pcap_name,
                                                  "> Rogue GITM");
    if (start_err != 0) {
        return start_err;
    }

    rogue_gitm_mode_active = true;

    if (deauth_enabled) {
        applicationState = DEAUTH_EVIL_TWIN;
        save_target_bssids();
        last_channel_check_time = esp_timer_get_time() / 1000;

        MY_LOG_INFO(TAG, "Starting deauth attack on %d network(s):", g_selected_count);
        for (int i = 0; i < target_bssid_count; i++) {
            MY_LOG_INFO(TAG, "  [%d] %02X:%02X:%02X:%02X:%02X:%02X (CH %d)",
                        i + 1,
                        target_bssids[i].bssid[0], target_bssids[i].bssid[1],
                        target_bssids[i].bssid[2], target_bssids[i].bssid[3],
                        target_bssids[i].bssid[4], target_bssids[i].bssid[5],
                        target_bssids[i].channel);
        }

        deauth_attack_active = true;
        BaseType_t result = xTaskCreate(
            deauth_attack_task,
            "deauth_task",
            4096,
            NULL,
            5,
            &deauth_attack_task_handle
        );
        if (result != pdPASS) {
            MY_LOG_INFO(TAG, "Failed to create deauth attack task!");
            deauth_attack_active = false;
            applicationState = IDLE;
            MY_LOG_INFO(TAG, "WARNING: Rogue GITM running but deauth attack failed to start");
        }
    }

    MY_LOG_INFO(TAG, "Rogue GITM started successfully!");
    MY_LOG_INFO(TAG, "Mirror SoftAP: %s (WPA2) via Capture Gateway; use 'capture_gateway status' / 'stop'",
                ssid);
    esp_err_t led_err = led_set_color(255, 165, 0);
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for Rogue GITM: %s", esp_err_to_name(led_err));
    }
    return 0;
}

static int cmd_ota_check(int argc, char **argv) {
    oled_display_update_full("> OTA Update", "  Checking...", "  github.com", "  v" JANOS_VERSION " current");
    const char *tag = NULL;
    bool force_latest = false;

    if (argc > 2) {
        MY_LOG_INFO(TAG, "Usage: ota_check [latest|<tag>]");
        return 1;
    }
    if (argc == 2) {
        if (strcasecmp(argv[1], "latest") == 0) {
            force_latest = true;
        } else {
            tag = argv[1];
        }
    }

    if (!ensure_wifi_mode()) {
        MY_LOG_INFO(TAG, "OTA: WiFi not ready");
        return 1;
    }
    if (!ota_is_connected()) {
        MY_LOG_INFO(TAG, "OTA: not connected or no IP. Use 'wifi_connect' first.");
        return 1;
    }

    if (!ota_start_check(tag, force_latest)) {
        return 1;
    }

    return 0;
}

static int cmd_ota_list(int argc, char **argv) {
    (void)argc;
    (void)argv;

    if (!ensure_wifi_mode()) {
        MY_LOG_INFO(TAG, "OTA: WiFi not ready");
        return 1;
    }
    if (!ota_is_connected()) {
        MY_LOG_INFO(TAG, "OTA: not connected or no IP. Use 'wifi_connect' first.");
        return 1;
    }

    char api_url[256];
    int res = snprintf(api_url, sizeof(api_url),
                       "https://api.github.com/repos/%s/%s/releases?per_page=5",
                       OTA_GITHUB_OWNER, OTA_GITHUB_REPO);
    if (res < 0 || res >= (int)sizeof(api_url)) {
        return 1;
    }

    char *body = NULL;
    size_t body_len = 0;
    esp_err_t err = ota_http_get(api_url, &body, &body_len);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: list failed: %s", esp_err_to_name(err));
        return 1;
    }
    (void)body_len;

    cJSON *root = cJSON_Parse(body);
    if (!root || !cJSON_IsArray(root)) {
        cJSON_Delete(root);
        free(body);
        MY_LOG_INFO(TAG, "OTA: list parse failed");
        return 1;
    }

