brokali/projectZeroTouch/ESP32C5/main/main.c
    int idx = 0;
    cJSON *item = NULL;
    cJSON_ArrayForEach(item, root) {
        cJSON *tag = cJSON_GetObjectItem(item, "tag_name");
        cJSON *name = cJSON_GetObjectItem(item, "name");
        cJSON *prerelease = cJSON_GetObjectItem(item, "prerelease");
        cJSON *published = cJSON_GetObjectItem(item, "published_at");
        if (!cJSON_IsString(tag)) {
            continue;
        }
        const char *channel = (cJSON_IsBool(prerelease) && cJSON_IsTrue(prerelease)) ? "dev" : "main";
        const char *title = (cJSON_IsString(name) && name->valuestring[0] != '\0') ? name->valuestring : "";
        const char *date = (cJSON_IsString(published) && strlen(published->valuestring) >= 10)
                               ? published->valuestring
                               : "";
        char date_buf[11] = {0};
        if (date[0] != '\0') {
            memcpy(date_buf, date, 10);
            date_buf[10] = '\0';
        }
        MY_LOG_INFO(TAG, "OTA[%d]: %s (%s) %s %s",
                    idx,
                    tag->valuestring,
                    channel,
                    date_buf,
                    title);
        idx++;
    }

    cJSON_Delete(root);
    free(body);
    return 0;
}

static int cmd_ota_channel(int argc, char **argv) {
    if (argc == 1) {
        MY_LOG_INFO(TAG, "OTA channel: %s", ota_channel);
        return 0;
    }
    if (argc != 2) {
        MY_LOG_INFO(TAG, "Usage: ota_channel <main|dev>");
        return 1;
    }

    if (strcasecmp(argv[1], "main") != 0 && strcasecmp(argv[1], "dev") != 0) {
        MY_LOG_INFO(TAG, "Usage: ota_channel <main|dev>");
        return 1;
    }

    snprintf(ota_channel, sizeof(ota_channel), "%s", argv[1]);
    if (!ota_save_channel_to_nvs(ota_channel)) {
        MY_LOG_INFO(TAG, "OTA: failed to save channel");
        return 1;
    }

    MY_LOG_INFO(TAG, "OTA channel set to: %s", ota_channel);
    return 0;
}

static int cmd_ota_info(int argc, char **argv) {
    (void)argc;
    (void)argv;

    const esp_partition_t *boot = esp_ota_get_boot_partition();
    const esp_partition_t *running = esp_ota_get_running_partition();
    const esp_partition_t *next = esp_ota_get_next_update_partition(NULL);
    esp_ota_img_states_t state = ESP_OTA_IMG_UNDEFINED;
    if (running) {
        esp_ota_get_state_partition(running, &state);
    }

    MY_LOG_INFO(TAG, "OTA boot: %s",
                boot ? boot->label : "n/a");
    MY_LOG_INFO(TAG, "OTA running: %s state=%d",
                running ? running->label : "n/a",
                (int)state);
    MY_LOG_INFO(TAG, "OTA next: %s",
                next ? next->label : "n/a");

    const esp_partition_t *ota0 = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                                           ESP_PARTITION_SUBTYPE_APP_OTA_0,
                                                           NULL);
    const esp_partition_t *ota1 = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                                           ESP_PARTITION_SUBTYPE_APP_OTA_1,
                                                           NULL);
    const esp_partition_t *parts[2] = { ota0, ota1 };
    const char *labels[2] = { "ota_0", "ota_1" };

    for (int i = 0; i < 2; i++) {
        const esp_partition_t *part = parts[i];
        if (!part) {
            MY_LOG_INFO(TAG, "APP[%d]: %s missing", i, labels[i]);
            continue;
        }
        esp_app_desc_t desc = {0};
        esp_ota_img_states_t part_state = ESP_OTA_IMG_UNDEFINED;
        esp_ota_get_state_partition(part, &part_state);
        esp_err_t desc_err = esp_ota_get_partition_description(part, &desc);
        if (desc_err == ESP_OK) {
            MY_LOG_INFO(TAG,
                        "APP[%d]: %s state=%d ver=%s",
                        i,
                        part->label,
                        (int)part_state,
                        desc.version);
        } else {
            MY_LOG_INFO(TAG, "APP[%d]: %s state=%d",
                        i,
                        part->label,
                        (int)part_state);
        }
    }

    return 0;
}

static int cmd_ota_boot(int argc, char **argv) {
    if (argc != 2) {
        MY_LOG_INFO(TAG, "Usage: ota_boot <ota_0|ota_1>");
        return 1;
    }

    const esp_partition_t *target = NULL;
    if (strcasecmp(argv[1], "ota_0") == 0) {
        target = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                          ESP_PARTITION_SUBTYPE_APP_OTA_0,
                                          NULL);
    } else if (strcasecmp(argv[1], "ota_1") == 0) {
        target = esp_partition_find_first(ESP_PARTITION_TYPE_APP,
                                          ESP_PARTITION_SUBTYPE_APP_OTA_1,
                                          NULL);
    } else {
        MY_LOG_INFO(TAG, "Usage: ota_boot <ota_0|ota_1>");
        return 1;
    }

    if (!target) {
        MY_LOG_INFO(TAG, "OTA: target partition not found");
        return 1;
    }

    esp_err_t err = esp_ota_set_boot_partition(target);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "OTA: set boot partition failed: %s", esp_err_to_name(err));
        return 1;
    }

    MY_LOG_INFO(TAG, "OTA: boot set to %s, restarting", target->label);
    safe_restart();  // unmount SD card before restart
    return 0;
}

// --- Shared host discovery (ARP batches + ICMP ping sweep) ---

#define DISCOVER_MAX_HOSTS 254
#define DISCOVER_ARP_POLL_INTERVAL_MS 200
#define DISCOVER_ARP_POLL_ROUNDS 20
#define DISCOVER_ICMP_WAIT_MS 2000
#define DISCOVER_ICMP_ID 0x4A4E

typedef struct {
    uint32_t ip_addr;
    uint8_t  mac[6];
    bool     mac_known;
} discovered_host_t;

static uint16_t icmp_checksum(const void *data, size_t len)
{
    const uint8_t *p = (const uint8_t *)data;
    uint32_t sum = 0;
    for (size_t i = 0; i < len - 1; i += 2)
        sum += (uint16_t)(p[i] << 8 | p[i + 1]);
    if (len & 1)
        sum += (uint16_t)(p[len - 1] << 8);
    while (sum >> 16)
        sum = (sum & 0xFFFF) + (sum >> 16);
    return htons((uint16_t)~sum);
}

static bool discover_host_already_found(const discovered_host_t *hosts, int count, uint32_t ip_addr)
{
    for (int i = 0; i < count; i++) {
        if (hosts[i].ip_addr == ip_addr)
            return true;
    }
    return false;
}

static int discover_lan_hosts(discovered_host_t *hosts, int max_hosts)
{
    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return -1;
    }

    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        MY_LOG_INFO(TAG, "STA interface not found");
        return -1;
    }

    esp_netif_ip_info_t ip_info;
    if (esp_netif_get_ip_info(sta_netif, &ip_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to get IP info. DHCP may not have completed.");
        return -1;
    }
    if (ip_info.ip.addr == 0) {
        MY_LOG_INFO(TAG, "No IP address assigned yet. Wait for DHCP.");
        return -1;
    }

    uint32_t ip_h  = ntohl(ip_info.ip.addr);
    uint32_t mask_h = ntohl(ip_info.netmask.addr);
    uint32_t network   = ip_h & mask_h;
    uint32_t broadcast = network | ~mask_h;
    uint32_t subnet_size = broadcast - network - 1;
    if (subnet_size > (uint32_t)max_hosts)
        subnet_size = (uint32_t)max_hosts;

    MY_LOG_INFO(TAG, "Our IP: " IPSTR ", Netmask: " IPSTR,
                IP2STR(&ip_info.ip), IP2STR(&ip_info.netmask));

    struct netif *lwip_netif = esp_netif_get_netif_impl(sta_netif);
    if (!lwip_netif) {
        MY_LOG_INFO(TAG, "Failed to get LwIP netif");
        return -1;
    }

