brokali/projectZeroTouch/ESP32C5/main/main.c
    int host_count = 0;
    int arp_found = 0;

    // --- Phase 1: ARP flood + repeated table polling ---
    MY_LOG_INFO(TAG, "Phase 1: ARP scan (%lu hosts)...", (unsigned long)subnet_size);

    int sent = 0;
    for (uint32_t target = network + 1; target < broadcast && sent < max_hosts; target++, sent++) {
        ip4_addr_t tip;
        tip.addr = htonl(target);
        etharp_request(lwip_netif, &tip);
        if (sent % 10 == 0)
            vTaskDelay(pdMS_TO_TICKS(10));
    }

    MY_LOG_INFO(TAG, "Sent %d ARP requests, polling table for %d seconds...",
                sent, (DISCOVER_ARP_POLL_INTERVAL_MS * DISCOVER_ARP_POLL_ROUNDS) / 1000);

    for (int round = 0; round < DISCOVER_ARP_POLL_ROUNDS; round++) {
        vTaskDelay(pdMS_TO_TICKS(DISCOVER_ARP_POLL_INTERVAL_MS));
        for (int i = 0; i < ARP_TABLE_SIZE && host_count < max_hosts; i++) {
            ip4_addr_t *ip_ret;
            struct netif *netif_ret;
            struct eth_addr *eth_ret;
            if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
                if (!discover_host_already_found(hosts, host_count, ip_ret->addr)) {
                    hosts[host_count].ip_addr = ip_ret->addr;
                    memcpy(hosts[host_count].mac, eth_ret->addr, 6);
                    hosts[host_count].mac_known = true;
                    host_count++;
                    arp_found++;
                }
            }
        }
    }

    MY_LOG_INFO(TAG, "ARP: found %d hosts", arp_found);

    // --- Phase 2: ICMP ping sweep for unfound IPs ---
    int ping_sock = socket(AF_INET, SOCK_RAW, IPPROTO_ICMP);
    if (ping_sock < 0) {
        MY_LOG_INFO(TAG, "ICMP socket failed, skipping ping sweep");
        return host_count;
    }

    struct timeval tv = { .tv_sec = 0, .tv_usec = 100000 };
    setsockopt(ping_sock, SOL_SOCKET, SO_RCVTIMEO, &tv, sizeof(tv));

    typedef struct __attribute__((packed)) {
        uint8_t  type;
        uint8_t  code;
        uint16_t checksum;
        uint16_t id;
        uint16_t seqno;
    } icmp_echo_t;

    int pings_sent = 0;
    uint16_t seq = 0;
    for (uint32_t target = network + 1; target < broadcast && (int)seq < max_hosts; target++) {
        uint32_t target_net = htonl(target);
        if (discover_host_already_found(hosts, host_count, target_net))
            continue;

        icmp_echo_t echo = {0};
        echo.type = 8;
        echo.code = 0;
        echo.id   = htons(DISCOVER_ICMP_ID);
        echo.seqno = htons(seq++);
        echo.checksum = 0;
        echo.checksum = icmp_checksum(&echo, sizeof(echo));

        struct sockaddr_in dest = {
            .sin_family = AF_INET,
            .sin_addr.s_addr = target_net,
        };
        sendto(ping_sock, &echo, sizeof(echo), 0,
               (struct sockaddr *)&dest, sizeof(dest));
        pings_sent++;

        if (pings_sent % 10 == 0)
            vTaskDelay(pdMS_TO_TICKS(5));
    }

    MY_LOG_INFO(TAG, "Phase 2: sent %d ICMP pings, waiting for replies...", pings_sent);
    vTaskDelay(pdMS_TO_TICKS(DISCOVER_ICMP_WAIT_MS));

    int icmp_found = 0;
    char recv_buf[64];
    struct sockaddr_in from;
    socklen_t fromlen;
    for (;;) {
        fromlen = sizeof(from);
        int n = recvfrom(ping_sock, recv_buf, sizeof(recv_buf), 0,
                         (struct sockaddr *)&from, &fromlen);
        if (n <= 0) break;

        if (n < 20 + (int)sizeof(icmp_echo_t)) continue;
        int ihl = (recv_buf[0] & 0x0F) * 4;
        if (n < ihl + (int)sizeof(icmp_echo_t)) continue;
        icmp_echo_t *reply = (icmp_echo_t *)(recv_buf + ihl);
        if (reply->type != 0 || reply->code != 0) continue;
        if (ntohs(reply->id) != DISCOVER_ICMP_ID) continue;

        uint32_t src_ip = from.sin_addr.s_addr;
        if (host_count < max_hosts &&
            !discover_host_already_found(hosts, host_count, src_ip)) {
            hosts[host_count].ip_addr = src_ip;
            memset(hosts[host_count].mac, 0, 6);
            hosts[host_count].mac_known = false;
            host_count++;
            icmp_found++;
        }
    }
    close(ping_sock);

    MY_LOG_INFO(TAG, "ICMP: found %d additional hosts", icmp_found);
    MY_LOG_INFO(TAG, "Total: %d hosts discovered (%d ARP + %d ICMP)",
                host_count, arp_found, icmp_found);

    return host_count;
}

// --- Host listing commands ---

static int cmd_list_hosts(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Host Scan", "  Scanning LAN", "", "  Working...");

    discovered_host_t *hosts = calloc(DISCOVER_MAX_HOSTS, sizeof(discovered_host_t));
    if (!hosts) {
        MY_LOG_INFO(TAG, "Out of memory for host list");
        return 1;
    }

    int host_count = discover_lan_hosts(hosts, DISCOVER_MAX_HOSTS);
    if (host_count < 0) {
        free(hosts);
        return 1;
    }

    MY_LOG_INFO(TAG, "=== Discovered Hosts ===");
    int arp_cnt = 0, icmp_cnt = 0;
    for (int i = 0; i < host_count; i++) {
        ip4_addr_t tmp;
        tmp.addr = hosts[i].ip_addr;
        uint8_t *m = hosts[i].mac;
        if (hosts[i].mac_known) {
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  %02X:%02X:%02X:%02X:%02X:%02X  [ARP]",
                IP2STR(&tmp), m[0], m[1], m[2], m[3], m[4], m[5]);
            arp_cnt++;
        } else {
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  (MAC unknown)  [ICMP]", IP2STR(&tmp));
            icmp_cnt++;
        }
    }
    MY_LOG_INFO(TAG, "========================");
    MY_LOG_INFO(TAG, "Found %d hosts (%d via ARP, %d via ICMP)", host_count, arp_cnt, icmp_cnt);

    free(hosts);
    return 0;
}

static int cmd_list_hosts_vendor(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Host Scan", "  Scanning LAN", "  + vendor lookup", "  Working...");

    discovered_host_t *hosts = calloc(DISCOVER_MAX_HOSTS, sizeof(discovered_host_t));
    if (!hosts) {
        MY_LOG_INFO(TAG, "Out of memory for host list");
        return 1;
    }

    int host_count = discover_lan_hosts(hosts, DISCOVER_MAX_HOSTS);
    if (host_count < 0) {
        free(hosts);
        return 1;
    }

    MY_LOG_INFO(TAG, "=== Discovered Hosts ===");
    int arp_cnt = 0, icmp_cnt = 0;
    for (int i = 0; i < host_count; i++) {
        ip4_addr_t tmp;
        tmp.addr = hosts[i].ip_addr;
        uint8_t *m = hosts[i].mac;
        if (hosts[i].mac_known) {
            const char *vendor = lookup_vendor_name(m);
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  %02X:%02X:%02X:%02X:%02X:%02X  [%s]  [ARP]",
                IP2STR(&tmp), m[0], m[1], m[2], m[3], m[4], m[5],
                vendor ? vendor : "Unknown");
            arp_cnt++;
        } else {
            MY_LOG_INFO(TAG, "  " IPSTR "  ->  (MAC unknown)  [ICMP]", IP2STR(&tmp));
            icmp_cnt++;
        }
    }
    MY_LOG_INFO(TAG, "========================");
    MY_LOG_INFO(TAG, "Found %d hosts (%d via ARP, %d via ICMP)", host_count, arp_cnt, icmp_cnt);

    free(hosts);
    return 0;
}

// --- Port scanner (nmap-like) ---

