brokali/projectZeroTouch/ESP32C5/main/main.c
typedef struct {
    uint16_t port;
    const char *name;
} nmap_port_entry_t;

static const nmap_port_entry_t nmap_ports[] = {
    // --- quick (first 20) ---
    {   21, "FTP"        },
    {   22, "SSH"        },
    {   23, "Telnet"     },
    {   25, "SMTP"       },
    {   53, "DNS"        },
    {   80, "HTTP"       },
    {  110, "POP3"       },
    {  135, "MSRPC"      },
    {  139, "NetBIOS"    },
    {  143, "IMAP"       },
    {  443, "HTTPS"      },
    {  445, "SMB"        },
    {  993, "IMAPS"      },
    { 1433, "MSSQL"      },
    { 3306, "MySQL"      },
    { 3389, "RDP"        },
    { 5432, "PostgreSQL" },
    { 5900, "VNC"        },
    { 8080, "HTTP-alt"   },
    { 8443, "HTTPS-alt"  },
    // --- medium (next 30) ---
    {  111, "RPCbind"    },
    {  161, "SNMP"       },
    {  162, "SNMP-trap"  },
    {  389, "LDAP"       },
    {  465, "SMTPS"      },
    {  514, "Syslog"     },
    {  515, "LPD"        },
    {  554, "RTSP"       },
    {  587, "Submission" },
    {  636, "LDAPS"      },
    {  873, "Rsync"      },
    {  995, "POP3S"      },
    { 1080, "SOCKS"      },
    { 1443, "IES-LM"     },
    { 1521, "Oracle"     },
    { 1883, "MQTT"       },
    { 2049, "NFS"        },
    { 2181, "ZooKeeper"  },
    { 2375, "Docker"     },
    { 3000, "Grafana"    },
    { 3128, "Squid"      },
    { 4443, "Pharos"     },
    { 5000, "UPnP"       },
    { 5060, "SIP"        },
    { 5222, "XMPP"       },
    { 5601, "Kibana"     },
    { 6379, "Redis"      },
    { 8000, "HTTP-alt2"  },
    { 8888, "HTTP-alt3"  },
    { 9090, "Prometheus" },
    // --- heavy (next 50) ---
    {   69, "TFTP"       },
    {  179, "BGP"        },
    {  502, "Modbus"     },
    {  548, "AFP"        },
    {  623, "IPMI"       },
    {  631, "IPP"        },
    {  902, "VMware"     },
    { 1194, "OpenVPN"    },
    { 1234, "VLC"        },
    { 1723, "PPTP"       },
    { 1900, "SSDP"       },
    { 2082, "cPanel"     },
    { 2083, "cPanel-SSL" },
    { 2222, "SSH-alt"    },
    { 2484, "Oracle-SSL" },
    { 3268, "LDAP-GC"    },
    { 3269, "LDAPS-GC"   },
    { 3690, "SVN"        },
    { 4000, "ICQ"        },
    { 4444, "Metasploit" },
    { 4567, "Sinatra"    },
    { 4848, "GlassFish"  },
    { 5353, "mDNS"       },
    { 5433, "PostgreAlt" },
    { 5672, "AMQP"       },
    { 5984, "CouchDB"    },
    { 6000, "X11"        },
    { 6443, "K8s-API"    },
    { 6660, "IRC"        },
    { 6667, "IRC"        },
    { 7001, "WebLogic"   },
    { 7077, "Spark"      },
    { 7474, "Neo4j"      },
    { 8008, "HTTP-alt4"  },
    { 8081, "HTTP-alt5"  },
    { 8181, "HTTP-alt6"  },
    { 8444, "HTTP-alt7"  },
    { 8834, "Nessus"     },
    { 8883, "MQTT-SSL"   },
    { 9000, "SonarQube"  },
    { 9092, "Kafka"      },
    { 9100, "JetDirect"  },
    { 9200, "Elastic"    },
    { 9443, "WSO2"       },
    {10000, "Webmin"     },
    {11211, "Memcached"  },
    {15672, "RabbitMQ"   },
    {25565, "Minecraft"  },
    {27017, "MongoDB"    },
    {28017, "MongoHTTP"  },
    {50000, "SAP"        },
};
#define NMAP_PORTS_QUICK   20
#define NMAP_PORTS_MEDIUM  50
#define NMAP_PORTS_HEAVY  100
#define NMAP_CONNECT_TIMEOUT_MS 500

static bool nmap_check_port(uint32_t ip_net_order, uint16_t port)
{
    int sock = socket(AF_INET, SOCK_STREAM, IPPROTO_TCP);
    if (sock < 0) return false;

    int flags = fcntl(sock, F_GETFL, 0);
    fcntl(sock, F_SETFL, flags | O_NONBLOCK);

    struct sockaddr_in addr = {
        .sin_family = AF_INET,
        .sin_port   = htons(port),
        .sin_addr.s_addr = ip_net_order,
    };

    int ret = connect(sock, (struct sockaddr *)&addr, sizeof(addr));
    if (ret == 0) {
        close(sock);
        return true;
    }
    if (errno != EINPROGRESS) {
        close(sock);
        return false;
    }

    fd_set wset;
    FD_ZERO(&wset);
    FD_SET(sock, &wset);
    struct timeval tv = {
        .tv_sec  = NMAP_CONNECT_TIMEOUT_MS / 1000,
        .tv_usec = (NMAP_CONNECT_TIMEOUT_MS % 1000) * 1000,
    };

    bool open = false;
    if (select(sock + 1, NULL, &wset, NULL, &tv) > 0) {
        int so_err = 0;
        socklen_t len = sizeof(so_err);
        getsockopt(sock, SOL_SOCKET, SO_ERROR, &so_err, &len);
        open = (so_err == 0);
    }

    close(sock);
    return open;
}

static int cmd_start_nmap(int argc, char **argv)
{
    int port_count = NMAP_PORTS_QUICK;
    const char *level_name = "quick";
    uint32_t single_ip = 0;
    bool single_host_mode = false;

    for (int i = 1; i < argc; i++) {
        if (strcasecmp(argv[i], "quick") == 0) {
            port_count = NMAP_PORTS_QUICK;
            level_name = "quick";
        } else if (strcasecmp(argv[i], "medium") == 0) {
            port_count = NMAP_PORTS_MEDIUM;
            level_name = "medium";
        } else if (strcasecmp(argv[i], "heavy") == 0) {
            port_count = NMAP_PORTS_HEAVY;
            level_name = "heavy";
        } else {
            struct in_addr parsed;
            if (inet_aton(argv[i], &parsed)) {
                single_ip = parsed.s_addr;
                single_host_mode = true;
            } else {
                MY_LOG_INFO(TAG, "Usage: start_nmap [quick|medium|heavy] [IP]");
                return 1;
            }
        }
    }

    oled_display_update_full("> NMAP Scan",
        single_host_mode ? "  Single host" : "  Discovering hosts",
        "", "  Working...");
    log_memory_info("start_nmap");

    MY_LOG_INFO(TAG, "Scan level: %s (%d ports)", level_name, port_count);

    discovered_host_t *hosts = calloc(DISCOVER_MAX_HOSTS, sizeof(discovered_host_t));
    if (!hosts) {
        MY_LOG_INFO(TAG, "Out of memory for host list");
        return 1;
    }

    int host_count = 0;

    if (single_host_mode) {
        hosts[0].ip_addr = single_ip;
        memset(hosts[0].mac, 0, 6);
        hosts[0].mac_known = false;
        host_count = 1;
        MY_LOG_INFO(TAG, "Single-host mode, skipping host discovery.");
    } else {
        host_count = discover_lan_hosts(hosts, DISCOVER_MAX_HOSTS);
        if (host_count < 0) {
            free(hosts);
            return 1;
        }
    }

    MY_LOG_INFO(TAG, "Scanning %d host(s), %d ports each (%s)...",
                host_count, port_count, level_name);

    int total_open = 0;

    MY_LOG_INFO(TAG, "=== NMAP Scan Results ===");
    for (int h = 0; h < host_count; h++) {
        uint32_t host_ip = hosts[h].ip_addr;
        uint8_t *m = hosts[h].mac;

        char ip_str[16];
        ip4_addr_t tmp;
        tmp.addr = host_ip;
        snprintf(ip_str, sizeof(ip_str), IPSTR, IP2STR(&tmp));

        char oled_line[40];
        snprintf(oled_line, sizeof(oled_line), "  %d/%d %s", h + 1, host_count, ip_str);
        oled_display_update_full("> NMAP Scan", oled_line, "  Scanning ports...", "");

        if (hosts[h].mac_known) {
            MY_LOG_INFO(TAG, "Host: %s  (%02X:%02X:%02X:%02X:%02X:%02X)",
                        ip_str, m[0], m[1], m[2], m[3], m[4], m[5]);
        } else {
            MY_LOG_INFO(TAG, "Host: %s  (MAC unknown)", ip_str);
        }

