brokali/projectZeroTouch/ESP32C5/main/main.c
    MY_LOG_INFO(TAG, "ARP ban started. Use 'stop' to stop.");
    return 0;
}

static void packet_monitor_shutdown(void) {
    if (packet_monitor_promiscuous_owned) {
        esp_wifi_set_promiscuous(false);
        packet_monitor_promiscuous_owned = false;
    }

    if (packet_monitor_callback_installed) {
        esp_wifi_set_promiscuous_rx_cb(NULL);
        packet_monitor_callback_installed = false;
    }

    if (packet_monitor_has_prev_channel) {
        esp_wifi_set_channel(packet_monitor_prev_primary, packet_monitor_prev_secondary);
        packet_monitor_has_prev_channel = false;
    }
}

static void packet_monitor_stop(void) {
    if (!packet_monitor_active && packet_monitor_task_handle == NULL && !packet_monitor_promiscuous_owned && !packet_monitor_callback_installed) {
        return;
    }

    MY_LOG_INFO(TAG, "Stopping packet monitor...");

    packet_monitor_active = false;

    for (int i = 0; i < 40 && packet_monitor_task_handle != NULL; ++i) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }

    if (packet_monitor_task_handle != NULL) {
        vTaskDelete(packet_monitor_task_handle);
        packet_monitor_task_handle = NULL;
    }

    packet_monitor_shutdown();
    packet_monitor_total = 0;
}

static void packet_monitor_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type) {
    (void)buf;

    if (!packet_monitor_active) {
        return;
    }

    packet_monitor_total++;
}

static void packet_monitor_task(void *pvParameters) {
    (void)pvParameters;

    uint32_t last_total = 0;

    while (packet_monitor_active) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        if (!packet_monitor_active) {
            break;
        }

        uint32_t current = packet_monitor_total;
        uint32_t diff = current - last_total;
        last_total = current;

        printf("%" PRIu32 "pkts\n", diff);
        fflush(stdout);
        
        {
            char pm_l3[64], pm_l4[64];
            snprintf(pm_l3, sizeof(pm_l3), "  %" PRIu32 " pkts/sec", diff);
            snprintf(pm_l4, sizeof(pm_l4), "  Total: %" PRIu32, current);
            oled_display_update_full("> Pkt Monitor", "  Listening...", pm_l3, pm_l4);
        }
    }

    packet_monitor_shutdown();
    packet_monitor_task_handle = NULL;
    packet_monitor_total = 0;
    packet_monitor_active = false;
    vTaskDelete(NULL);
}

static void ap_locator_shutdown(void) {
    if (ap_locator_promiscuous_owned) {
        esp_wifi_set_promiscuous(false);
        ap_locator_promiscuous_owned = false;
    }

    if (ap_locator_callback_installed) {
        esp_wifi_set_promiscuous_rx_cb(NULL);
        ap_locator_callback_installed = false;
    }

    if (ap_locator_has_prev_channel) {
        esp_wifi_set_channel(ap_locator_prev_primary, ap_locator_prev_secondary);
        ap_locator_has_prev_channel = false;
    }
}

static void ap_locator_stop(void) {
    if (!ap_locator_active && ap_locator_task_handle == NULL && !ap_locator_promiscuous_owned &&
        !ap_locator_callback_installed) {
        return;
    }

    MY_LOG_INFO(TAG, "Stopping AP locator...");

    ap_locator_active = false;

    for (int i = 0; i < 40 && ap_locator_task_handle != NULL; ++i) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }

    if (ap_locator_task_handle != NULL) {
        vTaskDelete(ap_locator_task_handle);
        ap_locator_task_handle = NULL;
    }

    ap_locator_shutdown();
    ap_locator_last_rssi = 0;
    ap_locator_beacon_seen = false;
    ap_locator_beacon_total = 0;
    ap_locator_last_seen_us = 0;
    ap_locator_target_channel = 1;
    memset(ap_locator_target_bssid, 0, sizeof(ap_locator_target_bssid));
    ap_locator_target_ssid[0] = '\0';
}

static void ap_locator_promiscuous_callback(void *buf, wifi_promiscuous_pkt_type_t type) {
    if (!ap_locator_active || type != WIFI_PKT_MGMT) {
        return;
    }

    const wifi_promiscuous_pkt_t *pkt = (wifi_promiscuous_pkt_t *)buf;
    const uint8_t *frame = pkt->payload;
    int len = pkt->rx_ctrl.sig_len;

    if (len < 24) {
        return;
    }

    if ((frame[0] & 0xFC) != 0x80) {
        return;
    }

    if (memcmp(&frame[10], ap_locator_target_bssid, sizeof(ap_locator_target_bssid)) != 0) {
        return;
    }

    ap_locator_last_rssi = (int)pkt->rx_ctrl.rssi;
    ap_locator_last_seen_us = esp_timer_get_time();
    ap_locator_beacon_seen = true;
    ap_locator_beacon_total++;
}

static void ap_locator_task(void *pvParameters) {
    (void)pvParameters;

    uint32_t last_total = 0;

    while (ap_locator_active) {
        vTaskDelay(pdMS_TO_TICKS(1000));

        if (!ap_locator_active) {
            break;
        }

        char mac_str[18];
        snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
                 ap_locator_target_bssid[0], ap_locator_target_bssid[1], ap_locator_target_bssid[2],
                 ap_locator_target_bssid[3], ap_locator_target_bssid[4], ap_locator_target_bssid[5]);

        const char *ssid = ap_locator_target_ssid[0] != '\0' ? ap_locator_target_ssid : "<hidden>";
        uint32_t current_total = ap_locator_beacon_total;
        uint32_t diff = current_total - last_total;
        last_total = current_total;

        if (ap_locator_beacon_seen) {
            printf("[AP Locator] CH: %u | AP: %s (%s) | RSSI: %d dBm | beacons: %" PRIu32 "\n",
                   ap_locator_target_channel,
                   ssid,
                   mac_str,
                   ap_locator_last_rssi,
                   diff);
        } else {
            printf("[AP Locator] CH: %u | AP: %s (%s) | RSSI: N/A | no beacon\n",
                   ap_locator_target_channel,
                   ssid,
                   mac_str);
        }
        fflush(stdout);

        {
            char line2[32];
            char line3[32];
            char line4[32];
            snprintf(line2, sizeof(line2), "  %.24s", ssid);
            if (ap_locator_beacon_seen) {
                snprintf(line3, sizeof(line3), "  Ch %u  %d dB",
                         ap_locator_target_channel,
                         ap_locator_last_rssi);
                snprintf(line4, sizeof(line4), "  %" PRIu32 " bcn/sec", diff);
            } else {
                snprintf(line3, sizeof(line3), "  Ch %u  No beacon", ap_locator_target_channel);
                snprintf(line4, sizeof(line4), "  Waiting...");
            }
            oled_display_update_full("> AP Locator", line2, line3, line4);
        }

        ap_locator_beacon_seen = false;
    }

    ap_locator_shutdown();
    ap_locator_task_handle = NULL;
    ap_locator_active = false;
    vTaskDelete(NULL);
}

