brokali/projectZeroTouch/ESP32C5/main/main.c
static int cmd_packet_monitor(int argc, char **argv) {
    {
        char oled_ch[24];
        snprintf(oled_ch, sizeof(oled_ch), "  Channel %s", argc >= 2 ? argv[1] : "?");
        oled_display_update_full("> Pkt Monitor", oled_ch, "", "  Listening...");
    }
    log_memory_info("packet_monitor");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: packet_monitor <channel>");
        return 1;
    }

    if (packet_monitor_active || packet_monitor_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Packet monitor already active. Use 'stop' to stop it first.");
        return 1;
    }

    char *endptr = NULL;
    long channel = strtol(argv[1], &endptr, 10);
    if (argv[1][0] == '\0' || (endptr != NULL && *endptr != '\0')) {
        MY_LOG_INFO(TAG, "Invalid channel argument. Usage: packet_monitor <channel>");
        return 1;
    }

    if (channel < 1 || channel > 165) {
        MY_LOG_INFO(TAG, "Channel must be between 1 and 165.");
        return 1;
    }

    if (sniffer_active || sniffer_scan_phase || sniffer_dog_active) {
        MY_LOG_INFO(TAG, "Sniffer is active. Use 'stop' to stop it first.");
        return 1;
    }

    if (applicationState != IDLE) {
        MY_LOG_INFO(TAG, "Another attack is active. Use 'stop' to stop it first.");
        return 1;
    }

    if (wardrive_active) {
        MY_LOG_INFO(TAG, "Wardrive is active. Use 'stop' to stop it first.");
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal is active. Use 'stop' to stop it first.");
        return 1;
    }

    esp_err_t err;
    uint8_t primary = 1;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE;
    err = esp_wifi_get_channel(&primary, &secondary);
    if (err == ESP_OK) {
        packet_monitor_prev_primary = primary;
        packet_monitor_prev_secondary = secondary;
        packet_monitor_has_prev_channel = true;
    } else {
        packet_monitor_has_prev_channel = false;
    }

    wifi_promiscuous_filter_t filter = {
        .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT |
                       WIFI_PROMIS_FILTER_MASK_DATA |
                       WIFI_PROMIS_FILTER_MASK_CTRL
    };

    esp_wifi_set_promiscuous(false);

    err = esp_wifi_set_promiscuous_filter(&filter);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set promiscuous filter: %s", esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }

    err = esp_wifi_set_channel((uint8_t)channel, WIFI_SECOND_CHAN_NONE);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set channel %ld: %s", channel, esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }

    err = esp_wifi_set_promiscuous_rx_cb(packet_monitor_promiscuous_callback);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set promiscuous callback: %s", esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }
    packet_monitor_callback_installed = true;

    packet_monitor_total = 0;
    packet_monitor_active = true;

    err = esp_wifi_set_promiscuous(true);
    if (err != ESP_OK) {
        packet_monitor_active = false;
        MY_LOG_INFO(TAG, "Failed to enable promiscuous mode: %s", esp_err_to_name(err));
        packet_monitor_shutdown();
        return 1;
    }
    packet_monitor_promiscuous_owned = true;

    BaseType_t task_ok = xTaskCreate(
        packet_monitor_task,
        "packet_monitor",
        2048,
        NULL,
        5,
        &packet_monitor_task_handle
    );

    if (task_ok != pdPASS) {
        packet_monitor_active = false;
        packet_monitor_task_handle = NULL;
        MY_LOG_INFO(TAG, "Failed to create packet monitor task.");
        packet_monitor_shutdown();
        return 1;
    }

    MY_LOG_INFO(TAG, "Packet monitor started on channel %ld. Type 'stop' to stop.", channel);

    esp_err_t led_err = led_set_color(255, 255, 255); // White for packet monitor
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for packet monitor: %s", esp_err_to_name(led_err));
    }
    return 0;
}

static int cmd_start_ap_locator(int argc, char **argv) {
    (void)argc;
    (void)argv;

    oled_display_update_full("> AP Locator", "  Preparing...", "  Selected AP", "  Locking...");
    log_memory_info("start_ap_locator");

    if (!ensure_wifi_mode()) {
        return 1;
    }

    if (ap_locator_active || ap_locator_task_handle != NULL) {
        MY_LOG_INFO(TAG, "AP locator already active. Use 'stop' to stop it first.");
        return 1;
    }

    if (g_selected_count != 1) {
        MY_LOG_INFO(TAG, "AP locator requires exactly one selected network. Use 'select_networks <index>'.");
        return 1;
    }

    if (!g_scan_done || g_scan_count == 0) {
        MY_LOG_INFO(TAG, "No scan results available. Run 'scan_networks' first.");
        return 1;
    }

    if (packet_monitor_active || packet_monitor_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Packet monitor is active. Use 'stop' first.");
        return 1;
    }

    if (channel_view_active || channel_view_task_handle != NULL || channel_view_scan_mode) {
        MY_LOG_INFO(TAG, "Channel view is active. Use 'stop' first.");
        return 1;
    }

    if (deauth_detector_active || deauth_detector_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Deauth detector is active. Use 'stop' first.");
        return 1;
    }

    if (sniffer_active || sniffer_scan_phase || sniffer_dog_active || sniffer_dog_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Sniffer operations are active. Use 'stop' first.");
        return 1;
    }

    if (wardrive_active || wardrive_task_handle != NULL || wardrive_promisc_active ||
        wardrive_promisc_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Wardrive is active. Use 'stop' first.");
        return 1;
    }

    if (handshake_attack_active || handshake_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Handshake attack is active. Use 'stop' first.");
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal is active. Use 'stop' first.");
        return 1;
    }

