brokali/projectZeroTouch/ESP32C5/main/main.c
    if (applicationState != IDLE) {
        MY_LOG_INFO(TAG, "Another attack is active. Use 'stop' first.");
        return 1;
    }

    if (g_scan_in_progress) {
        MY_LOG_INFO(TAG, "Scan is still in progress. Wait for it to finish or use 'stop'.");
        return 1;
    }

    int selected_idx = g_selected_indices[0];
    if (selected_idx < 0 || selected_idx >= (int)g_scan_count) {
        MY_LOG_INFO(TAG, "Selected network is out of range. Run 'scan_networks' and select again.");
        return 1;
    }

    const wifi_ap_record_t *target_ap = &g_scan_results[selected_idx];
    if (target_ap->primary < 1 || target_ap->primary > 165) {
        MY_LOG_INFO(TAG, "Selected AP has invalid channel %d.", target_ap->primary);
        return 1;
    }

    operation_stop_requested = false;
    memcpy(ap_locator_target_bssid, target_ap->bssid, sizeof(ap_locator_target_bssid));
    strncpy(ap_locator_target_ssid, (const char *)target_ap->ssid, sizeof(ap_locator_target_ssid) - 1);
    ap_locator_target_ssid[sizeof(ap_locator_target_ssid) - 1] = '\0';
    ap_locator_target_channel = target_ap->primary;
    ap_locator_last_rssi = target_ap->rssi;
    ap_locator_beacon_total = 0;
    ap_locator_beacon_seen = false;
    ap_locator_last_seen_us = 0;

    esp_err_t err;
    uint8_t primary = 1;
    wifi_second_chan_t secondary = WIFI_SECOND_CHAN_NONE;
    err = esp_wifi_get_channel(&primary, &secondary);
    if (err == ESP_OK) {
        ap_locator_prev_primary = primary;
        ap_locator_prev_secondary = secondary;
        ap_locator_has_prev_channel = true;
    } else {
        ap_locator_has_prev_channel = false;
    }

    wifi_promiscuous_filter_t filter = {
        .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT
    };

    esp_wifi_set_promiscuous(false);

    err = esp_wifi_set_promiscuous_filter(&filter);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP locator filter: %s", esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }

    err = esp_wifi_set_channel(ap_locator_target_channel, WIFI_SECOND_CHAN_NONE);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP locator channel %u: %s",
                    ap_locator_target_channel,
                    esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }

    err = esp_wifi_set_promiscuous_rx_cb(ap_locator_promiscuous_callback);
    if (err != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP locator callback: %s", esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }
    ap_locator_callback_installed = true;

    ap_locator_active = true;

    err = esp_wifi_set_promiscuous(true);
    if (err != ESP_OK) {
        ap_locator_active = false;
        MY_LOG_INFO(TAG, "Failed to enable promiscuous mode for AP locator: %s", esp_err_to_name(err));
        ap_locator_shutdown();
        return 1;
    }
    ap_locator_promiscuous_owned = true;

    BaseType_t task_ok = xTaskCreate(
        ap_locator_task,
        "ap_locator",
        3072,
        NULL,
        5,
        &ap_locator_task_handle
    );

    if (task_ok != pdPASS) {
        ap_locator_active = false;
        ap_locator_task_handle = NULL;
        MY_LOG_INFO(TAG, "Failed to create AP locator task.");
        ap_locator_shutdown();
        return 1;
    }

    esp_err_t led_err = led_set_color(0, 255, 0);
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for AP locator: %s", esp_err_to_name(led_err));
    }

    MY_LOG_INFO(TAG, "AP locator started for '%s' on channel %u. Type 'stop' to stop.",
                ap_locator_target_ssid[0] != '\0' ? ap_locator_target_ssid : "<hidden>",
                ap_locator_target_channel);
    return 0;
}

static void channel_view_publish_counts(void) {
    uint16_t counts24[CHANNEL_VIEW_24GHZ_CHANNEL_COUNT] = {0};
    uint16_t counts5[CHANNEL_VIEW_5GHZ_CHANNEL_COUNT] = {0};

    for (uint16_t i = 0; i < g_scan_count; ++i) {
        const wifi_ap_record_t *ap = &g_scan_results[i];
        uint8_t primary = ap->primary;
        if (primary >= 1 && primary <= 14) {
            counts24[primary - 1]++;
        } else {
            for (size_t idx = 0; idx < CHANNEL_VIEW_5GHZ_CHANNEL_COUNT; ++idx) {
                if (channel_view_5ghz_channels[idx] == primary) {
                    counts5[idx]++;
                    break;
                }
            }
        }
    }

    MY_LOG_INFO(TAG, "channel_view_start");
    MY_LOG_INFO(TAG, "band:24");
    for (size_t i = 0; i < CHANNEL_VIEW_24GHZ_CHANNEL_COUNT; ++i) {
        MY_LOG_INFO(TAG, "ch%u:%u", channel_view_24ghz_channels[i], counts24[i]);
    }
    MY_LOG_INFO(TAG, "band:5");
    for (size_t i = 0; i < CHANNEL_VIEW_5GHZ_CHANNEL_COUNT; ++i) {
        MY_LOG_INFO(TAG, "ch%u:%u", channel_view_5ghz_channels[i], counts5[i]);
    }
    MY_LOG_INFO(TAG, "channel_view_end");
}

static void channel_view_task(void *pvParameters) {
    (void)pvParameters;

    const TickType_t scan_delay = pdMS_TO_TICKS(CHANNEL_VIEW_SCAN_DELAY_MS);
    const TickType_t wait_slice = pdMS_TO_TICKS(100);

    int cv_scan_num = 0;
    
    while (channel_view_active && !operation_stop_requested) {
        oled_display_update_full("> Channel View", "  Scanning...", "  All channels", "  Analyzing...");
        
        esp_err_t err = start_background_scan(FAST_SCAN_MIN_TIME, FAST_SCAN_MAX_TIME);
        if (err != ESP_OK) {
            MY_LOG_INFO(TAG, "channel_view_error:scan_start %s", esp_err_to_name(err));
            break;
        }

        int wait_iterations = 0;
        while (channel_view_active && g_scan_in_progress &&
               wait_iterations < CHANNEL_VIEW_SCAN_TIMEOUT_ITERATIONS) {
            vTaskDelay(wait_slice);
            wait_iterations++;
        }

        if (!channel_view_active || operation_stop_requested) {
            break;
        }

        if (g_scan_in_progress) {
            MY_LOG_INFO(TAG, "channel_view_error:timeout");
            esp_wifi_scan_stop();
        } else {
            channel_view_publish_counts();
            cv_scan_num++;
            
            // Find busiest channel
            int busiest_ch = 0, busiest_count = 0;
            for (uint16_t ci = 0; ci < g_scan_count; ci++) {
                int ch = g_scan_results[ci].primary;
                int cnt = 0;
                for (uint16_t cj = 0; cj < g_scan_count; cj++) {
                    if (g_scan_results[cj].primary == ch) cnt++;
                }
                if (cnt > busiest_count) { busiest_count = cnt; busiest_ch = ch; }
            }
            
            char cv_l2[64], cv_l3[64], cv_l4[64];
            snprintf(cv_l2, sizeof(cv_l2), "  Found %d APs", g_scan_count);
            snprintf(cv_l3, sizeof(cv_l3), "  Busy: Ch%d (%d)", busiest_ch, busiest_count);
            snprintf(cv_l4, sizeof(cv_l4), "  Scan #%d", cv_scan_num);
            oled_display_update_full("> Channel View", cv_l2, cv_l3, cv_l4);
        }

        if (!channel_view_active || operation_stop_requested) {
            break;
        }

        vTaskDelay(scan_delay);
    }

    channel_view_scan_mode = false;
    channel_view_active = false;
    channel_view_task_handle = NULL;
    esp_err_t led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore LED after channel view: %s", esp_err_to_name(led_err));
    }
    MY_LOG_INFO(TAG, "Channel view monitor stopped.");
    vTaskDelete(NULL);
}

static void channel_view_stop(void) {
    if (!channel_view_active && channel_view_task_handle == NULL && !channel_view_scan_mode) {
        return;
    }

    channel_view_active = false;
    if (channel_view_scan_mode && g_scan_in_progress) {
        esp_wifi_scan_stop();
    }

