brokali/projectZeroTouch/ESP32C5/main/main.c
    for (int i = 0; i < 40 && channel_view_task_handle != NULL; ++i) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }

    if (channel_view_task_handle != NULL) {
        vTaskDelete(channel_view_task_handle);
        channel_view_task_handle = NULL;
    }

    channel_view_scan_mode = false;
    MY_LOG_INFO(TAG, "Channel view stopped.");
}

static int cmd_channel_view(int argc, char **argv) {
    (void)argc;
    (void)argv;
    oled_display_update_full("> Channel View", "  WiFi spectrum", "  All channels", "  Analyzing...");
    log_memory_info("channel_view");

    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }

    if (channel_view_active || channel_view_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Channel view already running. Use 'stop' to stop it first.");
        return 1;
    }

    if (packet_monitor_active || packet_monitor_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Packet monitor is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (sniffer_active || sniffer_scan_phase || sniffer_dog_active) {
        MY_LOG_INFO(TAG, "Sniffer operations are active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (wardrive_active) {
        MY_LOG_INFO(TAG, "Wardrive is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (applicationState != IDLE) {
        MY_LOG_INFO(TAG, "Another attack is active. Use 'stop' before starting channel view.");
        return 1;
    }

    if (g_scan_in_progress) {
        MY_LOG_INFO(TAG, "Scan already in progress. Wait for it to finish or use 'stop'.");
        return 1;
    }

    operation_stop_requested = false;
    channel_view_active = true;
    channel_view_scan_mode = true;
    BaseType_t task_ok =
        xTaskCreate(channel_view_task, "channel_view", 4096, NULL, 5, &channel_view_task_handle);

    if (task_ok != pdPASS) {
        channel_view_active = false;
        channel_view_scan_mode = false;
        channel_view_task_handle = NULL;
        MY_LOG_INFO(TAG, "Failed to create channel view task.");
        return 1;
    }

    esp_err_t led_err = led_set_color(128, 0, 255); // purple-ish to indicate analyzer
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for channel view: %s", esp_err_to_name(led_err));
    }

    MY_LOG_INFO(TAG, "Channel view started. Type 'stop' to stop it.");
    return 0;
}

static int cmd_start_sniffer(int argc, char **argv) {
    (void)argc; (void)argv;
    {
        char oled_target[48];
        if (g_selected_count > 0 && g_scan_done) {
            oled_build_target_summary(oled_target, sizeof(oled_target));
        } else {
            snprintf(oled_target, sizeof(oled_target), "  All networks");
        }
        oled_display_update_full("> Sniffer", oled_target, "  Promiscuous", "  Capturing...");
    }
    log_memory_info("start_sniffer");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;
    
    if (sniffer_active) {
        MY_LOG_INFO(TAG, "Sniffer already active. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Note: Sniffer results are preserved between sessions. Use 'clear_sniffer_results' to clear them.
    
    // Check if networks were selected
    if (g_selected_count > 0 && g_scan_done) {
        // Selected networks mode - skip scan, use selected networks only
        MY_LOG_INFO(TAG, "Starting sniffer in SELECTED NETWORKS mode...");
        MY_LOG_INFO(TAG, "Will monitor %d pre-selected network(s)", g_selected_count);
        
        sniffer_active = true;
        sniffer_scan_phase = false; // Skip scan phase
        sniffer_selected_mode = true;
        
        // Initialize sniffer with selected networks
        sniffer_init_selected_networks();
        
        if (sniffer_ap_count == 0 || sniffer_selected_channels_count == 0) {
            MY_LOG_INFO(TAG, "Failed to initialize selected networks for sniffer");
            sniffer_active = false;
            sniffer_selected_mode = false;
            return 1;
        }
        
        // Set LED to green for active sniffing
        esp_err_t led_err = led_set_color(0, 255, 0); // Green
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to set LED for sniffer: %s", esp_err_to_name(led_err));
        }
        
        // Set promiscuous filter
        esp_wifi_set_promiscuous_filter(&sniffer_filter);
        
        // Enable promiscuous mode
        esp_wifi_set_promiscuous_rx_cb(sniffer_promiscuous_callback);
        esp_wifi_set_promiscuous(true);
        
        // Initialize channel hopping with selected channels
        sniffer_channel_index = 0;
        sniffer_current_channel = sniffer_selected_channels[0];
        sniffer_last_channel_hop = esp_timer_get_time() / 1000;
        esp_wifi_set_channel(sniffer_current_channel, WIFI_SECOND_CHAN_NONE);
        
        // Start channel hopping task
        if (sniffer_channel_task_handle == NULL) {
            xTaskCreate(sniffer_channel_task, "sniffer_channel", 2048, NULL, 5, &sniffer_channel_task_handle);
            MY_LOG_INFO(TAG, "Started sniffer channel hopping task");
        }
        
        MY_LOG_INFO(TAG, "Sniffer: Now monitoring selected networks (no scan performed)");
        MY_LOG_INFO(TAG, "Use 'show_sniffer_results' to see captured clients or 'stop' to stop.");
        
    } else {
        // Normal mode - scan all networks
        MY_LOG_INFO(TAG, "Starting sniffer in NORMAL mode (scanning all networks)...");
        
        sniffer_active = true;
        sniffer_scan_phase = true;
        sniffer_selected_mode = false;
        
        // Set LED (ignore errors if LED is in invalid state)
        esp_err_t led_err = led_set_color(255, 255, 0); // Yellow
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to set LED for sniffer: %s", esp_err_to_name(led_err));
        }
        
        esp_err_t err = start_background_scan(FAST_SCAN_MIN_TIME, FAST_SCAN_MAX_TIME);
        if (err != ESP_OK) {
            sniffer_active = false;
            sniffer_scan_phase = false;
            sniffer_selected_mode = false;
            
            // Return LED to idle (ignore errors if LED is in invalid state)
            led_err = led_set_idle();
            if (led_err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to restore idle LED after sniffer failure: %s", esp_err_to_name(led_err));
            }
            
            MY_LOG_INFO(TAG, "Failed to start scan for sniffer: %s", esp_err_to_name(err));
            return 1;
        }
        
        MY_LOG_INFO(TAG, "Sniffer started - scanning networks...");
        MY_LOG_INFO(TAG, "Use 'show_sniffer_results' to see captured clients or 'stop' to stop.");
    }
    
