brokali/projectZeroTouch/ESP32C5/main/main.c
    return 0;
}

static void pcap_abort_start(void)
{
    pcap_capture_active = false;
    pcap_rate_limiter_stop();
    for (int i = 0; i < 40 && pcap_writer_task_handle != NULL; i++) {
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    if (pcap_writer_task_handle != NULL) {
        vTaskDelete(pcap_writer_task_handle);
        pcap_writer_task_handle = NULL;
    }
    if (pcap_packet_queue != NULL) {
        pcap_queued_frame_t *leftover = NULL;
        while (xQueueReceive(pcap_packet_queue, &leftover, 0) == pdTRUE) {
            heap_caps_free(leftover);
        }
        vQueueDelete(pcap_packet_queue);
        pcap_packet_queue = NULL;
    }
    if (pcap_capture_file != NULL) {
        fclose(pcap_capture_file);
        pcap_capture_file = NULL;
        sd_sync();
    }
    if (pcap_stdio_buffer != NULL) {
        heap_caps_free(pcap_stdio_buffer);
        pcap_stdio_buffer = NULL;
    }
    pcap_capture_mode = PCAP_MODE_NONE;
}

static bool pcap_normalize_basename(const char *requested, char *normalized,
                                    size_t normalized_size)
{
    if (requested == NULL || normalized == NULL || normalized_size < 6) {
        return false;
    }
    size_t length = strlen(requested);
    if (length == 0 || requested[0] == '.' || length > PCAP_BASENAME_MAX_LEN) {
        return false;
    }
    for (size_t i = 0; i < length; i++) {
        unsigned char c = (unsigned char)requested[i];
        if (!isalnum(c) && c != '.' && c != '_' && c != '-') {
            return false;
        }
    }

    bool has_extension = length >= 5 &&
                         strcasecmp(requested + length - 5, ".pcap") == 0;
    size_t final_length = length + (has_extension ? 0 : 5);
    if (final_length > PCAP_BASENAME_MAX_LEN || final_length >= normalized_size) {
        return false;
    }
    strlcpy(normalized, requested, normalized_size);
    if (!has_extension) {
        strlcat(normalized, ".pcap", normalized_size);
    }
    return true;
}

static int cmd_start_pcap(int argc, char **argv) {
    char requested_basename[PCAP_BASENAME_MAX_LEN + 1] = {0};
    strlcpy(requested_basename, pcap_next_basename, sizeof(requested_basename));
    pcap_next_basename[0] = '\0';
    pcap_capture_mode_t mode = PCAP_MODE_RADIO;

    if (argc >= 2) {
        if (strcasecmp(argv[1], "net") == 0) {
            mode = PCAP_MODE_NET;
        } else if (strcasecmp(argv[1], "radio") == 0) {
            mode = PCAP_MODE_RADIO;
        } else if (strcasecmp(argv[1], "gateway") == 0) {
            mode = PCAP_MODE_GATEWAY;
        } else {
            MY_LOG_INFO(TAG, "Usage: start_pcap radio|net|gateway");
            return 1;
        }
    }

    if (pcap_capture_active) {
        if (mode == PCAP_MODE_GATEWAY && pcap_capture_mode == PCAP_MODE_GATEWAY &&
            capture_gateway_is_active()) {
            MY_LOG_INFO(TAG, "Gateway PCAP is already armed -> %s",
                        pcap_capture_filepath);
            return 0;
        }
        MY_LOG_INFO(TAG, "PCAP capture already active. Use 'stop' first.");
        return 1;
    }

    if (mode == PCAP_MODE_GATEWAY && !capture_gateway_is_active()) {
        MY_LOG_INFO(TAG, "Capture Gateway is not active. Start it before 'start_pcap gateway'.");
        return 1;
    }
    if (mode != PCAP_MODE_GATEWAY && capture_gateway_is_active()) {
        MY_LOG_INFO(TAG, "Capture Gateway is active; only 'start_pcap gateway' is allowed.");
        return 1;
    }

    operation_stop_requested = false;

    if (mode == PCAP_MODE_NET) {
        wifi_ap_record_t ap_info;
        if (esp_wifi_sta_get_ap_info(&ap_info) != ESP_OK) {
            MY_LOG_INFO(TAG, "Not connected to WiFi. Use 'wifi_connect' first.");
            return 1;
        }
    }

    if (mode == PCAP_MODE_RADIO) {
        if (!ensure_wifi_mode()) {
            MY_LOG_INFO(TAG, "Failed to initialize WiFi for radio capture.");
            return 1;
        }
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    struct stat st;
    if (stat(PCAP_CAPTURE_DIR, &st) != 0) {
        if (mkdir(PCAP_CAPTURE_DIR, 0755) != 0) {
            MY_LOG_INFO(TAG, "Failed to create %s directory", PCAP_CAPTURE_DIR);
            return 1;
        }
        sd_sync();
    }

    if (requested_basename[0] != '\0') {
        snprintf(pcap_capture_filepath, sizeof(pcap_capture_filepath),
                 PCAP_CAPTURE_DIR "/%s", requested_basename);
        if (stat(pcap_capture_filepath, &st) == 0) {
            MY_LOG_INFO(TAG, "PCAP file already exists; refusing to overwrite: %s",
                        pcap_capture_filepath);
            return 1;
        }
    } else {
        int file_num = find_next_pcap_file_number();
        snprintf(pcap_capture_filepath, sizeof(pcap_capture_filepath),
                 PCAP_CAPTURE_DIR "/sniff_%d.pcap", file_num);
    }

    pcap_capture_file = fopen(pcap_capture_filepath, "wb");
    if (!pcap_capture_file) {
        MY_LOG_INFO(TAG, "Failed to open %s for writing", pcap_capture_filepath);
        return 1;
    }

    pcap_stdio_buffer = heap_caps_malloc(PCAP_WRITE_BATCH_SIZE,
                                         MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (pcap_stdio_buffer == NULL) {
        pcap_stdio_buffer = heap_caps_malloc(PCAP_WRITE_BATCH_SIZE,
                                             MALLOC_CAP_8BIT);
    }
    if (pcap_stdio_buffer == NULL ||
        setvbuf(pcap_capture_file, (char *)pcap_stdio_buffer, _IOFBF,
                PCAP_WRITE_BATCH_SIZE) != 0) {
        MY_LOG_INFO(TAG, "Failed to allocate/configure PCAP write buffer");
        if (pcap_stdio_buffer != NULL) {
            heap_caps_free(pcap_stdio_buffer);
            pcap_stdio_buffer = NULL;
        }
        fclose(pcap_capture_file);
        pcap_capture_file = NULL;
        return 1;
    }

    uint32_t linktype = (mode == PCAP_MODE_RADIO) ? 105 : 1;
    pcap_global_header_t ghdr = {
        .magic_number = 0xa1b2c3d4,
        .version_major = 2,
        .version_minor = 4,
        .thiszone = 0,
        .sigfigs = 0,
        .snaplen = 65535,
        .network = linktype
    };
    size_t header_written = fwrite(&ghdr, 1, sizeof(ghdr), pcap_capture_file);
    if (header_written != sizeof(ghdr)) {
        MY_LOG_INFO(TAG, "Failed to write PCAP header to %s", pcap_capture_filepath);
        fclose(pcap_capture_file);
        pcap_capture_file = NULL;
        heap_caps_free(pcap_stdio_buffer);
        pcap_stdio_buffer = NULL;
        return 1;
    }
    fflush(pcap_capture_file);

    portENTER_CRITICAL(&pcap_stats_lock);
    pcap_capture_frame_count = 0;
    pcap_capture_drop_count = 0;
    pcap_capture_drop_alloc_count = 0;
    pcap_capture_drop_queue_count = 0;
    pcap_capture_drop_write_count = 0;
    pcap_capture_queue_high_water = 0;
    pcap_capture_file_byte_count = header_written;
    pcap_rate_queue_drop_count = 0;
    pcap_rate_queue_high_water = 0;
    pcap_rate_effective_kbps = mode == PCAP_MODE_GATEWAY
                                   ? PCAP_GATEWAY_RATE_LIMIT_KBPS
                                   : 0;
    pcap_rate_throttle_event_count = 0;
    pcap_rate_pause_event_count = 0;
    pcap_gateway_filtered_frame_count = 0;
    portEXIT_CRITICAL(&pcap_stats_lock);

    pcap_packet_queue = xQueueCreate(PCAP_PACKET_QUEUE_LENGTH,
                                     sizeof(pcap_queued_frame_t *));
    if (!pcap_packet_queue) {
        MY_LOG_INFO(TAG, "Failed to create PCAP packet queue");
        fclose(pcap_capture_file);
        pcap_capture_file = NULL;
        heap_caps_free(pcap_stdio_buffer);
        pcap_stdio_buffer = NULL;
        return 1;
    }

