brokali/projectZeroTouch/ESP32C5/main/main.c
        if (mode == PCAP_MODE_GATEWAY && !pcap_rate_limiter_start()) {
            lwip_nif->input = pcap_original_input;
            lwip_nif->linkoutput = pcap_original_linkoutput;
            pcap_original_input = NULL;
            pcap_original_linkoutput = NULL;
            pcap_hooked_netif = NULL;
            MY_LOG_INFO(TAG, "Capture Gateway rate limiter failed to start");
            pcap_abort_start();
            return 1;
        }

        if (mode == PCAP_MODE_GATEWAY) {
            esp_netif_ip_info_t ap_ip = {0};
            esp_netif_get_ip_info(capture_netif, &ap_ip);
            capture_gateway_status_t cgw = {0};
            capture_gateway_get_status(&cgw);
            oled_display_update_full("> PCAP Gateway", "  AP pre-NAT", "  Ethernet RX/TX",
                                     pcap_capture_filepath + 18);
            MY_LOG_INFO(TAG, "PCAP gateway capture started on downstream AP -> %s",
                        pcap_capture_filepath);
            MY_LOG_INFO(TAG,
                        "PCAP gateway hooked netif AP IP=" IPSTR " (pre-NAT SoftAP only; no STA ARP-spoof)",
                        IP2STR(&ap_ip.ip));
            MY_LOG_INFO(TAG,
                        "PCAP gateway DNS: downstream_dns=" IPSTR " upstream_dns=" IPSTR " dns_proxy=%s",
                        IP2STR(&cgw.advertised_dns.ip.u_addr.ip4),
                        IP2STR(&cgw.upstream_dns.ip.u_addr.ip4),
                        cgw.dns_proxy ? "on" : "off");
            MY_LOG_INFO(TAG, "Capture Gateway adaptive traffic ceiling: %lu kbps",
                        (unsigned long)PCAP_GATEWAY_RATE_LIMIT_KBPS);
        } else {
            char oled_l3[32];
            snprintf(oled_l3, sizeof(oled_l3), "  MITM %d hosts", pcap_arp_host_count);
            oled_display_update_full("> PCAP Net", "  Ethernet RX/TX", oled_l3, pcap_capture_filepath + 18);
            MY_LOG_INFO(TAG, "PCAP net capture started -> %s", pcap_capture_filepath);
        }
    }

    MY_LOG_INFO(TAG, "Use 'stop' to stop capture and save file.");
    return 0;
}

static int cmd_start_sniffer_noscan(int argc, char **argv) {
    (void)argc; (void)argv;
    {
        char oled_l3[32];
        snprintf(oled_l3, sizeof(oled_l3), "  %u networks", g_scan_count);
        oled_display_update_full("> Sniffer", "  Prior scan data", oled_l3, "  Capturing...");
    }
    log_memory_info("start_sniffer_noscan");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Reset stop flag
    operation_stop_requested = false;
    
    if (sniffer_active) {
        MY_LOG_INFO(TAG, "Sniffer already active. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Check if scan was previously performed
    if (!g_scan_done || g_scan_count == 0) {
        MY_LOG_INFO(TAG, "Please scan_networks first.");
        return 1;
    }
    
    MY_LOG_INFO(TAG, "Starting sniffer using existing scan results (%u networks)...", g_scan_count);
    
    // Note: Sniffer results are preserved between sessions. Use 'clear_sniffer_results' to clear them.
    bool had_sniffer_data = (sniffer_ap_count > 0 || probe_request_count > 0);
    
    sniffer_active = true;
    sniffer_scan_phase = false;
    sniffer_selected_mode = false;
    
    // Process existing scan results while preserving sniffer data when possible
    if (had_sniffer_data) {
        sniffer_merge_scan_results();
    } else {
        sniffer_process_scan_results();
    }
    
    // Set promiscuous filter
    esp_wifi_set_promiscuous_filter(&sniffer_filter);
    
    // Enable promiscuous mode
    esp_wifi_set_promiscuous_rx_cb(sniffer_promiscuous_callback);
    esp_wifi_set_promiscuous(true);
    
    // Initialize dual-band channel hopping
    sniffer_channel_index = 0;
    sniffer_current_channel = dual_band_channels[sniffer_channel_index];
    sniffer_last_channel_hop = esp_timer_get_time() / 1000;
    esp_wifi_set_channel(sniffer_current_channel, WIFI_SECOND_CHAN_NONE);
    
    // Start channel hopping task
    if (sniffer_channel_task_handle == NULL) {
        xTaskCreate(sniffer_channel_task, "sniffer_channel", 2048, NULL, 5, &sniffer_channel_task_handle);
        MY_LOG_INFO(TAG, "Started sniffer channel hopping task");
    }
    
    // Set LED to green for active sniffing
    esp_err_t led_err = led_set_color(0, 255, 0);
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for sniffer: %s", esp_err_to_name(led_err));
    }
    
    MY_LOG_INFO(TAG, "Sniffer: Now monitoring %d networks (no scan performed)", sniffer_ap_count);
    MY_LOG_INFO(TAG, "Use 'show_sniffer_results' to see captured clients or 'stop' to stop.");
    
    return 0;
}

static int cmd_show_sniffer_results(int argc, char **argv) {
    (void)argc; (void)argv;
    
    // Allow showing results even after sniffer is stopped
    if (sniffer_active && sniffer_scan_phase) {
        MY_LOG_INFO(TAG, "Sniffer is still scanning networks. Please wait...");
        return 0;
    }
    
    if (sniffer_ap_count == 0) {
        MY_LOG_INFO(TAG, "No sniffer data available. Use 'start_sniffer' to collect data.");
        return 0;
    }
    
    // Create a sorted array of AP indices by client count (descending)
    int sorted_indices[MAX_SNIFFER_APS];
    for (int i = 0; i < sniffer_ap_count; i++) {
        sorted_indices[i] = i;
    }
    
    // Simple bubble sort by client count (descending)
    for (int i = 0; i < sniffer_ap_count - 1; i++) {
        for (int j = 0; j < sniffer_ap_count - i - 1; j++) {
            if (sniffer_aps[sorted_indices[j]].client_count < sniffer_aps[sorted_indices[j + 1]].client_count) {
                int temp = sorted_indices[j];
                sorted_indices[j] = sorted_indices[j + 1];
                sorted_indices[j + 1] = temp;
            }
        }
    }
    
    // Compact format for Flipper Zero display
    int displayed_count = 0;
    for (int i = 0; i < sniffer_ap_count; i++) {
        int idx = sorted_indices[i];
        sniffer_ap_t *ap = &sniffer_aps[idx];
        
        // Skip broadcast BSSID and our own device
        if (is_broadcast_bssid(ap->bssid) || is_own_device_mac(ap->bssid)) {
            continue;
        }
        
        // Skip APs with no clients
        if (ap->client_count == 0) {
            continue;
        }
        
        displayed_count++;
        
        // Print AP info in compact format: SSID, CH: CLIENT_COUNT
        printf("%s, CH%d: %d\n", ap->ssid, ap->channel, ap->client_count);
        
        // Print each client MAC on a separate line with 1 space indentation
        if (ap->client_count > 0) {
            for (int j = 0; j < ap->client_count; j++) {
                sniffer_client_t *client = &ap->clients[j];
                printf(" %02X:%02X:%02X:%02X:%02X:%02X\n",
                       client->mac[0], client->mac[1], client->mac[2],
                       client->mac[3], client->mac[4], client->mac[5]);
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(20)); // Small delay to avoid overwhelming UART
    }
    
    if (displayed_count == 0) {
        MY_LOG_INFO(TAG, "No APs with clients found.");
    }
    
