brokali/projectZeroTouch/ESP32C5/main/main.c
            // Validate index
            if (idx < 0 || idx >= (int)g_scan_count) {
                MY_LOG_INFO(TAG, "Invalid index %d (valid: 1-%d), skipping", user_idx, g_scan_count);
                continue;
            }
            
            wifi_ap_record_t *ap = &g_scan_results[idx];
            int channel = ap->primary;
            
            // Check if channel already in list
            bool channel_exists = false;
            for (int j = 0; j < deauth_detector_selected_channels_count; j++) {
                if (deauth_detector_selected_channels[j] == channel) {
                    channel_exists = true;
                    break;
                }
            }
            
            if (!channel_exists && deauth_detector_selected_channels_count < MAX_AP_CNT) {
                deauth_detector_selected_channels[deauth_detector_selected_channels_count++] = channel;
                MY_LOG_INFO(TAG, "  Added: %s (ch %d)", ap->ssid, channel);
            }
        }
        
        if (deauth_detector_selected_channels_count == 0) {
            MY_LOG_INFO(TAG, "No valid channels selected. Aborting.");
            return 1;
        }
        
        deauth_detector_selected_mode = true;
        
        // Build channel list string for display
        char channel_list[128] = {0};
        int offset = 0;
        for (int i = 0; i < deauth_detector_selected_channels_count && offset < 120; i++) {
            offset += snprintf(channel_list + offset, sizeof(channel_list) - offset,
                             "%d%s", deauth_detector_selected_channels[i],
                             (i < deauth_detector_selected_channels_count - 1) ? ", " : "");
        }
        MY_LOG_INFO(TAG, "Monitoring %d channel(s): [%s]", deauth_detector_selected_channels_count, channel_list);
        
    } else {
        // MODE A: No arguments - scan first, then monitor all channels
        MY_LOG_INFO(TAG, "Starting Deauth Detector in SCAN mode...");
        MY_LOG_INFO(TAG, "Scanning networks first...");
        
        // Start WiFi scan with configurable timings
        esp_err_t err = start_background_scan(g_scan_min_channel_time, g_scan_max_channel_time);
        if (err != ESP_OK) {
            if (err == ESP_ERR_INVALID_STATE) {
                MY_LOG_INFO(TAG, "Scan already in progress. Please wait or use 'stop'.");
            } else {
                MY_LOG_INFO(TAG, "Failed to start scan: %s", esp_err_to_name(err));
            }
            return 1;
        }
        
        // Wait for scan to complete (with timeout)
        int timeout_iterations = 0;
        while (g_scan_in_progress && timeout_iterations < 200) { // 20 seconds max (200 * 100ms)
            vTaskDelay(pdMS_TO_TICKS(100));
            timeout_iterations++;
            
            // Check for stop request
            if (operation_stop_requested) {
                MY_LOG_INFO(TAG, "Scan cancelled by user.");
                return 1;
            }
        }
        
        if (g_scan_in_progress) {
            MY_LOG_INFO(TAG, "Scan timed out. Try again later.");
            esp_wifi_scan_stop(); // Force stop the scan
            return 1;
        }
        
        // Verify scan actually completed with results
        if (!g_scan_done || g_scan_count == 0) {
            MY_LOG_INFO(TAG, "No scan results available. Try 'scan_networks' first.");
            return 1;
        }
        
        MY_LOG_INFO(TAG, "Found %d networks.", g_scan_count);
        deauth_detector_selected_mode = false;
    }
    
    // Activate deauth_detector
    deauth_detector_active = true;
    
    // Set LED to yellow (monitoring mode)
    esp_err_t led_err = led_set_color(255, 255, 0); // Yellow
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for Deauth Detector: %s", esp_err_to_name(led_err));
    }
    
    // Set promiscuous filter for MGMT frames only (deauth is a management frame)
    wifi_promiscuous_filter_t mgmt_filter = {
        .filter_mask = WIFI_PROMIS_FILTER_MASK_MGMT
    };
    esp_wifi_set_promiscuous_filter(&mgmt_filter);
    
    // Enable promiscuous mode with deauth_detector callback
    esp_wifi_set_promiscuous_rx_cb(deauth_detector_promiscuous_callback);
    esp_wifi_set_promiscuous(true);
    
    // Initialize channel hopping
    deauth_detector_channel_index = 0;
    if (deauth_detector_selected_mode && deauth_detector_selected_channels_count > 0) {
        deauth_detector_current_channel = deauth_detector_selected_channels[0];
    } else {
        deauth_detector_current_channel = dual_band_channels[0];
    }
    esp_wifi_set_channel(deauth_detector_current_channel, WIFI_SECOND_CHAN_NONE);
    deauth_detector_last_channel_hop = esp_timer_get_time() / 1000;
    
    // Create channel hopping task (stack must be in internal RAM on ESP32-C5)
    BaseType_t task_created = xTaskCreate(
        deauth_detector_task,
        "deauth_det",
        4096,
        NULL,
        5,
        &deauth_detector_task_handle
    );
    
    if (task_created != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create Deauth Detector channel hopping task");
        deauth_detector_active = false;
        esp_wifi_set_promiscuous(false);
        
        // Return LED to idle
        led_err = led_set_idle();
        if (led_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to restore idle LED after Deauth Detector failure: %s", esp_err_to_name(led_err));
        }
        
        return 1;
    }
    
    if (deauth_detector_selected_mode) {
        MY_LOG_INFO(TAG, "Deauth Detector started - monitoring selected channels for deauth frames...");
    } else {
        MY_LOG_INFO(TAG, "Deauth Detector started - scanning all channels for deauth frames...");
    }
    MY_LOG_INFO(TAG, "Output: [DEAUTH] CH: <ch> | AP: <name> (<bssid>) | RSSI: <rssi>");
    MY_LOG_INFO(TAG, "Use 'stop' to stop.");
    
    return 0;
}

static int cmd_download(int argc, char **argv) {
    (void)argc;
    (void)argv;

#if HAS_RTC_CNTL_REG && defined(RTC_CNTL_OPTION1_REG) && defined(RTC_CNTL_FORCE_DOWNLOAD_BOOT)
    MY_LOG_INFO(TAG, "Preparing to enter UART download mode. Stopping tasks...");
    (void)cmd_stop(0, NULL);

    // Give Wi-Fi stack a moment to settle before rebooting
    esp_wifi_stop();
    vTaskDelay(pdMS_TO_TICKS(50));

    // Force next boot into the ROM download (serial flashing) mode
    REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
#if defined(RTC_CNTL_SW_CPU_STALL_REG)
    REG_WRITE(RTC_CNTL_SW_CPU_STALL_REG, 0);
#endif
    MY_LOG_INFO(TAG, "Rebooting into download mode. Connect via UART/USB-UART bridge to flash.");
    esp_rom_software_reset_system();

