brokali/projectZeroTouch/ESP32C5/main/main.c
    // Should never reach here
    return 0;
#elif HAS_LP_AON_REG && defined(LP_AON_SYS_CFG_REG) && defined(LP_AON_FORCE_DOWNLOAD_BOOT) && defined(LP_AON_FORCE_DOWNLOAD_BOOT_S) && defined(LP_AON_FORCE_DOWNLOAD_BOOT_M)
    MY_LOG_INFO(TAG, "Preparing to enter UART/USB download mode (LP AON). Stopping tasks...");
    (void)cmd_stop(0, NULL);

    esp_wifi_stop();
    vTaskDelay(pdMS_TO_TICKS(50));

    // Set LP_AON_FORCE_DOWNLOAD_BOOT to 01 (boot0 download)
    uint32_t cfg = REG_READ(LP_AON_SYS_CFG_REG);
    cfg &= ~LP_AON_FORCE_DOWNLOAD_BOOT_M;
    cfg |= (1U << LP_AON_FORCE_DOWNLOAD_BOOT_S);
    REG_WRITE(LP_AON_SYS_CFG_REG, cfg);

    MY_LOG_INFO(TAG, "Rebooting into download mode (LP AON). Connect via UART/USB-UART bridge to flash.");
    esp_rom_software_reset_system();
    return 0;
#else
    MY_LOG_INFO(TAG, "Download mode forcing not supported on this target/SDK.");
    return 1;
#endif
}

static int cmd_reboot(int argc, char **argv)
{
    (void)argc; (void)argv;
    oled_display_update_full("> Reboot", "  Unmount SD...", "", "  Restarting...");
    MY_LOG_INFO(TAG,"Restart...");
    safe_restart();  // unmount SD card before restart
    return 0;
}

static int cmd_ping(int argc, char **argv) {
    (void)argc; (void)argv;
    MY_LOG_INFO(TAG, "pong");
    return 0;
}

static int cmd_version(int argc, char **argv) {
    (void)argc; (void)argv;
    MY_LOG_INFO(TAG, "JanOS version: " JANOS_VERSION);
    return 0;
}

static int cmd_led(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: led set <on|off> | led level <1-100> | led read");
        return 1;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: led set <on|off>");
            return 1;
        }

        if (strcasecmp(argv[2], "on") == 0) {
            esp_err_t err = led_set_enabled(true);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to enable LED: %s", esp_err_to_name(err));
                return 1;
            }
            err = led_set_idle();
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to set LED idle color: %s", esp_err_to_name(err));
                return 1;
            }
            led_persist_state();
            MY_LOG_INFO(TAG, "LED turned on (brightness %u%%)", led_brightness_percent);
            return 0;
        } else if (strcasecmp(argv[2], "off") == 0) {
            esp_err_t err = led_set_enabled(false);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "Failed to disable LED: %s", esp_err_to_name(err));
                return 1;
            }
            led_persist_state();
            MY_LOG_INFO(TAG, "LED turned off (previous brightness %u%% stored)", led_brightness_percent);
            return 0;
        }

        MY_LOG_INFO(TAG, "Usage: led set <on|off>");
        return 1;
    }

    if (strcasecmp(argv[1], "level") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: led level <1-100>");
            return 1;
        }

        int level = atoi(argv[2]);
        if (level < (int)LED_BRIGHTNESS_MIN || level > (int)LED_BRIGHTNESS_MAX) {
            MY_LOG_INFO(TAG, "Brightness must be between %u and %u", LED_BRIGHTNESS_MIN, LED_BRIGHTNESS_MAX);
            return 1;
        }

        esp_err_t err = led_set_brightness((uint8_t)level);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to set LED brightness: %s", esp_err_to_name(err));
            return 1;
        }
        led_persist_state();

        if (led_is_enabled()) {
            MY_LOG_INFO(TAG, "LED brightness set to %d%%", level);
        } else {
            MY_LOG_INFO(TAG, "LED brightness set to %d%% (LED currently off)", level);
        }
        return 0;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        MY_LOG_INFO(TAG, "LED status: %s, brightness %u%%", led_is_enabled() ? "on" : "off", led_brightness_percent);
        return 0;
    }

    MY_LOG_INFO(TAG, "Usage: led set <on|off> | led level <1-100> | led read");
    return 1;
}

static int cmd_channel_time(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: channel_time set <min|max> <ms> | channel_time read <min|max>");
        return 1;
    }

    if (strcasecmp(argv[1], "set") == 0) {
        if (argc < 4) {
            MY_LOG_INFO(TAG, "Usage: channel_time set <min|max> <ms>");
            return 1;
        }
        
        int value = atoi(argv[3]);
        if (value < 1) {
            MY_LOG_INFO(TAG, "Value must be at least 1 ms");
            return 1;
        }

        if (strcasecmp(argv[2], "min") == 0) {
            if (value > CHANNEL_TIME_MIN_LIMIT) {
                MY_LOG_INFO(TAG, "Value %d exceeds limit, setting to max allowed %d ms", value, CHANNEL_TIME_MIN_LIMIT);
                value = CHANNEL_TIME_MIN_LIMIT;
            }
            g_scan_min_channel_time = (uint32_t)value;
            if (g_scan_min_channel_time > g_scan_max_channel_time) {
                g_scan_max_channel_time = g_scan_min_channel_time;
                MY_LOG_INFO(TAG, "Min channel time set to %u ms (max adjusted to %u ms)", 
                            (unsigned int)g_scan_min_channel_time, (unsigned int)g_scan_max_channel_time);
            } else {
                MY_LOG_INFO(TAG, "Min channel time set to %u ms", (unsigned int)g_scan_min_channel_time);
            }
            channel_time_persist_state();
            return 0;
        } else if (strcasecmp(argv[2], "max") == 0) {
            if (value > CHANNEL_TIME_MAX_LIMIT) {
                MY_LOG_INFO(TAG, "Value %d exceeds limit, setting to max allowed %d ms", value, CHANNEL_TIME_MAX_LIMIT);
                value = CHANNEL_TIME_MAX_LIMIT;
            }
            g_scan_max_channel_time = (uint32_t)value;
            if (g_scan_max_channel_time < g_scan_min_channel_time) {
                g_scan_min_channel_time = g_scan_max_channel_time;
                MY_LOG_INFO(TAG, "Max channel time set to %u ms (min adjusted to %u ms)", 
                            (unsigned int)g_scan_max_channel_time, (unsigned int)g_scan_min_channel_time);
            } else {
                MY_LOG_INFO(TAG, "Max channel time set to %u ms", (unsigned int)g_scan_max_channel_time);
            }
            channel_time_persist_state();
            return 0;
        }
        MY_LOG_INFO(TAG, "Usage: channel_time set <min|max> <ms>");
        return 1;
    }

    if (strcasecmp(argv[1], "read") == 0) {
        if (argc < 3) {
            MY_LOG_INFO(TAG, "Usage: channel_time read <min|max>");
            return 1;
        }
        if (strcasecmp(argv[2], "min") == 0) {
            MY_LOG_INFO(TAG, "%u", (unsigned int)g_scan_min_channel_time);
            return 0;
        } else if (strcasecmp(argv[2], "max") == 0) {
            MY_LOG_INFO(TAG, "%u", (unsigned int)g_scan_max_channel_time);
            return 0;
        }
        MY_LOG_INFO(TAG, "Usage: channel_time read <min|max>");
        return 1;
    }

