brokali/projectZeroTouch/ESP32C5/main/main.c
    char line[96];
    int idx = 0;
    while (fgets(line, sizeof(line), f)) {
        char *start = line;
        while (*start && isspace((unsigned char)*start)) start++;
        char *end = start + strlen(start);
        while (end > start && (end[-1] == '\n' || end[-1] == '\r')) *--end = '\0';
        while (end > start && isspace((unsigned char)end[-1])) *--end = '\0';
        if (*start == '\0') continue;
        idx++;
        printf("%d %s\n", idx, start);
    }
    fclose(f);

    if (idx == 0) {
        MY_LOG_INFO(TAG, "ssids.txt is empty.");
    }
    return 0;
}

static int cmd_add_ssid(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: add_ssid <SSID>");
        return 1;
    }

    int len = strlen(argv[1]);
    if (len == 0 || len > MAX_SSID_NAME_LEN) {
        MY_LOG_INFO(TAG, "SSID length must be 1-%d characters", MAX_SSID_NAME_LEN);
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    FILE *f = fopen(SSIDS_FILE_PATH, "a");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "Failed to open ssids.txt for writing");
        return 1;
    }
    fprintf(f, "%s\n", argv[1]);
    fclose(f);
    sd_sync();

    MY_LOG_INFO(TAG, "Added SSID: %s", argv[1]);
    return 0;
}

static int cmd_remove_ssid(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: remove_ssid <index>");
        return 1;
    }

    int target = atoi(argv[1]);
    if (target < 1) {
        MY_LOG_INFO(TAG, "Index must be >= 1");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char lines[MAX_SSID_PRESETS][MAX_SSID_NAME_LEN + 1];
    int count = 0;
    {
        FILE *rf = fopen(SSIDS_FILE_PATH, "r");
        if (rf == NULL) {
            MY_LOG_INFO(TAG, "ssids.txt not found on SD card.");
            return 1;
        }
        char line[96];
        while (count < MAX_SSID_PRESETS && fgets(line, sizeof(line), rf)) {
            char *s = line;
            while (*s && isspace((unsigned char)*s)) s++;
            char *e = s + strlen(s);
            while (e > s && (e[-1] == '\n' || e[-1] == '\r')) *--e = '\0';
            while (e > s && isspace((unsigned char)e[-1])) *--e = '\0';
            if (*s == '\0') continue;
            strncpy(lines[count], s, MAX_SSID_NAME_LEN);
            lines[count][MAX_SSID_NAME_LEN] = '\0';
            count++;
        }
        fclose(rf);
    }

    if (target > count) {
        MY_LOG_INFO(TAG, "Index %d out of range (1-%d)", target, count);
        return 1;
    }

    MY_LOG_INFO(TAG, "Removing SSID %d: %s", target, lines[target - 1]);

    FILE *f = fopen(SSIDS_FILE_PATH, "w");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "Failed to open ssids.txt for writing");
        return 1;
    }
    for (int i = 0; i < count; i++) {
        if (i == target - 1) continue;
        fprintf(f, "%s\n", lines[i]);
    }
    fclose(f);
    sd_sync();

    MY_LOG_INFO(TAG, "SSID removed. %d SSIDs remaining.", count - 1);
    return 0;
}

// ---- Home networks (home.txt) for wardrive auto-upload ----
// File format: "SSID", "password", "BSSID" (one per line, quoted; BSSID optional/empty).
// BSSID lets us match hidden networks (empty SSID in the wardrive stream) by MAC.

// Load home networks from home.txt. Returns entry count, or -1 if file missing.
static int load_home_networks(char ssids[][33], char passes[][65], char bssids[][18], int max_entries) {
    FILE *f = fopen(HOME_FILE_PATH, "r");
    if (f == NULL) {
        return -1;
    }
    int count = 0;
    char line[256];
    while (count < max_entries && fgets(line, sizeof(line), f)) {
        char ssid[64];
        char pass[96];
        char bssid[32];
        if (!csv_get_quoted_field(line, 0, ssid, sizeof(ssid)) || ssid[0] == '\0') {
            continue;
        }
        if (!csv_get_quoted_field(line, 1, pass, sizeof(pass))) {
            pass[0] = '\0';
        }
        if (!csv_get_quoted_field(line, 2, bssid, sizeof(bssid))) {
            bssid[0] = '\0';
        }
        strncpy(ssids[count], ssid, 32); ssids[count][32] = '\0';
        strncpy(passes[count], pass, 64); passes[count][64] = '\0';
        strncpy(bssids[count], bssid, 17); bssids[count][17] = '\0';
        count++;
    }
    fclose(f);
    return count;
}

// Rewrite the whole home.txt from the in-memory arrays. Returns true on success.
static bool home_write_all(char ssids[][33], char passes[][65], char bssids[][18], int count) {
    FILE *f = fopen(HOME_FILE_PATH, "w");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "Failed to open home.txt for writing");
        return false;
    }
    for (int i = 0; i < count; i++) {
        fprintf(f, "\"%s\", \"%s\", \"%s\"\n", ssids[i], passes[i], bssids[i]);
    }
    fflush(f);
    fclose(f);
    sd_sync();
    return true;
}

static int cmd_home_list(int argc, char **argv) {
    (void)argc; (void)argv;

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char ssids[MAX_HOME_NETWORKS][33];
    char passes[MAX_HOME_NETWORKS][65];
    char bssids[MAX_HOME_NETWORKS][18];
    int count = load_home_networks(ssids, passes, bssids, MAX_HOME_NETWORKS);
    if (count < 0) {
        count = 0;  // no file yet == empty list
    }

    MY_LOG_INFO(TAG, "Home networks:");
    for (int i = 0; i < count; i++) {
        printf("%d \"%s\" \"%s\"\n", i + 1, ssids[i], bssids[i]);
    }
    MY_LOG_INFO(TAG, "Home networks printed");
    return 0;
}

static int cmd_home_add(int argc, char **argv) {
    if (argc < 3) {
        MY_LOG_INFO(TAG, "Usage: home_add \"<SSID>\" \"<password>\" [BSSID]");
        return 1;
    }

    const char *ssid = argv[1];
    const char *pass = argv[2];
    const char *bssid = (argc >= 4) ? argv[3] : "";
    size_t ssid_len = strlen(ssid);
    if (ssid_len == 0 || ssid_len > 32) {
        MY_LOG_INFO(TAG, "SSID length must be 1-32 characters");
        return 1;
    }
    if (strlen(pass) > 64) {
        MY_LOG_INFO(TAG, "Password too long (max 64 characters)");
        return 1;
    }
    if (strlen(bssid) > 17) {
        MY_LOG_INFO(TAG, "BSSID too long (expected AA:BB:CC:DD:EE:FF)");
        return 1;
    }

