brokali/projectZeroTouch/ESP32C5/main/main.c
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char ssids[MAX_HOME_NETWORKS][33];
    char passes[MAX_HOME_NETWORKS][65];
    char bssids[MAX_HOME_NETWORKS][18];
    int count = load_home_networks(ssids, passes, bssids, MAX_HOME_NETWORKS);
    if (count < 0) {
        count = 0;  // file not present yet, start fresh
    }

    // Update in place if the SSID is already known.
    for (int i = 0; i < count; i++) {
        if (strcmp(ssids[i], ssid) == 0) {
            strncpy(passes[i], pass, 64); passes[i][64] = '\0';
            strncpy(bssids[i], bssid, 17); bssids[i][17] = '\0';
            if (!home_write_all(ssids, passes, bssids, count)) {
                return 1;
            }
            MY_LOG_INFO(TAG, "Updated home network: %s", ssid);
            return 0;
        }
    }

    if (count >= MAX_HOME_NETWORKS) {
        MY_LOG_INFO(TAG, "Home network list full (max %d)", MAX_HOME_NETWORKS);
        return 1;
    }

    strncpy(ssids[count], ssid, 32); ssids[count][32] = '\0';
    strncpy(passes[count], pass, 64); passes[count][64] = '\0';
    strncpy(bssids[count], bssid, 17); bssids[count][17] = '\0';
    count++;
    if (!home_write_all(ssids, passes, bssids, count)) {
        return 1;
    }
    MY_LOG_INFO(TAG, "Added home network: %s", ssid);
    return 0;
}

static int cmd_home_remove(int argc, char **argv) {
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: home_remove \"<SSID>\"");
        return 1;
    }
    const char *ssid = argv[1];

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    char ssids[MAX_HOME_NETWORKS][33];
    char passes[MAX_HOME_NETWORKS][65];
    char bssids[MAX_HOME_NETWORKS][18];
    int count = load_home_networks(ssids, passes, bssids, MAX_HOME_NETWORKS);
    if (count < 0) {
        MY_LOG_INFO(TAG, "home.txt not found on SD card.");
        return 1;
    }

    int out = 0;
    bool removed = false;
    for (int i = 0; i < count; i++) {
        if (!removed && strcmp(ssids[i], ssid) == 0) {
            removed = true;
            continue;
        }
        if (out != i) {
            strncpy(ssids[out], ssids[i], 32); ssids[out][32] = '\0';
            strncpy(passes[out], passes[i], 64); passes[out][64] = '\0';
            strncpy(bssids[out], bssids[i], 17); bssids[out][17] = '\0';
        }
        out++;
    }

    if (!removed) {
        MY_LOG_INFO(TAG, "Home network not found: %s", ssid);
        return 1;
    }

    if (!home_write_all(ssids, passes, bssids, out)) {
        return 1;
    }
    MY_LOG_INFO(TAG, "Removed home network: %s. %d remaining.", ssid, out);
    return 0;
}

// Command: sd_status - Fast SD card presence check (no mount/init)
static int cmd_sd_status(int argc, char **argv)
{
    (void)argc; (void)argv;
    struct stat st;
    if (stat("/sdcard", &st) == 0) {
        MY_LOG_INFO(TAG, "SD_OK");
    } else {
        MY_LOG_INFO(TAG, "SD_NONE");
    }
    return 0;
}

#define SD_BENCH_DEFAULT_MB 32U
#define SD_BENCH_MIN_MB 1U
#define SD_BENCH_MAX_MB 256U
#define SD_BENCH_CHUNK_SIZE (64U * 1024U)
#define SD_BENCH_PATH "/sdcard/lab/.janos_sd_benchmark.tmp"

static int sd_benchmark_compare_u32(const void *left, const void *right)
{
    uint32_t a = *(const uint32_t *)left;
    uint32_t b = *(const uint32_t *)right;
    return (a > b) - (a < b);
}

// Sequential write benchmark shaped like the PCAP writer: 64 KiB chunks and a
// 64 KiB stdio buffer. The temporary file is always removed after the test.
static int cmd_sd_benchmark(int argc, char **argv)
{
    if (argc > 2) {
        MY_LOG_INFO(TAG, "Usage: sd_benchmark [size_mb]");
        return 1;
    }
    if (pcap_capture_active || capture_gateway_is_active() || wardrive_active) {
        MY_LOG_INFO(TAG, "SD benchmark requires idle capture/wardrive state. Use 'stop' first.");
        return 1;
    }

    uint32_t size_mb = SD_BENCH_DEFAULT_MB;
    if (argc == 2) {
        char *end = NULL;
        errno = 0;
        unsigned long parsed = strtoul(argv[1], &end, 10);
        if (errno != 0 || end == argv[1] || *end != '\0' ||
            parsed < SD_BENCH_MIN_MB || parsed > SD_BENCH_MAX_MB) {
            MY_LOG_INFO(TAG, "size_mb must be an integer from %u to %u",
                        SD_BENCH_MIN_MB, SD_BENCH_MAX_MB);
            return 1;
        }
        size_mb = (uint32_t)parsed;
    }

    esp_err_t mount_err = init_sd_card();
    if (mount_err != ESP_OK) {
        MY_LOG_INFO(TAG, "SD benchmark mount failed: %s", esp_err_to_name(mount_err));
        printf("[SD_BENCH] result=error stage=mount error=%s\n",
               esp_err_to_name(mount_err));
        return 1;
    }
    if (!sd_mkdir_recursive("/sdcard/lab")) {
        MY_LOG_INFO(TAG, "SD benchmark could not create /sdcard/lab");
        printf("[SD_BENCH] result=error stage=directory\n");
        return 1;
    }

    const uint64_t total_bytes = (uint64_t)size_mb * 1024ULL * 1024ULL;
    const uint32_t sample_capacity = (uint32_t)(total_bytes / SD_BENCH_CHUNK_SIZE);
    uint8_t *write_buffer = heap_caps_malloc(SD_BENCH_CHUNK_SIZE,
                                             MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    uint8_t *stdio_buffer = heap_caps_malloc(SD_BENCH_CHUNK_SIZE,
                                             MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    uint32_t *latency_us = heap_caps_malloc(sample_capacity * sizeof(uint32_t),
                                            MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (write_buffer == NULL) {
        write_buffer = heap_caps_malloc(SD_BENCH_CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (stdio_buffer == NULL) {
        stdio_buffer = heap_caps_malloc(SD_BENCH_CHUNK_SIZE, MALLOC_CAP_8BIT);
    }
    if (latency_us == NULL) {
        latency_us = heap_caps_malloc(sample_capacity * sizeof(uint32_t),
                                      MALLOC_CAP_8BIT);
    }
    if (write_buffer == NULL || stdio_buffer == NULL || latency_us == NULL) {
        MY_LOG_INFO(TAG, "SD benchmark buffer allocation failed");
        printf("[SD_BENCH] result=error stage=allocate\n");
        heap_caps_free(write_buffer);
        heap_caps_free(stdio_buffer);
        heap_caps_free(latency_us);
        return 1;
    }

    for (size_t i = 0; i < SD_BENCH_CHUNK_SIZE; i++) {
        write_buffer[i] = (uint8_t)((i * 31U + 17U) & 0xffU);
    }

