brokali/projectZeroTouch/ESP32C5/main/main.c
    unlink(SD_BENCH_PATH); // remove only the benchmark's own stale temp file
    FILE *file = fopen(SD_BENCH_PATH, "wb");
    if (file == NULL) {
        MY_LOG_INFO(TAG, "SD benchmark open failed: %s", strerror(errno));
        printf("[SD_BENCH] result=error stage=open errno=%d\n", errno);
        heap_caps_free(write_buffer);
        heap_caps_free(stdio_buffer);
        heap_caps_free(latency_us);
        return 1;
    }
    if (setvbuf(file, (char *)stdio_buffer, _IOFBF, SD_BENCH_CHUNK_SIZE) != 0) {
        MY_LOG_INFO(TAG, "SD benchmark setvbuf failed");
        printf("[SD_BENCH] result=error stage=setvbuf\n");
        fclose(file);
        unlink(SD_BENCH_PATH);
        heap_caps_free(write_buffer);
        heap_caps_free(stdio_buffer);
        heap_caps_free(latency_us);
        return 1;
    }

    MY_LOG_INFO(TAG, "SD benchmark: writing %lu MiB in 64 KiB chunks...",
                (unsigned long)size_mb);
    printf("[SD_BENCH] start size_mb=%lu chunk_bytes=%u bus_khz=%d path=%s\n",
           (unsigned long)size_mb, SD_BENCH_CHUNK_SIZE, sd_mount_freq_khz,
           SD_BENCH_PATH);

    uint64_t bytes_written = 0;
    uint32_t sample_count = 0;
    int saved_errno = 0;
    int64_t start_us = esp_timer_get_time();
    uint64_t next_progress = 4ULL * 1024ULL * 1024ULL;
    while (bytes_written < total_bytes) {
        int64_t write_start_us = esp_timer_get_time();
        size_t written = fwrite(write_buffer, 1, SD_BENCH_CHUNK_SIZE, file);
        int64_t write_elapsed_us = esp_timer_get_time() - write_start_us;
        latency_us[sample_count++] = write_elapsed_us > UINT32_MAX
                                         ? UINT32_MAX
                                         : (uint32_t)write_elapsed_us;
        bytes_written += written;
        if (written != SD_BENCH_CHUNK_SIZE) {
            saved_errno = errno;
            break;
        }
        if (bytes_written >= next_progress) {
            int64_t elapsed_us = esp_timer_get_time() - start_us;
            uint64_t avg_kib_s = elapsed_us > 0
                                     ? (bytes_written * 1000000ULL) /
                                           ((uint64_t)elapsed_us * 1024ULL)
                                     : 0;
            printf("[SD_BENCH] progress bytes=%" PRIu64 " avg_kib_s=%" PRIu64 "\n",
                   bytes_written, avg_kib_s);
            next_progress += 4ULL * 1024ULL * 1024ULL;
        }
    }

    int64_t flush_start_us = esp_timer_get_time();
    int flush_result = fflush(file);
    uint64_t flush_us = (uint64_t)(esp_timer_get_time() - flush_start_us);
    int descriptor = fileno(file);
    int64_t sync_start_us = esp_timer_get_time();
    int sync_result = descriptor >= 0 ? fsync(descriptor) : -1;
    uint64_t sync_us = (uint64_t)(esp_timer_get_time() - sync_start_us);
    int64_t end_us = esp_timer_get_time();
    int close_result = fclose(file);
    file = NULL;

    bool write_ok = bytes_written == total_bytes && flush_result == 0 &&
                    sync_result == 0 && close_result == 0;
    if (!write_ok && saved_errno == 0) {
        saved_errno = errno;
    }

    qsort(latency_us, sample_count, sizeof(uint32_t), sd_benchmark_compare_u32);
    uint32_t p50_us = sample_count > 0 ? latency_us[(sample_count - 1U) * 50U / 100U] : 0;
    uint32_t p95_us = sample_count > 0 ? latency_us[(sample_count - 1U) * 95U / 100U] : 0;
    uint32_t p99_us = sample_count > 0 ? latency_us[(sample_count - 1U) * 99U / 100U] : 0;
    uint32_t max_us = sample_count > 0 ? latency_us[sample_count - 1U] : 0;
    uint64_t elapsed_us = end_us > start_us ? (uint64_t)(end_us - start_us) : 1ULL;
    uint64_t avg_kib_s = (bytes_written * 1000000ULL) / (elapsed_us * 1024ULL);
    uint64_t avg_kbps = (bytes_written * 8000ULL) / elapsed_us;
    uint64_t conservative_kbps = avg_kbps / 2ULL;
    if (conservative_kbps > SD_BENCH_CONSERVATIVE_MAX_KBPS) {
        conservative_kbps = SD_BENCH_CONSERVATIVE_MAX_KBPS;
    }

    printf("[SD_BENCH] result=%s bytes=%" PRIu64 " elapsed_ms=%" PRIu64
           " avg_kib_s=%" PRIu64 " avg_kbps=%" PRIu64
           " p50_write_us=%lu p95_write_us=%lu p99_write_us=%lu max_write_us=%lu"
           " flush_ms=%" PRIu64 " sync_ms=%" PRIu64
           " conservative_50pct_kbps=%" PRIu64 " bus_khz=%d errno=%d\n",
           write_ok ? "ok" : "error", bytes_written, elapsed_us / 1000ULL,
           avg_kib_s, avg_kbps,
           (unsigned long)p50_us, (unsigned long)p95_us,
           (unsigned long)p99_us, (unsigned long)max_us,
           flush_us / 1000ULL, sync_us / 1000ULL,
           conservative_kbps, sd_mount_freq_khz, saved_errno);
    MY_LOG_INFO(TAG,
                "SD benchmark %s: %" PRIu64 " KiB/s, p99=%lu us, max=%lu us, flush=%" PRIu64 " ms, sync=%" PRIu64 " ms",
                write_ok ? "passed" : "failed", avg_kib_s,
                (unsigned long)p99_us, (unsigned long)max_us,
                flush_us / 1000ULL, sync_us / 1000ULL);

    unlink(SD_BENCH_PATH);
    sd_sync();
    heap_caps_free(write_buffer);
    heap_caps_free(stdio_buffer);
    heap_caps_free(latency_us);
    return write_ok ? 0 : 1;
}

// Command: list_sd - Lists HTML files on SD card
static int cmd_list_sd(int argc, char **argv)
{
    (void)argc; (void)argv;
    
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Make sure SD card is properly inserted.");
        return 1;
    }
    
    DIR *dir = opendir("/sdcard/lab/htmls");
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open /sdcard/lab/htmls directory. Error: %d (%s)", errno, strerror(errno));
        return 1;
    }
    
    sd_html_count = 0;
    struct dirent *entry;
    
    while ((entry = readdir(dir)) != NULL && sd_html_count < MAX_HTML_FILES) {
        // Skip directories and special entries
        if (entry->d_type == DT_DIR) {
            continue;
        }
        
        // Skip macOS metadata files (._filename or _filename in MS-DOS 8.3)
        if (entry->d_name[0] == '.' || entry->d_name[0] == '_') {
            continue;
        }
        
        // Check if file ends with .html or .htm (case insensitive)
        size_t len = strlen(entry->d_name);
        bool is_html = false;
        
