brokali/projectZeroTouch/ESP32C5/main/main.c
        if (len > 5) {
            const char *ext = entry->d_name + len - 5;
            if (strcasecmp(ext, ".html") == 0) {
                is_html = true;
            }
        }
        
        if (!is_html && len > 4) {
            const char *ext = entry->d_name + len - 4;
            if (strcasecmp(ext, ".htm") == 0) {
                is_html = true;
            }
        }
        
        if (is_html) {
            strncpy(sd_html_files[sd_html_count], entry->d_name, MAX_HTML_FILENAME - 1);
            sd_html_files[sd_html_count][MAX_HTML_FILENAME - 1] = '\0';
            sd_html_count++;
        }
    }
    
    closedir(dir);
    
    if (sd_html_count == 0) {
        MY_LOG_INFO(TAG, "No HTML files found on SD card.");
        return 0;
    }
    
    MY_LOG_INFO(TAG, "HTML files found on SD card:");
    for (int i = 0; i < sd_html_count; i++) {
        printf("%d %s\n", i + 1, sd_html_files[i]);
    }
    
    return 0;
}

// Command: show_pass - Prints password log contents from SD card
static int cmd_show_pass(int argc, char **argv)
{
    const char *target = "portal";
    if (argc >= 2 && argv[1] != NULL && argv[1][0] != '\0') {
        target = argv[1];
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Make sure SD card is properly inserted.");
        return 1;
    }

    const char *path = "/sdcard/lab/portals.txt";
    if (strcasecmp(target, "evil") == 0 || strcasecmp(target, "eviltwin") == 0) {
        path = "/sdcard/lab/eviltwin.txt";
    }

    FILE *file = fopen(path, "r");
    if (file == NULL) {
        MY_LOG_INFO(TAG, "%s not found on SD card.", path);
        return 0;
    }

    char line[128];
    bool has_lines = false;
    while (fgets(line, sizeof(line), file) != NULL) {
        has_lines = true;
        printf("%s", line);
    }
    fclose(file);

    if (!has_lines) {
        MY_LOG_INFO(TAG, "%s is empty.", path);
    }

    return 0;
}

static bool build_sd_path(char *dest, size_t dest_size, const char *input_path)
{
    if (!dest || dest_size == 0 || !input_path || input_path[0] == '\0') {
        return false;
    }

    if (input_path[0] == '/') {
        // An absolute path used to be taken verbatim, so "list_dir /lab/handshakes"
        // tried to open "/lab/handshakes" and failed while "/sdcard/lab/handshakes"
        // worked — the same directory named two ways, one of which silently did not
        // exist. Anything not already under the mount point is rebased onto it.
        bool already_rooted = (strncmp(input_path, "/sdcard", 7) == 0) &&
                              (input_path[7] == '\0' || input_path[7] == '/');
        if (already_rooted) {
            strncpy(dest, input_path, dest_size - 1);
            dest[dest_size - 1] = '\0';
        } else {
            snprintf(dest, dest_size, "/sdcard%s", input_path);
        }
    } else {
        snprintf(dest, dest_size, "/sdcard/%s", input_path);
    }

    size_t len = strlen(dest);
    while (len > 1 && dest[len - 1] == '/') {
        dest[--len] = '\0';
    }

    return dest[0] != '\0';
}

#define JANOS_UART_NUM              UART_NUM_0
#define JANOS_UART_DEFAULT_BAUD     115200U
#define UART_BAUD_CONFIRM_US        (10ULL * 1000ULL * 1000ULL)
#define UART_BAUD_IDLE_REVERT_US    (60ULL * 1000ULL * 1000ULL)
#define UART_BAUD_IDLE_CHECK_US     (1ULL * 1000ULL * 1000ULL)
#define JANOS_CONSOLE_MAX_COMMANDS  128U

#define FT_BLOCK_SIZE_DEFAULT       4096U
#define FT_BLOCK_SIZE_MIN           512U
#define FT_BLOCK_SIZE_MAX           32768U
#define FT_BLOCK_HEADER_BYTES       16U
#define FT_MAX_BLOCK_ATTEMPTS       3U
#define FT_ACK                      0x06U
#define FT_NAK                      0x15U
#define FT_CAN                      0x18U

/* Both ends size their per-block patience from the same two numbers - the
 * negotiated block size and the rate the line is actually running at - so the
 * sender is never the first to give up. A fixed pair of constants cannot do
 * that: 4 KiB at 2 MBaud is 21 ms of wire time while 32 KiB at 115200 is
 * 2.8 s, and any single number is wrong at one end of that range.
 *
 *   wire_ms   = (bsize + 16) * 10 bits / baud       one block on an ideal line
 *   receiver  = 1000 + 3 * wire_ms                  capped at 30 s
 *   sender    = max(8000, receiver + 2000)
 *
 * The sender's window therefore exceeds the receiver's by at least 2 s, so a
 * receiver that is merely slow still gets its NAK in before JanOS abandons the
 * transfer. The 8 s floor is for receivers predating this scheme: they wait a
 * fixed 6 s for a block payload, which the old 5 s ACK timeout sat inside -
 * between 5 s and 6 s JanOS had already printed [FT] error ACK timeout and
 * returned to the REPL while the far end was still preparing a NAK, and the
 * two desynchronised unrecoverably.
 *
 * The computed value is published as ack_ms= in the [FT] begin header so a
 * receiver can follow it instead of reproducing the formula. */
#define FT_ACK_TIMEOUT_FLOOR_MS     8000U
#define FT_ACK_TIMEOUT_MARGIN_MS    2000U
#define FT_RX_TIMEOUT_CAP_MS        30000U

static SemaphoreHandle_t uart_baud_mutex;
static esp_timer_handle_t uart_baud_confirm_timer;
static esp_timer_handle_t uart_baud_idle_timer;
static uint32_t uart_current_baud = JANOS_UART_DEFAULT_BAUD;
static bool uart_baud_confirmation_pending;
static bool uart_file_transfer_active;
static int64_t uart_last_command_us;

typedef struct {
    esp_console_cmd_func_t func;
    esp_console_cmd_func_with_context_t func_w_context;
    void *context;
} janos_console_cmd_context_t;

static janos_console_cmd_context_t janos_console_cmd_contexts[JANOS_CONSOLE_MAX_COMMANDS];
static size_t janos_console_cmd_context_count;

static void uart_baud_note_activity(void)
{
    if (uart_baud_mutex == NULL) {
        return;
    }

    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);
    uart_last_command_us = esp_timer_get_time();
    xSemaphoreGive(uart_baud_mutex);
}

