brokali/projectZeroTouch/ESP32C5/main/main.c
static void uart_baud_set_file_transfer_active(bool active)
{
    if (uart_baud_mutex == NULL) {
        return;
    }

    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);
    uart_file_transfer_active = active;
    if (!active) {
        uart_last_command_us = esp_timer_get_time();
    }
    xSemaphoreGive(uart_baud_mutex);
}

static void uart_baud_timeout_cb(void *arg)
{
    (void)arg;

    if (uart_baud_mutex == NULL) {
        return;
    }

    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);
    if (uart_baud_confirmation_pending) {
        uart_baud_confirmation_pending = false;
        if (uart_set_baudrate(JANOS_UART_NUM, JANOS_UART_DEFAULT_BAUD) == ESP_OK) {
            uart_current_baud = JANOS_UART_DEFAULT_BAUD;
        }
    }
    xSemaphoreGive(uart_baud_mutex);
}

static void uart_baud_idle_cb(void *arg)
{
    (void)arg;

    if (uart_baud_mutex == NULL) {
        return;
    }

    bool reverted = false;
    int64_t now_us = esp_timer_get_time();

    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);
    if (!uart_file_transfer_active &&
        !uart_baud_confirmation_pending &&
        uart_current_baud != JANOS_UART_DEFAULT_BAUD &&
        now_us - uart_last_command_us >= (int64_t)UART_BAUD_IDLE_REVERT_US) {
        if (uart_set_baudrate(JANOS_UART_NUM, JANOS_UART_DEFAULT_BAUD) == ESP_OK) {
            uart_current_baud = JANOS_UART_DEFAULT_BAUD;
            uart_last_command_us = now_us;
            reverted = true;
        }
    }
    xSemaphoreGive(uart_baud_mutex);

    if (reverted) {
        printf("[UARTB] idle revert rate=115200\n");
        fflush(stdout);
    }
}

static esp_err_t uart_baud_control_init(void)
{
    uart_baud_mutex = xSemaphoreCreateMutex();
    if (uart_baud_mutex == NULL) {
        return ESP_ERR_NO_MEM;
    }

    const esp_timer_create_args_t timer_args = {
        .callback = uart_baud_timeout_cb,
        .arg = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "uart_baud_confirm",
        .skip_unhandled_events = true,
    };
    esp_err_t err = esp_timer_create(&timer_args, &uart_baud_confirm_timer);
    if (err != ESP_OK) {
        vSemaphoreDelete(uart_baud_mutex);
        uart_baud_mutex = NULL;
        return err;
    }

    const esp_timer_create_args_t idle_timer_args = {
        .callback = uart_baud_idle_cb,
        .arg = NULL,
        .dispatch_method = ESP_TIMER_TASK,
        .name = "uart_baud_idle",
        .skip_unhandled_events = true,
    };
    err = esp_timer_create(&idle_timer_args, &uart_baud_idle_timer);
    if (err != ESP_OK) {
        (void)esp_timer_delete(uart_baud_confirm_timer);
        uart_baud_confirm_timer = NULL;
        vSemaphoreDelete(uart_baud_mutex);
        uart_baud_mutex = NULL;
        return err;
    }

    uart_last_command_us = esp_timer_get_time();
    err = esp_timer_start_periodic(uart_baud_idle_timer, UART_BAUD_IDLE_CHECK_US);
    if (err != ESP_OK) {
        (void)esp_timer_delete(uart_baud_idle_timer);
        uart_baud_idle_timer = NULL;
        (void)esp_timer_delete(uart_baud_confirm_timer);
        uart_baud_confirm_timer = NULL;
        vSemaphoreDelete(uart_baud_mutex);
        uart_baud_mutex = NULL;
    }
    return err;
}

static int janos_console_cmd_dispatch(void *context, int argc, char **argv)
{
    janos_console_cmd_context_t *cmd_context =
        (janos_console_cmd_context_t *)context;

    uart_baud_note_activity();
    if (cmd_context->func != NULL) {
        return cmd_context->func(argc, argv);
    }
    return cmd_context->func_w_context(cmd_context->context, argc, argv);
}

static esp_err_t janos_console_cmd_register(const esp_console_cmd_t *cmd)
{
    if (cmd == NULL) {
        return ESP_ERR_INVALID_ARG;
    }
    if ((cmd->func == NULL) == (cmd->func_w_context == NULL)) {
        return ESP_ERR_INVALID_ARG;
    }
    if (janos_console_cmd_context_count >= JANOS_CONSOLE_MAX_COMMANDS) {
        return ESP_ERR_NO_MEM;
    }

    janos_console_cmd_context_t *context =
        &janos_console_cmd_contexts[janos_console_cmd_context_count];
    context->func = cmd->func;
    context->func_w_context = cmd->func_w_context;
    context->context = cmd->context;

    esp_console_cmd_t wrapped_cmd = *cmd;
    wrapped_cmd.func = NULL;
    wrapped_cmd.func_w_context = janos_console_cmd_dispatch;
    wrapped_cmd.context = context;

    esp_err_t err = esp_console_cmd_register(&wrapped_cmd);
    if (err == ESP_OK) {
        janos_console_cmd_context_count++;
    }
    return err;
}

/* The C5 UART divider reaches far past this list, so what limits the top of it
 * is the wiring between the boards, not the silicon. The rates above 2 MBaud
 * are here to be tried rather than assumed: an unconfirmed switch reverts to
 * 115200 after 10 s by itself, so a rate the cable cannot carry costs one
 * failed transfer and no more. */
static bool uart_baud_is_allowed(uint32_t rate)
{
    return rate == 115200U || rate == 230400U || rate == 460800U ||
           rate == 921600U || rate == 1000000U || rate == 1500000U ||
           rate == 2000000U || rate == 3000000U || rate == 4000000U;
}

/* The rate the console is running at right now, for sizing transfer timeouts. */
static uint32_t uart_baud_current(void)
{
    if (uart_baud_mutex == NULL) {
        return uart_current_baud;
    }
    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);
    uint32_t rate = uart_current_baud;
    xSemaphoreGive(uart_baud_mutex);
    return rate;
}

static int cmd_uart_baud(int argc, char **argv)
{
    char *end = NULL;
    errno = 0;
    unsigned long long parsed = (argc == 2) ? strtoull(argv[1], &end, 10) : 0;
    if (argc != 2 || errno == ERANGE || end == argv[1] || *end != '\0' ||
        parsed > UINT32_MAX || !uart_baud_is_allowed((uint32_t)parsed)) {
        printf("[UARTB] error allowed=115200,230400,460800,921600,1000000,"
               "1500000,2000000,3000000,4000000\n");
        printf("[UARTB] END\n");
        return 0;
    }

    uint32_t rate = (uint32_t)parsed;
    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);

