brokali/projectZeroTouch/ESP32C5/main/main.c
    uart_baud_confirmation_pending = false;
    (void)esp_timer_stop(uart_baud_confirm_timer);

    printf("[UARTB] switching rate=%" PRIu32 " confirm_within=10s\n", rate);
    printf("[UARTB] END\n");
    fflush(stdout);

    esp_err_t err = uart_wait_tx_done(JANOS_UART_NUM, pdMS_TO_TICKS(2000));
    if (err == ESP_OK) {
        err = uart_set_baudrate(JANOS_UART_NUM, rate);
    }

    if (err == ESP_OK) {
        uart_current_baud = rate;
        uart_baud_confirmation_pending = true;
        err = esp_timer_start_once(uart_baud_confirm_timer, UART_BAUD_CONFIRM_US);
    }

    if (err != ESP_OK) {
        uart_baud_confirmation_pending = false;
        (void)uart_set_baudrate(JANOS_UART_NUM, JANOS_UART_DEFAULT_BAUD);
        uart_current_baud = JANOS_UART_DEFAULT_BAUD;
    }

    xSemaphoreGive(uart_baud_mutex);
    return 0;
}

static int cmd_uart_baud_confirm(int argc, char **argv)
{
    (void)argc;
    (void)argv;

    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);
    uart_baud_confirmation_pending = false;
    (void)esp_timer_stop(uart_baud_confirm_timer);
    uint32_t rate = uart_current_baud;
    xSemaphoreGive(uart_baud_mutex);

    printf("[UARTB] confirmed rate=%" PRIu32 "\n", rate);
    printf("[UARTB] END\n");
    return 0;
}

static int cmd_uart_baud_status(int argc, char **argv)
{
    (void)argc;
    (void)argv;

    xSemaphoreTake(uart_baud_mutex, portMAX_DELAY);
    uint32_t rate = uart_current_baud;
    bool pending = uart_baud_confirmation_pending;
    xSemaphoreGive(uart_baud_mutex);

    printf("[UARTB] status rate=%" PRIu32 " pending=%s\n",
           rate, pending ? "yes" : "no");
    printf("[UARTB] END\n");
    return 0;
}

static bool ft_uart_write_all(const void *data, size_t length)
{
    const uint8_t *bytes = (const uint8_t *)data;
    while (length > 0) {
        int written = uart_write_bytes(JANOS_UART_NUM, bytes, length);
        if (written <= 0) {
            return false;
        }
        bytes += written;
        length -= (size_t)written;
    }
    return true;
}

static void ft_send_error(const char *reason)
{
    char response[256];
    int len = snprintf(response, sizeof(response),
                       "[FT] error %s\r\n[FT] END\r\n", reason);
    if (len > 0) {
        size_t send_len = (size_t)len < sizeof(response) ? (size_t)len : sizeof(response) - 1;
        (void)ft_uart_write_all(response, send_len);
        (void)uart_wait_tx_done(JANOS_UART_NUM, pdMS_TO_TICKS(2000));
    }
}

static void ft_put_le32(uint8_t *dest, uint32_t value)
{
    dest[0] = (uint8_t)value;
    dest[1] = (uint8_t)(value >> 8);
    dest[2] = (uint8_t)(value >> 16);
    dest[3] = (uint8_t)(value >> 24);
}

/* Time one block spends on an ideal line, header included. */
static uint32_t ft_block_wire_ms(uint32_t block_size, uint32_t baud)
{
    if (baud == 0U) {
        baud = JANOS_UART_DEFAULT_BAUD;
    }
    uint64_t bit_ms = ((uint64_t)block_size + FT_BLOCK_HEADER_BYTES) * 10ULL * 1000ULL;
    return (uint32_t)((bit_ms + baud - 1U) / baud);
}

/* What a receiver is expected to allow itself for one block. Published in the
 * header via ack_ms so a receiver can follow it instead of recomputing it, but
 * kept identical to the receiver-side formula for the ones that do. */
static uint32_t ft_receiver_block_timeout_ms(uint32_t block_size, uint32_t baud)
{
    uint32_t timeout = 1000U + 3U * ft_block_wire_ms(block_size, baud);
    return timeout > FT_RX_TIMEOUT_CAP_MS ? FT_RX_TIMEOUT_CAP_MS : timeout;
}

static uint32_t ft_ack_timeout_ms(uint32_t block_size, uint32_t baud)
{
    uint32_t timeout = ft_receiver_block_timeout_ms(block_size, baud) +
                       FT_ACK_TIMEOUT_MARGIN_MS;
    return timeout < FT_ACK_TIMEOUT_FLOOR_MS ? FT_ACK_TIMEOUT_FLOOR_MS : timeout;
}

static int ft_wait_for_response(uint8_t *response, uint32_t timeout_ms)
{
    int64_t deadline_us = esp_timer_get_time() + (int64_t)timeout_ms * 1000;
    while (esp_timer_get_time() < deadline_us) {
        int64_t remaining_ms = (deadline_us - esp_timer_get_time() + 999) / 1000;
        TickType_t wait_ticks = pdMS_TO_TICKS((uint32_t)remaining_ms);
        if (wait_ticks == 0) {
            wait_ticks = 1;
        }
        int read = uart_read_bytes(JANOS_UART_NUM, response, 1, wait_ticks);
        if (read == 1) {
            return 1;
        }
        if (read < 0) {
            return -1;
        }
    }
    return 0;
}

static int cmd_send_file(int argc, char **argv)
{
    FILE *file = NULL;
    uint8_t *buffer = NULL;
    char full_path[SD_PATH_MAX];
    char reason[160];
    uint64_t offset = 0;
    uint64_t total_size = 0;
    uint64_t remaining = 0;
    uint64_t sent = 0;
    uint32_t sent_crc = 0;
    uint32_t block_index = 0;
    uint32_t block_size = FT_BLOCK_SIZE_DEFAULT;
    uint32_t ack_timeout_ms = 0;
    bool cancelled = false;

    uart_baud_set_file_transfer_active(true);
    flockfile(stdout);
    fflush(stdout);

    if (argc < 2 || argc > 4) {
        ft_send_error("usage: send_file <path> [offset] [bsize]");
        goto cleanup;
    }

    if (!build_sd_path(full_path, sizeof(full_path), argv[1])) {
        ft_send_error("invalid path");
        goto cleanup;
    }

    if (argc >= 3) {
        char *end = NULL;
        errno = 0;
        unsigned long long parsed = strtoull(argv[2], &end, 10);
        if (errno == ERANGE || end == argv[2] || *end != '\0' || argv[2][0] == '-') {
            ft_send_error("invalid offset");
            goto cleanup;
        }
        offset = (uint64_t)parsed;
    }

    /* The receiver picks the block size because the receiver is the side with
     * the RAM constraint: its UART ring has to comfortably exceed one block.
     * A request outside what JanOS will allocate is clamped rather than
     * refused, and the effective value goes back out as bsize= - so a caller
     * must read that field rather than assume it got what it asked for.
     * Callers that pass no third argument keep the historical 4096. */
    if (argc == 4) {
        char *end = NULL;
        errno = 0;
        unsigned long long parsed = strtoull(argv[3], &end, 10);
        if (errno == ERANGE || end == argv[3] || *end != '\0' || argv[3][0] == '-') {
            ft_send_error("invalid block size");
            goto cleanup;
        }
        if (parsed < FT_BLOCK_SIZE_MIN) {
            parsed = FT_BLOCK_SIZE_MIN;
        } else if (parsed > FT_BLOCK_SIZE_MAX) {
            parsed = FT_BLOCK_SIZE_MAX;
        }
        block_size = (uint32_t)parsed;
    }

    esp_err_t sd_err = init_sd_card();
    if (sd_err != ESP_OK) {
        snprintf(reason, sizeof(reason), "SD unavailable: %s", esp_err_to_name(sd_err));
        ft_send_error(reason);
        goto cleanup;
    }

    struct stat st;
    if (stat(full_path, &st) != 0) {
        snprintf(reason, sizeof(reason), "open failed: %s", strerror(errno));
        ft_send_error(reason);
        goto cleanup;
    }
    if (!S_ISREG(st.st_mode) || st.st_size < 0) {
        ft_send_error("path is not a regular file");
        goto cleanup;
    }

    total_size = (uint64_t)st.st_size;
    if (offset > total_size || offset > (uint64_t)INT64_MAX) {
        ft_send_error("offset exceeds file size");
        goto cleanup;
    }

    file = fopen(full_path, "rb");
    if (file == NULL) {
        snprintf(reason, sizeof(reason), "open failed: %s", strerror(errno));
        ft_send_error(reason);
        goto cleanup;
    }

    buffer = malloc(block_size);
    if (buffer == NULL) {
        ft_send_error("out of memory");
        goto cleanup;
    }

    /* A resuming receiver holds a partial file it has no way to trust. Checksum
     * the range it says it already has - the file is still positioned at 0 - so
     * it can discard a stale prefix before the rest is pushed over the wire
     * instead of discovering the mismatch after the whole transfer. */
    uint32_t prefix_crc = 0;
    uint64_t prefix_since_yield = 0;
    for (uint64_t left = offset; left > 0; ) {
        size_t wanted = left > block_size ? block_size : (size_t)left;
        size_t got = fread(buffer, 1, wanted, file);
        if (got != wanted || ferror(file)) {
            ft_send_error("read failed");
            goto cleanup;
        }
        prefix_crc = esp_rom_crc32_le(prefix_crc, buffer, (uint32_t)got);
        left -= got;
        /* Unlike the send loop below, nothing here waits on the wire, so a
         * yield per block would dominate the whole read: at a 10 ms tick and a
         * 4 KiB block a 90 MB prefix would spend four minutes sleeping and blow
         * the receiver's header timeout long before the file was checksummed.
         * Once per 256 KiB keeps the idle task fed at a cost of nothing, and is
         * counted in bytes so it stays 256 KiB whatever the block size is. */
        prefix_since_yield += got;
        if (prefix_since_yield >= 256U * 1024U) {
            prefix_since_yield = 0;
            vTaskDelay(1);
        }
    }

