brokali/projectZeroTouch/ESP32C5/main/main.c
    if (fseeko(file, (off_t)offset, SEEK_SET) != 0) {
        snprintf(reason, sizeof(reason), "seek failed: %s", strerror(errno));
        ft_send_error(reason);
        goto cleanup;
    }

    remaining = total_size - offset;

    /* linenoise consumes CR but a terminal sending CRLF may leave LF in the UART ring. */
    if (uart_flush_input(JANOS_UART_NUM) != ESP_OK) {
        ft_send_error("could not clear UART input");
        goto cleanup;
    }

    /* Receivers parse this line with a plain substring search for "<key>=", so
     * prefix_crc must stay after crc32 and must not contain "crc32=" itself -
     * either would hand a lookup for crc32= the wrong number. Same reason
     * bsize= is only safe where it is: size= appears earlier in the line.
     * New fields go on the end, which is where ack_ms= is. */
    ack_timeout_ms = ft_ack_timeout_ms(block_size, uart_baud_current());
    char header[192];
    int header_len = snprintf(header, sizeof(header),
                              "[FT] begin size=%" PRIu64 " offset=%" PRIu64
                              " bsize=%" PRIu32 " crc32=00000000 prefix_crc=%08" PRIx32
                              " ack_ms=%" PRIu32 "\r\n"
                              "[FT] END\r\n\r\n",
                              total_size, offset, block_size, prefix_crc,
                              ack_timeout_ms);
    if (header_len <= 0 || (size_t)header_len >= sizeof(header) ||
        !ft_uart_write_all(header, (size_t)header_len) ||
        uart_wait_tx_done(JANOS_UART_NUM, pdMS_TO_TICKS(2000)) != ESP_OK) {
        goto cleanup;
    }

    while (remaining > 0) {
        size_t wanted = remaining > block_size ? block_size : (size_t)remaining;
        size_t payload_len = fread(buffer, 1, wanted, file);
        if (payload_len != wanted) {
            ft_send_error(ferror(file) ? "read failed" : "file changed during transfer");
            goto cleanup;
        }

        uint8_t block_header[FT_BLOCK_HEADER_BYTES] = { 'F', 'T', 'B', 0x01 };
        ft_put_le32(block_header + 4, block_index);
        ft_put_le32(block_header + 8, (uint32_t)payload_len);
        ft_put_le32(block_header + 12,
                    esp_rom_crc32_le(0, buffer, (uint32_t)payload_len));

        bool acknowledged = false;
        for (uint32_t attempt = 0; attempt < FT_MAX_BLOCK_ATTEMPTS; attempt++) {
            if (!ft_uart_write_all(block_header, sizeof(block_header)) ||
                !ft_uart_write_all(buffer, payload_len) ||
                uart_wait_tx_done(JANOS_UART_NUM, pdMS_TO_TICKS(ack_timeout_ms)) != ESP_OK) {
                ft_send_error("UART write failed");
                goto cleanup;
            }
            uart_baud_note_activity();

            uint8_t response = 0;
            int response_status = ft_wait_for_response(&response, ack_timeout_ms);
            if (response_status == 0) {
                ft_send_error("ACK timeout");
                goto cleanup;
            }
            if (response == FT_CAN) {
                cancelled = true;
                goto transfer_end;
            }
            if (response_status < 0) {
                ft_send_error("UART read failed");
                goto cleanup;
            }
            if (response == FT_ACK) {
                acknowledged = true;
                break;
            }
            if (response != FT_NAK) {
                snprintf(reason, sizeof(reason), "invalid response 0x%02x", response);
                ft_send_error(reason);
                goto cleanup;
            }
        }

        if (!acknowledged) {
            snprintf(reason, sizeof(reason), "retry limit index=%" PRIu32, block_index);
            ft_send_error(reason);
            goto cleanup;
        }

        sent_crc = esp_rom_crc32_le(sent_crc, buffer, (uint32_t)payload_len);
        sent += payload_len;
        remaining -= payload_len;
        block_index++;
        /* No yield here on purpose. Each pass already blocks twice - on
         * uart_wait_tx_done and on the ACK - so the scheduler runs regardless,
         * and vTaskDelay(1) only added a whole 10 ms tick to every block. That
         * was 14% of the per-block cost once the receiver reached 1.5 MBaud,
         * paid for nothing. */
    }

transfer_end:
    if (cancelled) {
        static const char cancelled_response[] = "[FT] cancelled\r\n[FT] END\r\n";
        (void)ft_uart_write_all(cancelled_response, sizeof(cancelled_response) - 1);
    } else {
        char done[128];
        int done_len = snprintf(done, sizeof(done),
                                "[FT] done sent=%" PRIu64 " crc32=%08" PRIx32
                                "\r\n[FT] END\r\n",
                                sent, sent_crc);
        if (done_len > 0 && (size_t)done_len < sizeof(done)) {
            (void)ft_uart_write_all(done, (size_t)done_len);
        }
    }
    (void)uart_wait_tx_done(JANOS_UART_NUM, pdMS_TO_TICKS(2000));

cleanup:
    if (file != NULL) {
        fclose(file);
    }
    free(buffer);
    uart_baud_set_file_transfer_active(false);
    funlockfile(stdout);
    return 0;
}

// Command: list_dir [path] [-s] - Lists files inside a directory on SD card
static int cmd_list_dir(int argc, char **argv)
{
    const char *input_path = NULL;
    bool with_size = false;
    for (int i = 1; i < argc; i++) {
        if (strcmp(argv[i], "-s") == 0) {
            with_size = true;
        } else if (input_path == NULL) {
            input_path = argv[i];
        }
    }
    if (input_path == NULL) {
        input_path = "lab/handshakes";
    }

    char full_path[SD_PATH_MAX];

    if (!build_sd_path(full_path, sizeof(full_path), input_path)) {
        MY_LOG_INFO(TAG, "Invalid path provided.");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }

    DIR *dir = opendir(full_path);
    if (dir == NULL) {
        MY_LOG_INFO(TAG, "Failed to open %s. Error: %d (%s)", full_path, errno, strerror(errno));
        return 1;
    }

    MY_LOG_INFO(TAG, "Files in %s:", full_path);

    struct dirent *entry;
    int file_count = 0;
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_type == DT_DIR) {
            continue;
        }
        if (entry->d_name[0] == '.' || entry->d_name[0] == '_') {
            continue;
        }
        file_count++;
        if (with_size) {
            char item[SD_PATH_MAX];
            struct stat st;
            unsigned long long size = 0;
            int item_len = snprintf(item, sizeof(item), "%s/%s", full_path, entry->d_name);
            if (item_len >= 0 && item_len < (int)sizeof(item) && stat(item, &st) == 0) {
                size = (unsigned long long)st.st_size;
            }
            printf("%d %llu %s\n", file_count, size, entry->d_name);
        } else {
            printf("%d %s\n", file_count, entry->d_name);
        }
    }

    closedir(dir);

    if (file_count == 0) {
        MY_LOG_INFO(TAG, "No files found in %s", full_path);
    } else {
        MY_LOG_INFO(TAG, "Found %d file(s) in %s", file_count, full_path);
    }

