brokali/projectZeroTouch/ESP32C5/main/main.c
    return 0;
}

// Command: file_delete <path> [path2 ...] - Deletes one or more files on SD card
static int cmd_file_delete(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: file_delete <path> [path2 ...]");
        MY_LOG_INFO(TAG, "Example: file_delete lab/handshakes/sample.pcap");
        return 1;
    }

    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        // Still one line per path: returning here with no markers at all would leave the
        // host counting a short batch and retrying paths one at a time against a card
        // that is not mounted. Nothing was deleted, and every path says so.
        for (int i = 1; i < argc; i++) {
            printf("[FILE_DELETE] path=%s result=failed\n", argv[i]);
        }
        return 1;
    }

    // Exactly one [FILE_DELETE] line per path, in argv order, whatever happens to any
    // of them: the host maps results positionally, because its marker parser cuts a
    // value at the first whitespace and handshake filenames come from SSIDs and can
    // contain spaces. A missing or reordered marker would mark the wrong file as
    // deleted, and a short batch makes the host discard the whole result and retry the
    // paths one at a time. So no early return, no skipped path, and no batch-level
    // result code. Quoting is the host's job and esp_console_split_argv already undoes
    // it, so a path arrives whole even with spaces in it.
    int failed = 0;
    bool deleted_any = false;

    for (int i = 1; i < argc; i++) {
        char full_path[SD_PATH_MAX];
        if (!build_sd_path(full_path, sizeof(full_path), argv[i])) {
            MY_LOG_INFO(TAG, "Invalid path provided.");
            printf("[FILE_DELETE] path=%s result=failed\n", argv[i]);
            failed++;
            continue;
        }

        struct stat st;
        if (stat(full_path, &st) != 0) {
            MY_LOG_INFO(TAG, "File not found: %s (errno: %d)", full_path, errno);
            printf("[FILE_DELETE] path=%s result=not_found\n", full_path);
            failed++;
            continue;
        }

        if (S_ISDIR(st.st_mode)) {
            MY_LOG_INFO(TAG, "Refusing to delete directory: %s", full_path);
            printf("[FILE_DELETE] path=%s result=is_dir\n", full_path);
            failed++;
            continue;
        }

        if (unlink(full_path) != 0) {
            MY_LOG_INFO(TAG, "Failed to delete %s: %s", full_path, strerror(errno));
            printf("[FILE_DELETE] path=%s result=failed\n", full_path);
            failed++;
            continue;
        }

        // Printed before the sync, not after. The host waits about 900 ms for
        // "Deleted "; creating, fsyncing and unlinking /sdcard/.sync can outlast that
        // window, so the file was gone but the UI reported a failure.
        deleted_any = true;
        MY_LOG_INFO(TAG, "Deleted %s", full_path);
        printf("[FILE_DELETE] path=%s result=ok\n", full_path);
    }

    // One sync for the whole batch rather than one per file.
    if (deleted_any) {
        sd_sync();
    }
    return failed > 0 ? 1 : 0;
}

// Command: select_html [index] - Loads HTML file from SD card
static int cmd_select_html(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: select_html <index>");
        MY_LOG_INFO(TAG, "Run list_sd first to see available HTML files.");
        return 1;
    }
    
    int index = atoi(argv[1]) - 1; // Convert from 1-based to 0-based
    
    if (index < 0 || index >= sd_html_count) {
        MY_LOG_INFO(TAG, "Invalid index. Run list_sd to see available files.");
        return 1;
    }
    
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        MY_LOG_INFO(TAG, "Make sure SD card is properly inserted.");
        return 1;
    }
    
    char filepath[128];
    snprintf(filepath, sizeof(filepath), "/sdcard/lab/htmls/%s", sd_html_files[index]);
    
    // Open file and get size
    FILE *f = fopen(filepath, "r");
    if (f == NULL) {
        MY_LOG_INFO(TAG, "Failed to open file: %s", filepath);
        return 1;
    }
    
    // Get file size
    fseek(f, 0, SEEK_END);
    long fsize = ftell(f);
    fseek(f, 0, SEEK_SET);
    
    if (fsize <= 0 || fsize > 800000) { // Limit to 800KB
        MY_LOG_INFO(TAG, "File size invalid or too large: %ld bytes", fsize);
        fclose(f);
        return 1;
    }
    
    // Free previous custom HTML if exists
    if (custom_portal_html != NULL) {
        free(custom_portal_html);
        custom_portal_html = NULL;
    }
    
    // Allocate memory and read file
    custom_portal_html = (char*)malloc(fsize + 1);
    if (custom_portal_html == NULL) {
        MY_LOG_INFO(TAG, "Failed to allocate memory for HTML file.");
        fclose(f);
        return 1;
    }
    
    size_t bytes_read = fread(custom_portal_html, 1, fsize, f);
    custom_portal_html[bytes_read] = '\0';
    fclose(f);
    
    MY_LOG_INFO(TAG, "Loaded HTML file: %s (%u bytes)", sd_html_files[index], (unsigned int)bytes_read);
    MY_LOG_INFO(TAG, "Portal will now use this custom HTML.");
    
    return 0;
}

// Command: set_html - Sets custom HTML from command line argument
static int cmd_set_html(int argc, char **argv)
{
    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: set_html <html_string>");
        MY_LOG_INFO(TAG, "Example: set_html <!DOCTYPE html><html>...</html>");
        return 1;
    }
    
    // Concatenate all arguments (HTML may contain spaces)
    size_t total_len = 0;
    for (int i = 1; i < argc; i++) {
        total_len += strlen(argv[i]) + 1; // +1 for space
    }
    
    // Free previous custom HTML if exists
    if (custom_portal_html != NULL) {
        free(custom_portal_html);
        custom_portal_html = NULL;
    }
    
    // Allocate and build the HTML string
    custom_portal_html = (char*)malloc(total_len + 1);
    if (custom_portal_html == NULL) {
        MY_LOG_INFO(TAG, "Failed to allocate memory for HTML.");
        return 1;
    }
    
