brokali/projectZeroTouch/ESP32C5/main/main.c
    custom_portal_html[0] = '\0';
    for (int i = 1; i < argc; i++) {
        strcat(custom_portal_html, argv[i]);
        if (i < argc - 1) {
            strcat(custom_portal_html, " ");
        }
    }
    
    MY_LOG_INFO(TAG, "Custom HTML set (%u bytes). Portal/Evil Twin/Karma will use this HTML.",
                (unsigned int)strlen(custom_portal_html));
    return 0;
}

static void gps_raw_task(void *pvParameters) {
    (void)pvParameters;

    MY_LOG_INFO(TAG, "GPS raw reader started. Use 'stop' to exit.");

    while (gps_raw_active && !operation_stop_requested) {
        int len = uart_read_bytes(GPS_UART_NUM, (uint8_t *)wardrive_gps_buffer, GPS_BUF_SIZE - 1, pdMS_TO_TICKS(500));
        if (len > 0) {
            wardrive_gps_buffer[len] = '\0';
            char *line = strtok(wardrive_gps_buffer, "\r\n");
            while (line != NULL) {
                MY_LOG_INFO(TAG, "[GPS RAW] %s", line);
                line = strtok(NULL, "\r\n");
            }
        }
    }

    gps_raw_active = false;
    operation_stop_requested = false;
    gps_raw_task_handle = NULL;
    MY_LOG_INFO(TAG, "GPS raw reader stopped.");
    vTaskDelete(NULL);
}

static int cmd_gps_set(int argc, char **argv) {
    if (argc < 2 || argv[1] == NULL) {
        printf("[GPSCFG] module=%s\n", gps_get_module_name(current_gps_module));
        printf("[GPSCFG] baud=%d\n", gps_get_baud_for_module(current_gps_module));
        printf("[GPSCFG] external=%s\n", gps_module_uses_external_feed(current_gps_module) ? "yes" : "no");
        printf("[GPSCFG] position_command=%s\n", gps_external_position_command_name(current_gps_module));
        printf("[GPSCFG] END\n");
        MY_LOG_INFO(TAG, "Current GPS module: %s (baud %d)",
                    gps_get_module_name(current_gps_module),
                    gps_get_baud_for_module(current_gps_module));
        return 0;
    }

    gps_module_t selected = current_gps_module;
    if (strcasecmp(argv[1], "m5") == 0 || strcasecmp(argv[1], "m5stack") == 0 || strcasecmp(argv[1], "m5stackgps1.1") == 0 || strcasecmp(argv[1], "m5stackgpsv11") == 0) {
        selected = GPS_MODULE_M5STACK_GPS_V11;
    } else if (strcasecmp(argv[1], "atgm") == 0 || strcasecmp(argv[1], "atgm336h") == 0) {
        selected = GPS_MODULE_ATGM336H;
    } else if (strcasecmp(argv[1], "external") == 0 || strcasecmp(argv[1], "ext") == 0 ||
               strcasecmp(argv[1], "usb") == 0 || strcasecmp(argv[1], "tab") == 0 ||
               strcasecmp(argv[1], "tab5") == 0) {
        selected = GPS_MODULE_EXTERNAL;
    } else if (strcasecmp(argv[1], "cap") == 0 || strcasecmp(argv[1], "external_cap") == 0 ||
               strcasecmp(argv[1], "lora_cap") == 0 || strcasecmp(argv[1], "adv_cap") == 0) {
        selected = GPS_MODULE_EXTERNAL_CAP;
    } else {
        MY_LOG_INFO(TAG, "Unknown module '%s'. Use 'm5', 'atgm', 'external' (usb alias) or 'cap'.", argv[1]);
        return 1;
    }

    current_gps_module = selected;
    if (gps_module_uses_external_feed(current_gps_module)) {
        gps_sync_from_selected_external_source();
    }
    gps_save_state_to_nvs();
    printf("[GPSCFG] module=%s\n", gps_get_module_name(current_gps_module));
    printf("[GPSCFG] baud=%d\n", gps_get_baud_for_module(current_gps_module));
    printf("[GPSCFG] external=%s\n", gps_module_uses_external_feed(current_gps_module) ? "yes" : "no");
    printf("[GPSCFG] position_command=%s\n", gps_external_position_command_name(current_gps_module));
    printf("[GPSCFG] END\n");
    MY_LOG_INFO(TAG, "GPS module set to %s (baud %d). Restart GPS tasks if running.",
                gps_get_module_name(current_gps_module),
                gps_get_baud_for_module(current_gps_module));
    return 0;
}

static int cmd_set_gps_position(int argc, char **argv) {
    if (argc == 1) {
        external_gps_position.valid = false;
        if (current_gps_module == GPS_MODULE_EXTERNAL) {
            gps_sync_from_selected_external_source();
        }
        oled_display_update_full("> GPS External", "  Fix cleared", "", "  No fix");
        MY_LOG_INFO(TAG, "External GPS fix cleared (no fix).");
        return 0;
    }

    if (argc < 3 || argc > 5 || argv[1] == NULL || argv[2] == NULL) {
        MY_LOG_INFO(TAG, "Usage: set_gps_position <lat> <lon> [alt] [acc]");
        MY_LOG_INFO(TAG, "Usage: set_gps_position   (no args = lost fix)");
        return 1;
    }

    char *endptr = NULL;
    float lat = strtof(argv[1], &endptr);
    if (endptr == argv[1] || (endptr != NULL && *endptr != '\0') || !isfinite(lat)) {
        MY_LOG_INFO(TAG, "Invalid latitude: '%s'", argv[1]);
        return 1;
    }

    endptr = NULL;
    float lon = strtof(argv[2], &endptr);
    if (endptr == argv[2] || (endptr != NULL && *endptr != '\0') || !isfinite(lon)) {
        MY_LOG_INFO(TAG, "Invalid longitude: '%s'", argv[2]);
        return 1;
    }

    if (lat < -90.0f || lat > 90.0f) {
        MY_LOG_INFO(TAG, "Latitude out of range (-90..90): %.7f", lat);
        return 1;
    }
    if (lon < -180.0f || lon > 180.0f) {
        MY_LOG_INFO(TAG, "Longitude out of range (-180..180): %.7f", lon);
        return 1;
    }

    float alt = external_gps_position.altitude;
    float acc = (external_gps_position.accuracy > 0.0f) ? external_gps_position.accuracy : 5.0f;

    if (argc >= 4 && argv[3] != NULL) {
        endptr = NULL;
        alt = strtof(argv[3], &endptr);
        if (endptr == argv[3] || (endptr != NULL && *endptr != '\0') || !isfinite(alt)) {
            MY_LOG_INFO(TAG, "Invalid altitude: '%s'", argv[3]);
            return 1;
        }
    }

    if (argc >= 5 && argv[4] != NULL) {
        endptr = NULL;
        acc = strtof(argv[4], &endptr);
        if (endptr == argv[4] || (endptr != NULL && *endptr != '\0') || !isfinite(acc) || acc < 0.0f) {
            MY_LOG_INFO(TAG, "Invalid accuracy: '%s' (must be >= 0)", argv[4]);
            return 1;
        }
    }

    external_gps_position.latitude = lat;
    external_gps_position.longitude = lon;
    external_gps_position.altitude = alt;
    external_gps_position.accuracy = acc;
    external_gps_position.valid = true;

    if (current_gps_module == GPS_MODULE_EXTERNAL) {
        gps_sync_from_selected_external_source();
    }

    MY_LOG_INFO(TAG, "External GPS updated: Lat=%.7f Lon=%.7f Alt=%.2fm Acc=%.2fm",
                external_gps_position.latitude, external_gps_position.longitude,
                external_gps_position.altitude, external_gps_position.accuracy);

    {
        char oled_lat[20], oled_lon[20];
        snprintf(oled_lat, sizeof(oled_lat), "  Lat %.4f", lat);
        snprintf(oled_lon, sizeof(oled_lon), "  Lon %.4f", lon);
        oled_display_update_full("> GPS External", oled_lat, oled_lon, "  Fix set");
    }

