brokali/projectZeroTouch/ESP32C5/main/main.c
    if (current_gps_module != GPS_MODULE_EXTERNAL) {
        MY_LOG_INFO(TAG, "Note: current module is %s. Run 'gps_set external' to use this feed in wardrive.",
                    gps_get_module_name(current_gps_module));
    }
    return 0;
}

static int cmd_set_gps_position_cap(int argc, char **argv) {
    if (argc == 1) {
        external_cap_gps_position.valid = false;
        if (gps_module_uses_external_cap_feed(current_gps_module)) {
            gps_sync_from_selected_external_source();
        }
        oled_display_update_full("> GPS CAP Feed", "  Fix cleared", "", "  No fix");
        MY_LOG_INFO(TAG, "External CAP GPS fix cleared (no fix).");
        return 0;
    }

    if (argc < 3 || argc > 5 || argv[1] == NULL || argv[2] == NULL) {
        MY_LOG_INFO(TAG, "Usage: set_gps_position_cap <lat> <lon> [alt] [acc]");
        MY_LOG_INFO(TAG, "Usage: set_gps_position_cap   (no args = lost fix)");
        return 1;
    }

    char *endptr = NULL;
    float lat = strtof(argv[1], &endptr);
    if (endptr == argv[1] || (endptr != NULL && *endptr != '\0') || !isfinite(lat)) {
        MY_LOG_INFO(TAG, "Invalid latitude: '%s'", argv[1]);
        return 1;
    }

    endptr = NULL;
    float lon = strtof(argv[2], &endptr);
    if (endptr == argv[2] || (endptr != NULL && *endptr != '\0') || !isfinite(lon)) {
        MY_LOG_INFO(TAG, "Invalid longitude: '%s'", argv[2]);
        return 1;
    }

    if (lat < -90.0f || lat > 90.0f) {
        MY_LOG_INFO(TAG, "Latitude out of range (-90..90): %.7f", lat);
        return 1;
    }
    if (lon < -180.0f || lon > 180.0f) {
        MY_LOG_INFO(TAG, "Longitude out of range (-180..180): %.7f", lon);
        return 1;
    }

    float alt = external_cap_gps_position.altitude;
    float acc = (external_cap_gps_position.accuracy > 0.0f) ? external_cap_gps_position.accuracy : 5.0f;

    if (argc >= 4 && argv[3] != NULL) {
        endptr = NULL;
        alt = strtof(argv[3], &endptr);
        if (endptr == argv[3] || (endptr != NULL && *endptr != '\0') || !isfinite(alt)) {
            MY_LOG_INFO(TAG, "Invalid altitude: '%s'", argv[3]);
            return 1;
        }
    }

    if (argc >= 5 && argv[4] != NULL) {
        endptr = NULL;
        acc = strtof(argv[4], &endptr);
        if (endptr == argv[4] || (endptr != NULL && *endptr != '\0') || !isfinite(acc) || acc < 0.0f) {
            MY_LOG_INFO(TAG, "Invalid accuracy: '%s' (must be >= 0)", argv[4]);
            return 1;
        }
    }

    external_cap_gps_position.latitude = lat;
    external_cap_gps_position.longitude = lon;
    external_cap_gps_position.altitude = alt;
    external_cap_gps_position.accuracy = acc;
    external_cap_gps_position.valid = true;

    if (gps_module_uses_external_cap_feed(current_gps_module)) {
        gps_sync_from_selected_external_source();
    }

    MY_LOG_INFO(TAG, "External CAP GPS updated: Lat=%.7f Lon=%.7f Alt=%.2fm Acc=%.2fm",
                external_cap_gps_position.latitude, external_cap_gps_position.longitude,
                external_cap_gps_position.altitude, external_cap_gps_position.accuracy);

    {
        char oled_lat[20], oled_lon[20];
        snprintf(oled_lat, sizeof(oled_lat), "  Lat %.4f", external_cap_gps_position.latitude);
        snprintf(oled_lon, sizeof(oled_lon), "  Lon %.4f", external_cap_gps_position.longitude);
        oled_display_update_full("> GPS CAP Feed", oled_lat, oled_lon, "  Fix set");
    }

    if (!gps_module_uses_external_cap_feed(current_gps_module)) {
        MY_LOG_INFO(TAG, "Note: current module is %s. Run 'gps_set cap' to use this feed in wardrive.",
                    gps_get_module_name(current_gps_module));
    }
    return 0;
}

// Wardrive task function (runs in background)
static void wardrive_task(void *pvParameters) {
    (void)pvParameters;
    
    MY_LOG_INFO(TAG, "Wardrive task started.");
    
    // Set LED to indicate wardrive mode
    esp_err_t led_err = led_set_color(0, 255, 255); // Cyan
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for wardrive: %s", esp_err_to_name(led_err));
    }
    
    // Find the next file number by scanning existing files
    wardrive_file_counter = find_next_wardrive_file_number();
    MY_LOG_INFO(TAG, "Next wardrive file will be: w%d.log", wardrive_file_counter);
    {
        // Claimed up front rather than inside the scan loop: the counter is fixed for
        // the whole session, and the file has to be off-limits to the scan cache from
        // the moment it can first be created.
        char active_name[64];
        snprintf(active_name, sizeof(active_name), "w%d.log", wardrive_file_counter);
        wardrive_set_active_log(active_name);
    }
    
    // Wait for GPS fix before starting
    MY_LOG_INFO(TAG, "Waiting for GPS fix...");
    oled_display_update_full("> Wardrive", "  Waiting GPS...", "  Fix needed", "");
    if (!wait_for_gps_fix(120)) {  // Wait up to 120 seconds for GPS fix
        MY_LOG_INFO(TAG, "Warning: No GPS fix obtained, not continuing without GPS data - please ensure clear view of the sky and try again.");
        oled_display_update_full("> Wardrive", "  No GPS fix!", "  Stopping...", "");
        operation_stop_requested = true;
    } else {
        MY_LOG_INFO(TAG, "GPS fix obtained: Lat=%.7f Lon=%.7f", 
                   current_gps.latitude, current_gps.longitude);
        oled_display_update_full("> Wardrive", "  GPS fix OK!", "  Starting scans", "");
    }
    
    MY_LOG_INFO(TAG, "Wardrive started. Use 'stop' command to stop.");
    
    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    // Main wardrive loop (runs until user stops)
    int scan_counter = 0;
    while (wardrive_active && !operation_stop_requested) {
        // Check for stop request at the beginning of loop
        if (operation_stop_requested || !wardrive_active) {
            MY_LOG_INFO(TAG, "Wardrive: Stop requested, terminating...");
            operation_stop_requested = false;
            wardrive_active = false;
            break;
        }
        // Read GPS from selected source or pause if external fix is lost.
        if (external_feed) {
            gps_sync_from_selected_external_source();
            if (!current_gps.valid) {
                MY_LOG_INFO(TAG, "GPS fix lost! Pausing wardrive...");
                oled_display_update_full("> Wardrive", "  GPS fix lost!", "  Pausing...", "");
                while (!current_gps.valid && wardrive_active && !operation_stop_requested) {
                    gps_sync_from_selected_external_source();
                    vTaskDelay(pdMS_TO_TICKS(200));
                }
                if (operation_stop_requested || !wardrive_active) {
                    break;
                }
                MY_LOG_INFO(TAG, "GPS fix recovered: Lat=%.7f Lon=%.7f. Resuming wardrive.",
                            current_gps.latitude, current_gps.longitude);
                oled_display_update_full("> Wardrive", "  GPS recovered!", "  Resuming...", "");
            }
        } else {
            int len = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer, GPS_BUF_SIZE - 1, pdMS_TO_TICKS(100));
            if (len > 0) {
                wardrive_gps_buffer[len] = '\0';
                char* line = strtok(wardrive_gps_buffer, "\r\n");
                while (line != NULL) {
                    if (parse_gps_nmea(line)) {
                        MY_LOG_INFO(TAG, "GPS: Lat=%.7f Lon=%.7f Alt=%.1fm Acc=%.1fm",
                                   current_gps.latitude, current_gps.longitude,
                                   current_gps.altitude, current_gps.accuracy);
                    }
                    line = strtok(NULL, "\r\n");
                }
            }
        }

        float gps_lat = current_gps.latitude;
        float gps_lon = current_gps.longitude;
        float gps_alt = current_gps.altitude;
        float gps_acc = current_gps.accuracy;
        bool gps_valid_for_cycle = current_gps.valid;
        
