brokali/projectZeroTouch/ESP32C5/main/main.c
        // Scan WiFi networks
        wifi_scan_config_t scan_cfg = {
            .ssid = NULL,
            .bssid = NULL,
            .channel = 0,
            .show_hidden = true,
            .scan_type = WIFI_SCAN_TYPE_ACTIVE,
            .scan_time.active.min = 120,
            .scan_time.active.max = 700,
        };
        
        // Perform blocking scan to ensure results are ready before logging
        if (operation_stop_requested) {
            break;
        }
        esp_err_t scan_err = esp_wifi_scan_start(&scan_cfg, true);
        if (scan_err != ESP_OK) {
            vTaskDelay(pdMS_TO_TICKS(500));
            continue;
        }
        
        // If driver reported failure or no results, try a blocking fallback scan
        uint16_t scan_count = 0;
        esp_wifi_scan_get_ap_num(&scan_count);
        if ((scan_count == 0) || (g_last_scan_status != 0)) {
            wifi_scan_config_t fb_cfg = scan_cfg;
            fb_cfg.scan_time.active.min = 120;
            fb_cfg.scan_time.active.max = 700;
            esp_err_t fb = esp_wifi_scan_start(&fb_cfg, true); // blocking
            if (fb != ESP_OK) {
                continue;
            }
            scan_count = MAX_AP_CNT;
            esp_wifi_scan_get_ap_records(&scan_count, wardrive_scan_results);
        } else {
            scan_count = MAX_AP_CNT;
            esp_wifi_scan_get_ap_records(&scan_count, wardrive_scan_results);
        }

        // If still no records, fall back to the buffer populated by the event handler
        if (scan_count == 0 && g_scan_count > 0) {
            if (g_scan_count > MAX_AP_CNT) {
                scan_count = MAX_AP_CNT;
            } else {
                scan_count = g_scan_count;
            }
            memcpy(wardrive_scan_results, g_scan_results, scan_count * sizeof(wifi_ap_record_t));
        }

        MY_LOG_INFO(TAG, "Wardrive: scan_count=%u (status=%" PRIu32 ")", scan_count, g_last_scan_status);
        
        // Create filename (keep it simple for FAT filesystem)
        char filename[64];
        snprintf(filename, sizeof(filename), "/sdcard/lab/wardrives/w%d.log", wardrive_file_counter);
        
        // Check if /sdcard/lab/wardrives directory is accessible
        struct stat st;
        if (stat("/sdcard/lab/wardrives", &st) != 0) {
            MY_LOG_INFO(TAG, "Error: /sdcard/lab/wardrives directory not accessible");
            vTaskDelay(pdMS_TO_TICKS(1000));
            continue;
        }
        
        // Open file for appending
        FILE *file = fopen(filename, "a");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to open file %s, errno: %d (%s)", filename, errno, strerror(errno));
            
            // Try creating file with different approach
            file = fopen(filename, "w");
            if (file == NULL) {
                MY_LOG_INFO(TAG, "Failed to create file %s, errno: %d (%s)", filename, errno, strerror(errno));
                vTaskDelay(pdMS_TO_TICKS(1000));
                continue;
            }
            MY_LOG_INFO(TAG, "Successfully created file %s", filename);
        }
        
        // Write header if file is new
        fseek(file, 0, SEEK_END);
        if (ftell(file) == 0) {
            fprintf(file, "WigleWifi-1.6,appRelease=v1.1,model=Gen4,release=v1.0,device=Gen4Board,display=SPI TFT,board=ESP32C5,brand=Laboratorium\n");
            fprintf(file, "MAC,SSID,AuthMode,FirstSeen,Channel,Frequency,RSSI,CurrentLatitude,CurrentLongitude,AltitudeMeters,AccuracyMeters,RCOIs,MfgrId,Type\n");
        }
        
        // Get timestamp
        char timestamp[32];
        get_timestamp_string(timestamp, sizeof(timestamp));
        
        // Process scan results
        for (int i = 0; i < scan_count; i++) {
            wifi_ap_record_t *ap = &wardrive_scan_results[i];
            
            // Format MAC address
            char mac_str[18];
            snprintf(mac_str, sizeof(mac_str), "%02X:%02X:%02X:%02X:%02X:%02X",
                    ap->bssid[0], ap->bssid[1], ap->bssid[2],
                    ap->bssid[3], ap->bssid[4], ap->bssid[5]);
            
            // Escape SSID for CSV
            char escaped_ssid[64];
            escape_csv_field((const char*)ap->ssid, escaped_ssid, sizeof(escaped_ssid));
            
            // Get auth mode string
            const char* auth_mode = get_auth_mode_wiggle(ap->authmode);
            int wifi_freq_mhz = wigle_wifi_channel_to_frequency_mhz(ap->primary);
            
            // Format line for Wiggle format
            char line[512];
            if (gps_valid_for_cycle) {
                snprintf(line, sizeof(line), 
                        "%s,%s,[%s],%s,%d,%d,%d,%.7f,%.7f,%.2f,%.2f,,,WIFI\n",
                        mac_str, escaped_ssid, auth_mode, timestamp,
                        ap->primary, wifi_freq_mhz, ap->rssi,
                        gps_lat, gps_lon, gps_alt, gps_acc);
            } else {
                snprintf(line, sizeof(line), 
                        "%s,%s,[%s],%s,%d,%d,%d,0.0000000,0.0000000,0.00,0.00,,,WIFI\n",
                        mac_str, escaped_ssid, auth_mode, timestamp,
                        ap->primary, wifi_freq_mhz, ap->rssi);
            }
            
            // Write to file and print to UART
            fprintf(file, "%s", line);
            printf("%s", line);
        }
        
        // Close file to ensure data is written
        fclose(file);
        sd_sync();
        
        if (scan_count > 0) {
            MY_LOG_INFO(TAG, "Logged %d networks to %s", scan_count, filename);
        }
        
        scan_counter++;
        
        {
            char wd_l2[64], wd_l3[64], wd_l4[64];
            snprintf(wd_l2, sizeof(wd_l2), "  Scan #%d", scan_counter);
            snprintf(wd_l3, sizeof(wd_l3), "  %d nets logged", scan_count);
            snprintf(wd_l4, sizeof(wd_l4), "  w%d.log", wardrive_file_counter);
            oled_display_update_full("> Wardrive", wd_l2, wd_l3, wd_l4);
        }
        
        // Check for stop command
        if (operation_stop_requested || !wardrive_active) {
            MY_LOG_INFO(TAG, "Wardrive: Stop requested, terminating...");
            wardrive_active = false;
            operation_stop_requested = false;
            break;
        }
        
        // Yield to allow console processing
        taskYIELD();
        
        vTaskDelay(pdMS_TO_TICKS(5000)); // Wait 5 seconds between scans
    }
    
    // Clear LED after wardrive finishes
    led_err = led_set_idle();
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to restore idle LED after wardrive: %s", esp_err_to_name(led_err));
    }
    
    wardrive_active = false;
    wardrive_task_handle = NULL;
    wardrive_set_active_log(NULL);
    MY_LOG_INFO(TAG, "Wardrive stopped after %d scans. Last file: w%d.log", scan_counter, wardrive_file_counter);
    
