brokali/projectZeroTouch/ESP32C5/main/main.c
    vTaskDelete(NULL); // Delete this task
}

static int cmd_start_gps_raw(int argc, char **argv) {
    {
        const char *mod = gps_get_module_name(current_gps_module);
        oled_display_update_full("> GPS Raw", "  NMEA output", mod, "  Streaming...");
    }
    log_memory_info("start_gps_raw");

    if (gps_module_uses_external_feed(current_gps_module)) {
        MY_LOG_INFO(TAG, "start_gps_raw is unavailable in external GPS modes. Use '%s' instead.",
                    gps_external_position_command_name(current_gps_module));
        return 1;
    }

    int baud = gps_get_baud_for_module(current_gps_module);
    if (argc >= 2 && argv[1] != NULL) {
        char *endptr = NULL;
        long val = strtol(argv[1], &endptr, 10);
        if (endptr == argv[1] || (endptr != NULL && *endptr != '\0') || val <= 0) {
            MY_LOG_INFO(TAG, "Invalid baud rate '%s'. Use numeric value, e.g. 9600 or 115200.", argv[1]);
            return 1;
        }
        baud = (int)val;
    }

    if (gps_raw_active || gps_raw_task_handle != NULL) {
        MY_LOG_INFO(TAG, "GPS raw reader already running. Use 'stop' to stop it first.");
        return 1;
    }

    if (wardrive_active || wardrive_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start GPS raw while wardrive is active. Use 'stop' to stop wardrive first.");
        return 1;
    }

    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;

    esp_err_t ret = init_gps_uart(baud);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize GPS UART: %s", esp_err_to_name(ret));
        return 1;
    }

    gps_raw_active = true;
    BaseType_t result = xTaskCreate(
        gps_raw_task,
        "gps_raw_task",
        4096,
        NULL,
        4,
        &gps_raw_task_handle
    );

    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create GPS raw task!");
        gps_raw_active = false;
        gps_raw_task_handle = NULL;
        return 1;
    }

    MY_LOG_INFO(TAG, "GPS raw reader started at %d baud (%s). Use 'stop' to stop.",
                baud,
                gps_get_module_name(current_gps_module));
    return 0;
}

static int cmd_start_wardrive(int argc, char **argv) {
    (void)argc; (void)argv;
    oled_display_update_full("> Wardrive", "  GPS + WiFi", "  Logging to SD", "  Active...");
    log_memory_info("start_wardrive");
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        return 1;
    }
    
    // Check if wardrive is already running
    if (wardrive_active || wardrive_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Wardrive already running. Use 'stop' to stop it first.");
        return 1;
    }
    if (gps_raw_active || gps_raw_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Cannot start wardrive while GPS raw reader is running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Reset stop flag at the beginning of operation
    operation_stop_requested = false;
    
    MY_LOG_INFO(TAG, "Starting wardrive mode...");
    
    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    // Initialize GPS source
    esp_err_t ret = ESP_OK;
    if (!external_feed) {
        int wardrive_baud = gps_get_baud_for_module(current_gps_module);
        ret = init_gps_uart(wardrive_baud);
        if (ret != ESP_OK) {
            MY_LOG_INFO(TAG, "Failed to initialize GPS UART: %s", esp_err_to_name(ret));
            return 1;
        }
        MY_LOG_INFO(TAG, "GPS UART initialized on pins %d (TX) and %d (RX) at %d baud",
                    GPS_TX_PIN, GPS_RX_PIN, wardrive_baud);
    } else {
        MY_LOG_INFO(TAG, "Using external GPS feed. Provide fixes via '%s'.",
                    gps_external_position_command_name(current_gps_module));
    }
    
    // Initialize SD card main
    ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card: %s", esp_err_to_name(ret));
        return 1;
    }
    MY_LOG_INFO(TAG, "SD card initialized on pins MISO:%d MOSI:%d CLK:%d CS:%d", 
                SD_MISO_PIN, SD_MOSI_PIN, SD_CLK_PIN, SD_CS_PIN);
    
    // Start wardrive in background task
    wardrive_active = true;
    BaseType_t result = xTaskCreate(
        wardrive_task,
        "wardrive_task",
        8192,  // Stack size - needs to be large for file operations
        NULL,
        5,     // Priority
        &wardrive_task_handle
    );
    
    if (result != pdPASS) {
        MY_LOG_INFO(TAG, "Failed to create wardrive task!");
        wardrive_active = false;
        return 1;
    }
    
    MY_LOG_INFO(TAG, "Wardrive task started. Use 'stop' to stop.");
    return 0;
}

// HTML form for password input (default)
static const char* default_portal_html = 
"<!DOCTYPE html>"
"<html>"
"<head>"
"<meta charset='UTF-8'>"
"<meta name='viewport' content='width=device-width, initial-scale=1.0'>"
"<title>Portal Access</title>"
"<style>"
"body { font-family: Arial, sans-serif; background: #f0f0f0; margin: 0; padding: 20px; }"
".container { max-width: 400px; margin: 50px auto; background: white; padding: 30px; border-radius: 10px; box-shadow: 0 2px 10px rgba(0,0,0,0.1); }"
"h1 { text-align: center; color: #333; margin-bottom: 30px; }"
"form { display: flex; flex-direction: column; }"
"input[type='password'] { padding: 12px; margin: 10px 0; border: 1px solid #ddd; border-radius: 5px; font-size: 16px; }"
"button { padding: 12px; background: #007bff; color: white; border: none; border-radius: 5px; font-size: 16px; cursor: pointer; margin-top: 10px; }"
"button:hover { background: #0056b3; }"
"</style>"
"<script>"
"// Auto-redirect for captive portal detection"
"if (window.location.hostname !== '172.0.0.1') {"
"    window.location.href = 'http://172.0.0.1/';"
"}"
"</script>"
"</head>"
"<body>"
"<div class='container'>"
"<h1>Portal Access</h1>"
"<form method='POST' action='/login'>"
"<input type='password' name='password' placeholder='Enter password' required>"
"<button type='submit'>Log in</button>"
"</form>"
"</div>"
"</body>"
"</html>";

// HTTP handler for login form
static esp_err_t login_handler(httpd_req_t *req) {
    char buf[256];
    int ret = httpd_req_recv(req, buf, sizeof(buf) - 1);
    if (ret <= 0) {
        return ESP_FAIL;
    }
    buf[ret] = '\0';
    
    MY_LOG_INFO(TAG, "Received POST data: %s", buf);
    
    // Parse password from POST data
    char *password_start = strstr(buf, "password=");
    if (password_start) {
        password_start += 9; // Skip "password="
        char *password_end = strchr(password_start, '&');
        if (password_end) {
            *password_end = '\0';
        }
        
