brokali/projectZeroTouch/ESP32C5/main/main.c
    // Register RFC 8908 Captive Portal API endpoint for POST/OPTIONS
    httpd_uri_t captive_api_post_uri = {
        .uri = "/captive-portal/api",
        .method = HTTP_POST,
        .handler = captive_api_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_api_post_uri);
    
    // Register RFC 8908 Captive Portal API endpoint for OPTIONS
    httpd_uri_t captive_api_options_uri = {
        .uri = "/captive-portal/api",
        .method = HTTP_OPTIONS,
        .handler = captive_api_handler,
        .user_ctx = NULL
    };
    httpd_register_uri_handler(portal_server, &captive_api_options_uri);
    
    // Set portal as active (must be before starting DNS task)
    portal_active = true;
    MY_LOG_INFO(TAG, "Portal marked as active");
    
    // Start DNS server task
    BaseType_t task_ret = xTaskCreate(
        dns_server_task,
        "dns_server",
        4096,
        NULL,
        5,
        &dns_server_task_handle
    );
    
    if (task_ret != pdPASS) {
        portal_active = false;
        httpd_stop(portal_server);
        portal_server = NULL;
        esp_wifi_stop();
        return 1;
    }
    
    MY_LOG_INFO(TAG, "Captive portal started successfully!");
    MY_LOG_INFO(TAG, "AP Name: %s", ssid);
    MY_LOG_INFO(TAG, "Connect to '%s' WiFi network to access the portal", ssid);

    esp_err_t led_err = led_set_color(255, 0, 255); // Purple for portal mode
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for portal mode: %s", esp_err_to_name(led_err));
    }
    
    return 0;
}

// ===========================================================================
// Admin portal (start_admin_portal): WPA2 AP "JanOS-Admin" that reuses the
// captive portal AP/HTTP/DNS technique but serves a web-based file manager
// restricted to /sdcard/lab (directory tree, upload/download, rename/delete,
// text editing).
// ===========================================================================

#define ADMIN_ROOT_DIR "/sdcard/lab"
#define ADMIN_EDIT_MAX (256 * 1024)   // max bytes served to the text editor
#define ADMIN_IO_CHUNK 2048

// Single-page admin UI (no external assets, works offline behind captive portal)
static const char* admin_portal_html =
"<!DOCTYPE html><html><head><meta charset='UTF-8'>"
"<meta name='viewport' content='width=device-width, initial-scale=1.0'>"
"<title>JanOS Admin</title><style>"
":root{color-scheme:dark;--bg:#090a0c;--bg-top:#1b1d22;--panel:#131519;--panel-2:#1a1d22;--panel-3:#23262d;--line:#31353d;--line-strong:#4a4f59;--text:#f4f4f2;--muted:#babec5;--dim:#8c919a;--glow:0 22px 60px rgba(0,0,0,.38);}"
"*{box-sizing:border-box;}"
"body{margin:0;min-height:100vh;font-family:'Avenir Next','Segoe UI',sans-serif;background:radial-gradient(circle at top,var(--bg-top) 0%,#111318 34%,var(--bg) 100%);color:var(--text);letter-spacing:.01em;}"
".shell{max-width:1180px;margin:0 auto;padding:18px 16px 20px;}"
"header{padding:16px 18px;border:1px solid var(--line);border-radius:20px;background:linear-gradient(180deg,rgba(255,255,255,.06),rgba(255,255,255,.02));box-shadow:var(--glow);}"
".eyebrow{font-size:10px;letter-spacing:.16em;text-transform:uppercase;color:var(--dim);margin-bottom:8px;}"
"h1{margin:0;font-size:24px;line-height:1.05;font-weight:700;}"
"header p{margin:8px 0 0;color:var(--muted);font-size:13px;max-width:520px;}"
"#bar{margin-top:12px;padding:12px;border:1px solid var(--line);border-radius:18px;background:rgba(255,255,255,.03);display:flex;gap:8px;align-items:center;flex-wrap:wrap;box-shadow:var(--glow);}"
".path-wrap{display:flex;flex-direction:column;gap:3px;min-width:220px;padding:8px 12px;border:1px solid var(--line);border-radius:14px;background:var(--panel);}"
".path-label{font-size:10px;letter-spacing:.1em;text-transform:uppercase;color:var(--dim);}"
"#path{font-family:'SFMono-Regular',Consolas,Monaco,monospace;color:var(--text);word-break:break-all;}"
".spacer{flex:1 1 auto;}"
"input[type=file]{max-width:220px;color:var(--muted);font-size:12px;padding:7px 9px;border:1px solid var(--line);border-radius:12px;background:var(--panel);box-shadow:none;}"
"input[type=file]::file-selector-button{margin-right:8px;padding:7px 10px;border:1px solid var(--line-strong);border-radius:9px;background:#f2f2f0;color:#101114;font-weight:700;cursor:pointer;}"
"table{width:100%;border-collapse:separate;border-spacing:0;border:1px solid var(--line);border-radius:20px;overflow:hidden;background:var(--panel);box-shadow:var(--glow);}"
".table-wrap{margin-top:12px;overflow:hidden;border-radius:20px;}"
"th,td{padding:11px 12px;text-align:left;font-size:13px;border-bottom:1px solid var(--line);}"
"thead th{font-size:11px;letter-spacing:.16em;text-transform:uppercase;color:var(--dim);background:var(--panel-2);}"
"tbody tr:last-child td{border-bottom:none;}"
"tr:hover td{background:rgba(255,255,255,.04);}"
"td.size{color:var(--muted);white-space:nowrap;width:1%;}"
"td.actions{width:1%;white-space:nowrap;}"
"a.name{color:var(--text);cursor:pointer;text-decoration:none;font-weight:600;}"
"a.name:hover{text-decoration:underline;text-underline-offset:3px;}"
"button{appearance:none;display:inline-flex;align-items:center;justify-content:center;border:1px solid var(--line-strong);border-radius:10px;padding:8px 12px;min-height:36px;background:linear-gradient(180deg,var(--panel-3),var(--panel-2));color:var(--text);cursor:pointer;font-size:12px;font-weight:600;line-height:1.2;text-align:center;white-space:nowrap;word-break:normal;overflow-wrap:normal;transition:background .15s ease,border-color .15s ease,transform .15s ease;}"
"button:hover{background:linear-gradient(180deg,#2d3138,#20242a);border-color:#656b77;transform:translateY(-1px);}"
"button.danger{background:linear-gradient(180deg,#f4f4f2,#d8d8d5);color:#111215;border-color:#f4f4f2;}"
"button.danger:hover{background:linear-gradient(180deg,#ffffff,#e5e5e1);border-color:#ffffff;}"
".act{display:flex;gap:6px;flex-wrap:wrap;justify-content:flex-end;}"
"#msg{margin-top:10px;padding:10px 12px;border:1px solid var(--line);border-radius:14px;background:rgba(255,255,255,.035);color:var(--muted);font-size:12px;}"
"#msg:empty{display:none;}"
"#editor{position:fixed;inset:0;padding:14px;background:rgba(5,6,8,.76);backdrop-filter:blur(10px);display:none;align-items:center;justify-content:center;z-index:10;}"
".editor-shell{width:min(1100px,100%);height:min(88vh,100%);display:flex;flex-direction:column;border:1px solid var(--line);border-radius:20px;overflow:hidden;background:var(--panel);box-shadow:var(--glow);}"
"#editbar{padding:12px 14px;background:var(--panel-2);display:flex;gap:8px;align-items:center;border-bottom:1px solid var(--line);}"
"#efn{font-family:'SFMono-Regular',Consolas,Monaco,monospace;flex:1;color:var(--muted);overflow:hidden;text-overflow:ellipsis;white-space:nowrap;}"
"#editor textarea{flex:1;width:100%;background:#0f1114;color:var(--text);border:none;font-family:'SFMono-Regular',Consolas,Monaco,monospace;font-size:13px;line-height:1.5;padding:14px;resize:none;outline:none;}"
"@media (max-width:760px){.shell{padding:12px 10px 16px;}header{padding:14px 14px 15px;border-radius:16px;}h1{font-size:20px;}header p{font-size:12px;}.eyebrow{margin-bottom:6px;}#bar{padding:10px;align-items:stretch;}.path-wrap{width:100%;min-width:0;}.spacer{display:none;}input[type=file]{max-width:none;width:100%;}#bar>button,#bar>input[type=file],#bar>.path-wrap{width:100%;}table{border:none;background:transparent;box-shadow:none;}thead{display:none;}tbody,tr,td{display:block;width:100%;}tr{margin:0 0 8px;border:1px solid var(--line);border-radius:14px;background:var(--panel);overflow:hidden;box-shadow:var(--glow);}td{padding:8px 10px;border-bottom:1px solid var(--line);}td:last-child{border-bottom:none;}td.size{font-size:12px;white-space:normal;}td.size:before{content:'Size';display:block;margin-bottom:3px;font-size:10px;letter-spacing:.1em;text-transform:uppercase;color:var(--dim);}td.actions:before{content:'Actions';display:block;margin-bottom:5px;font-size:10px;letter-spacing:.1em;text-transform:uppercase;color:var(--dim);}td.actions{width:100%;max-width:none;white-space:normal;}.act{display:block;width:100%;max-width:none;}.act button{display:flex;width:100%;max-width:none;min-width:100%;min-height:44px;margin:0 0 8px;padding:11px 12px;font-size:14px;line-height:1.25;text-align:center;justify-content:center;white-space:nowrap;word-break:normal;overflow-wrap:normal;}.act button:last-child{margin-bottom:0;}.table-wrap{overflow:visible;border-radius:0;}#editor{padding:6px;}.editor-shell{height:100%;border-radius:14px;}#editbar{padding:10px;flex-wrap:wrap;}#editbar button{width:auto;}}"
"</style><script>"
"if(location.hostname!=='172.0.0.1'){location.href='http://172.0.0.1/';}"
"var cwd='';var editFile='';"
"function j(p){return encodeURIComponent(p);}"
"function child(n){return cwd?cwd+'/'+n:n;}"
"function msg(t){document.getElementById('msg').textContent=t;}"
"function row(){var tr=document.createElement('tr');var td1=document.createElement('td');"
"var a=document.createElement('a');td1.appendChild(a);var td2=document.createElement('td');"
"td2.className='size';var td3=document.createElement('td');td3.className='actions';"
"var acts=document.createElement('div');acts.className='act';td3.appendChild(acts);"
"tr.appendChild(td1);tr.appendChild(td2);"
"tr.appendChild(td3);document.getElementById('tbody').appendChild(tr);return {name:a,size:td2,act:acts};}"
"function btn(label,fn,cls){var b=document.createElement('button');b.textContent=label;"
"if(cls)b.className=cls;b.onclick=fn;return b;}"
"function load(){fetch('/api/list?path='+j(cwd)).then(r=>r.json()).then(items=>{"
"document.getElementById('path').textContent='/lab/'+cwd;"
"items.sort((a,b)=>a.dir!==b.dir?(a.dir?-1:1):a.name.localeCompare(b.name));"
"var tb=document.getElementById('tbody');tb.innerHTML='';"
"if(cwd){var u=row();u.name.textContent='.. (up)';u.name.className='name';u.name.onclick=up;}"
"items.forEach(it=>{var r=row();"
"if(it.dir){r.name.textContent='[DIR] '+it.name;r.name.className='name';r.name.onclick=()=>enter(it.name);"
"r.size.textContent='';r.act.appendChild(btn('Rename',()=>ren(it.name)));"
"r.act.appendChild(btn('Delete',()=>del(it.name),'danger'));}"
"else{r.name.textContent=it.name;r.size.textContent=it.size;"
"r.act.appendChild(btn('Download',()=>dl(it.name)));r.act.appendChild(btn('Edit',()=>edit(it.name)));"
"r.act.appendChild(btn('Rename',()=>ren(it.name)));r.act.appendChild(btn('Delete',()=>del(it.name),'danger'));}"
"});msg('');}).catch(e=>msg('List error: '+e));}"
"function up(){cwd=cwd.split('/').slice(0,-1).join('/');load();}"
"function enter(n){cwd=child(n);load();}"
"function dl(n){location.href='/api/download?path='+j(child(n));}"
"function del(n){if(!confirm('Delete '+n+'?'))return;"
"fetch('/api/delete?path='+j(child(n)),{method:'POST'}).then(r=>{msg(r.ok?'Deleted '+n:'Delete failed');load();});}"
"function ren(n){var nn=prompt('New name for '+n,n);if(!nn||nn===n)return;"
"var body='from='+j(child(n))+'&to='+j(child(nn));"
"fetch('/api/rename',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:body})"
".then(r=>{msg(r.ok?'Renamed':'Rename failed');load();});}"
"function edit(n){editFile=child(n);fetch('/api/read?path='+j(editFile)).then(r=>r.text()).then(t=>{"
"document.getElementById('ta').value=t;document.getElementById('efn').textContent=editFile;"
"document.getElementById('editor').style.display='flex';});}"
"function saveEdit(){fetch('/api/write?path='+j(editFile),{method:'POST',body:document.getElementById('ta').value})"
".then(r=>{msg(r.ok?'Saved '+editFile:'Save failed');closeEdit();load();});}"
"function closeEdit(){document.getElementById('editor').style.display='none';}"
"function doUpload(){var f=document.getElementById('file').files[0];if(!f){msg('Choose a file first');return;}"
"msg('Uploading '+f.name+'...');fetch('/api/upload?path='+j(child(f.name)),{method:'POST',body:f})"
".then(r=>{msg(r.ok?'Uploaded '+f.name:'Upload failed');load();});}"
"</script></head><body><div class='shell'>"
"<header><div class='eyebrow'>JanOS Admin</div><h1>File Manager</h1><p>Direct access to /sdcard/lab.</p></header>"
"<div id='bar'><button onclick='up()'>Up</button><div class='path-wrap'><span class='path-label'>Current path</span><span id='path'>/lab/</span></div>"
"<span class='spacer'></span><input type='file' id='file'><button onclick='doUpload()'>Upload</button></div>"
"<div id='msg'></div>"
"<div class='table-wrap'><table><thead><tr><th>Name</th><th>Size</th><th>Actions</th></tr></thead><tbody id='tbody'></tbody></table></div></div>"
"<div id='editor'><div class='editor-shell'><div id='editbar'><span id='efn'></span>"
"<button onclick='saveEdit()'>Save</button><button class='danger' onclick='closeEdit()'>Close</button></div>"
"<textarea id='ta' spellcheck='false'></textarea></div></div>"
"<script>load();</script></body></html>";

