brokali/projectZeroTouch/ESP32C5/main/main.c
// Build an absolute SD path under ADMIN_ROOT_DIR from a caller-supplied
// relative path. Rejects any path containing ".." to prevent escaping the
// sandbox. Leading and trailing slashes are trimmed.
static bool build_admin_path(char *dest, size_t dest_size, const char *rel) {
    if (!dest || dest_size == 0) {
        return false;
    }
    if (!rel) {
        rel = "";
    }
    while (*rel == '/') {
        rel++;
    }
    if (strstr(rel, "..") != NULL) {
        return false;
    }
    int written;
    if (rel[0] == '\0') {
        written = snprintf(dest, dest_size, "%s", ADMIN_ROOT_DIR);
    } else {
        written = snprintf(dest, dest_size, "%s/%s", ADMIN_ROOT_DIR, rel);
    }
    if (written < 0 || (size_t)written >= dest_size) {
        return false;
    }
    size_t len = strlen(dest);
    size_t root_len = strlen(ADMIN_ROOT_DIR);
    while (len > root_len && dest[len - 1] == '/') {
        dest[--len] = '\0';
    }
    return true;
}

// Decode an application/x-www-form-urlencoded value (%XX and '+').
static void admin_url_decode(char *dst, const char *src, size_t dst_size) {
    size_t di = 0;
    for (const char *p = src; *p && di + 1 < dst_size; p++) {
        if (*p == '%' && p[1] && p[2]) {
            char hex[3] = { p[1], p[2], '\0' };
            dst[di++] = (char)strtol(hex, NULL, 16);
            p += 2;
        } else if (*p == '+') {
            dst[di++] = ' ';
        } else {
            dst[di++] = *p;
        }
    }
    dst[di] = '\0';
}

// Minimal JSON string escaping for file names.
static void admin_json_escape(char *dst, const char *src, size_t dst_size) {
    size_t di = 0;
    for (const char *p = src; *p && di + 7 < dst_size; p++) {
        unsigned char c = (unsigned char)*p;
        if (c == '"' || c == '\\') {
            dst[di++] = '\\';
            dst[di++] = c;
        } else if (c < 0x20) {
            di += snprintf(dst + di, dst_size - di, "\\u%04x", c);
        } else {
            dst[di++] = c;
        }
    }
    dst[di] = '\0';
}

// Resolve the "path" query parameter of a request into an absolute SD path
// inside the sandbox. Returns false on missing/invalid path.
static bool admin_resolve_query_path(httpd_req_t *req, char *full, size_t full_size) {
    char rel_enc[SD_PATH_MAX];
    char rel[SD_PATH_MAX];
    rel_enc[0] = '\0';

    size_t qlen = httpd_req_get_url_query_len(req);
    if (qlen > 0) {
        char *query = malloc(qlen + 1);
        if (query) {
            if (httpd_req_get_url_query_str(req, query, qlen + 1) == ESP_OK) {
                if (httpd_query_key_value(query, "path", rel_enc, sizeof(rel_enc)) != ESP_OK) {
                    rel_enc[0] = '\0';
                }
            }
            free(query);
        }
    }
    admin_url_decode(rel, rel_enc, sizeof(rel));
    return build_admin_path(full, full_size, rel);
}

// Stream the request body into an already-open file, in chunks.
static esp_err_t admin_recv_body_to_file(httpd_req_t *req, const char *full) {
    FILE *f = fopen(full, "wb");
    if (!f) {
        return ESP_FAIL;
    }
    char *buf = malloc(ADMIN_IO_CHUNK);
    if (!buf) {
        fclose(f);
        return ESP_FAIL;
    }
    esp_err_t res = ESP_OK;
    int remaining = req->content_len;
    while (remaining > 0) {
        int to_read = remaining < ADMIN_IO_CHUNK ? remaining : ADMIN_IO_CHUNK;
        int received = httpd_req_recv(req, buf, to_read);
        if (received <= 0) {
            if (received == HTTPD_SOCK_ERR_TIMEOUT) {
                continue;
            }
            res = ESP_FAIL;
            break;
        }
        if (fwrite(buf, 1, received, f) != (size_t)received) {
            res = ESP_FAIL;
            break;
        }
        remaining -= received;
    }
    free(buf);
    fclose(f);
    return res;
}

// GET / and catch-all: serve the admin UI.
static esp_err_t admin_root_handler(httpd_req_t *req) {
    httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, admin_portal_html, HTTPD_RESP_USE_STRLEN);
    return ESP_OK;
}

// GET /api/list?path=<rel> -> JSON array of {name,dir,size}
static esp_err_t admin_list_handler(httpd_req_t *req) {
    char full[SD_PATH_MAX];
    if (!admin_resolve_query_path(req, full, sizeof(full))) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid path");
        return ESP_FAIL;
    }
    if (init_sd_card() != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD card error");
        return ESP_FAIL;
    }
    DIR *dir = opendir(full);
    if (!dir) {
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "Directory not found");
        return ESP_FAIL;
    }
    httpd_resp_set_type(req, "application/json");
    httpd_resp_sendstr_chunk(req, "[");
    struct dirent *entry;
    bool first = true;
    char item[SD_PATH_MAX + 320];
    char esc[256];
    char child[SD_PATH_MAX];
    while ((entry = readdir(dir)) != NULL) {
        if (entry->d_name[0] == '.' &&
            (entry->d_name[1] == '\0' ||
             (entry->d_name[1] == '.' && entry->d_name[2] == '\0'))) {
            continue;
        }
        long size = 0;
        bool isdir = (entry->d_type == DT_DIR);
        if (snprintf(child, sizeof(child), "%s/%s", full, entry->d_name) < (int)sizeof(child)) {
            struct stat st;
            if (stat(child, &st) == 0) {
                size = (long)st.st_size;
                isdir = S_ISDIR(st.st_mode);
            }
        }
        admin_json_escape(esc, entry->d_name, sizeof(esc));
        snprintf(item, sizeof(item), "%s{\"name\":\"%s\",\"dir\":%s,\"size\":%ld}",
                 first ? "" : ",", esc, isdir ? "true" : "false", size);
        httpd_resp_sendstr_chunk(req, item);
        first = false;
    }
    closedir(dir);
    httpd_resp_sendstr_chunk(req, "]");
    httpd_resp_sendstr_chunk(req, NULL);
    return ESP_OK;
}

// GET /api/download?path=<rel> -> raw file (chunked)
static esp_err_t admin_download_handler(httpd_req_t *req) {
    httpd_resp_set_hdr(req, "Accept-Ranges", "bytes");

    char full[SD_PATH_MAX];
    if (!admin_resolve_query_path(req, full, sizeof(full))) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid path");
        return ESP_FAIL;
    }
    if (init_sd_card() != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD card error");
        return ESP_FAIL;
    }
    FILE *f = fopen(full, "rb");
    if (!f) {
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "File not found");
        return ESP_FAIL;
    }

    if (fseek(f, 0, SEEK_END) != 0) {
        fclose(f);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File size error");
        return ESP_FAIL;
    }
    long file_size_long = ftell(f);
    if (file_size_long < 0 || fseek(f, 0, SEEK_SET) != 0) {
        fclose(f);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File size error");
        return ESP_FAIL;
    }

