brokali/projectZeroTouch/ESP32C5/main/main.c
    uint64_t file_size = (uint64_t)file_size_long;
    uint64_t range_start = 0;
    uint64_t range_end = file_size > 0 ? file_size - 1 : 0;
    bool partial = false;
    bool range_unsatisfiable = false;
    char range_hdr[64];

    if (httpd_req_get_hdr_value_str(req, "Range", range_hdr, sizeof(range_hdr)) == ESP_OK &&
        strncmp(range_hdr, "bytes=", 6) == 0) {
        const char *start_text = range_hdr + 6;
        if (isdigit((unsigned char)*start_text)) {
            char *after_start;
            errno = 0;
            unsigned long long parsed_start = strtoull(start_text, &after_start, 10);
            if (errno != ERANGE && after_start != start_text && *after_start == '-') {
                const char *end_text = after_start + 1;
                unsigned long long parsed_end = 0;
                bool valid_end = (*end_text == '\0');
                if (!valid_end && isdigit((unsigned char)*end_text)) {
                    char *after_end;
                    errno = 0;
                    parsed_end = strtoull(end_text, &after_end, 10);
                    valid_end = (errno != ERANGE && after_end != end_text && *after_end == '\0');
                }

                if (valid_end && (*end_text == '\0' || parsed_end >= parsed_start)) {
                    range_start = (uint64_t)parsed_start;
                    if (range_start >= file_size) {
                        range_unsatisfiable = true;
                    } else {
                        range_end = *end_text == '\0' ? file_size - 1 : (uint64_t)parsed_end;
                        if (range_end >= file_size) {
                            range_end = file_size - 1;
                        }
                        partial = true;
                    }
                }
            }
        }
    }

    char content_range[80];
    if (range_unsatisfiable) {
        snprintf(content_range, sizeof(content_range), "bytes */%" PRIu64, file_size);
        httpd_resp_set_status(req, "416 Range Not Satisfiable");
        httpd_resp_set_hdr(req, "Content-Range", content_range);
        fclose(f);
        httpd_resp_send(req, NULL, 0);
        return ESP_OK;
    }

    if (partial) {
        if (fseek(f, (long)range_start, SEEK_SET) != 0) {
            fclose(f);
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File seek error");
            return ESP_FAIL;
        }
        snprintf(content_range, sizeof(content_range), "bytes %" PRIu64 "-%" PRIu64 "/%" PRIu64,
                 range_start, range_end, file_size);
        httpd_resp_set_status(req, "206 Partial Content");
        httpd_resp_set_hdr(req, "Content-Range", content_range);
    }

    const char *base = strrchr(full, '/');
    base = base ? base + 1 : full;
    char cd[SD_PATH_MAX + 32];
    snprintf(cd, sizeof(cd), "attachment; filename=\"%s\"", base);
    httpd_resp_set_type(req, "application/octet-stream");
    httpd_resp_set_hdr(req, "Content-Disposition", cd);
    char *buf = malloc(ADMIN_IO_CHUNK);
    if (!buf) {
        fclose(f);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OOM");
        return ESP_FAIL;
    }
    uint64_t remaining = partial ? range_end - range_start + 1 : 0;
    size_t r;
    while (!partial || remaining > 0) {
        size_t to_read = partial && remaining < ADMIN_IO_CHUNK ?
                         (size_t)remaining : ADMIN_IO_CHUNK;
        r = fread(buf, 1, to_read, f);
        if (r == 0) {
            break;
        }
        if (httpd_resp_send_chunk(req, buf, r) != ESP_OK) {
            break;
        }
        if (partial) {
            remaining -= r;
        }
    }
    free(buf);
    fclose(f);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

// GET /api/read?path=<rel> -> file content as text (capped at ADMIN_EDIT_MAX)
static esp_err_t admin_read_handler(httpd_req_t *req) {
    char full[SD_PATH_MAX];
    if (!admin_resolve_query_path(req, full, sizeof(full))) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid path");
        return ESP_FAIL;
    }
    if (init_sd_card() != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD card error");
        return ESP_FAIL;
    }
    FILE *f = fopen(full, "rb");
    if (!f) {
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "File not found");
        return ESP_FAIL;
    }
    httpd_resp_set_type(req, "text/plain; charset=utf-8");
    char *buf = malloc(ADMIN_IO_CHUNK);
    if (!buf) {
        fclose(f);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "OOM");
        return ESP_FAIL;
    }
    size_t total = 0;
    size_t r;
    while ((r = fread(buf, 1, ADMIN_IO_CHUNK, f)) > 0) {
        if (total + r > ADMIN_EDIT_MAX) {
            size_t allowed = ADMIN_EDIT_MAX - total;
            if (allowed > 0) {
                httpd_resp_send_chunk(req, buf, allowed);
            }
            break;
        }
        if (httpd_resp_send_chunk(req, buf, r) != ESP_OK) {
            break;
        }
        total += r;
    }
    free(buf);
    fclose(f);
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}

// POST /api/upload?path=<rel> -> store raw request body as file
static esp_err_t admin_upload_handler(httpd_req_t *req) {
    char full[SD_PATH_MAX];
    if (!admin_resolve_query_path(req, full, sizeof(full))) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid path");
        return ESP_FAIL;
    }
    if (init_sd_card() != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD card error");
        return ESP_FAIL;
    }
    if (admin_recv_body_to_file(req, full) != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Write failed");
        return ESP_FAIL;
    }
    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

// POST /api/write?path=<rel> -> overwrite file with request body (text editor)
static esp_err_t admin_write_handler(httpd_req_t *req) {
    return admin_upload_handler(req);
}

