brokali/projectZeroTouch/ESP32C5/main/main.c
// POST /api/rename  body: from=<rel>&to=<rel>
static esp_err_t admin_rename_handler(httpd_req_t *req) {
    char body[2 * SD_PATH_MAX];
    int len = httpd_req_recv(req, body, sizeof(body) - 1);
    if (len <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Empty body");
        return ESP_FAIL;
    }
    body[len] = '\0';

    char from_enc[SD_PATH_MAX];
    char to_enc[SD_PATH_MAX];
    if (httpd_query_key_value(body, "from", from_enc, sizeof(from_enc)) != ESP_OK ||
        httpd_query_key_value(body, "to", to_enc, sizeof(to_enc)) != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Missing from/to");
        return ESP_FAIL;
    }

    char from_rel[SD_PATH_MAX];
    char to_rel[SD_PATH_MAX];
    admin_url_decode(from_rel, from_enc, sizeof(from_rel));
    admin_url_decode(to_rel, to_enc, sizeof(to_rel));

    char from_full[SD_PATH_MAX];
    char to_full[SD_PATH_MAX];
    if (!build_admin_path(from_full, sizeof(from_full), from_rel) ||
        !build_admin_path(to_full, sizeof(to_full), to_rel)) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid path");
        return ESP_FAIL;
    }
    if (init_sd_card() != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD card error");
        return ESP_FAIL;
    }
    if (rename(from_full, to_full) != 0) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Rename failed");
        return ESP_FAIL;
    }
    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

// POST /api/delete?path=<rel> -> remove file or empty directory
static esp_err_t admin_delete_handler(httpd_req_t *req) {
    char full[SD_PATH_MAX];
    if (!admin_resolve_query_path(req, full, sizeof(full))) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Invalid path");
        return ESP_FAIL;
    }
    if (init_sd_card() != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "SD card error");
        return ESP_FAIL;
    }
    struct stat st;
    if (stat(full, &st) != 0) {
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, "Not found");
        return ESP_FAIL;
    }
    int rc = S_ISDIR(st.st_mode) ? rmdir(full) : remove(full);
    if (rc != 0) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Delete failed");
        return ESP_FAIL;
    }
    httpd_resp_sendstr(req, "OK");
    return ESP_OK;
}

// CLI command: start_admin_portal <password>
// Brings up a WPA2 AP named "JanOS-Admin" and serves the file-manager UI.
static int cmd_start_admin_portal(int argc, char **argv) {
    oled_display_update_full("> Admin Portal",
        "  JanOS-Admin",
        "  File manager", "  Active...");
    log_memory_info("start_admin_portal");

    if (argc < 2) {
        MY_LOG_INFO(TAG, "Usage: start_admin_portal <password>");
        MY_LOG_INFO(TAG, "Example: start_admin_portal MySecret123");
        return 1;
    }

    const char *password = argv[1];
    size_t password_len = strlen(password);
    if (password_len < 8 || password_len > 63) {
        MY_LOG_INFO(TAG, "Password length must be between 8 and 63 characters for WPA2");
        return 1;
    }

    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal already running. Use 'stop' to stop it first.");
        return 0;
    }

    if (!ensure_wifi_mode()) {
        return 1;
    }

    // SD card is required for the file manager
    if (init_sd_card() != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card. Make sure it is inserted.");
        return 1;
    }

    const char *ssid = "JanOS-Admin";
    size_t ssid_len = strlen(ssid);

    // Store portal SSID for logging/OLED/stop consistency
    if (portalSSID != NULL) {
        free(portalSSID);
    }
    portalSSID = malloc(ssid_len + 1);
    if (portalSSID != NULL) {
        strcpy(portalSSID, ssid);
    }

    MY_LOG_INFO(TAG, "Starting admin portal AP: %s", ssid);

    esp_netif_t *ap_netif = ensure_ap_mode();
    if (!ap_netif) {
        MY_LOG_INFO(TAG, "Failed to enable AP mode");
        return 1;
    }

    esp_netif_dhcps_stop(ap_netif);

    esp_netif_ip_info_t ip_info;
    ip_info.ip.addr = esp_ip4addr_aton("172.0.0.1");
    ip_info.gw.addr = esp_ip4addr_aton("172.0.0.1");
    ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
    if (esp_netif_set_ip_info(ap_netif, &ip_info) != ESP_OK) {
        return 1;
    }

    wifi_config_t ap_config = {0};
    memcpy(ap_config.ap.ssid, ssid, ssid_len);
    ap_config.ap.ssid_len = ssid_len;
    ap_config.ap.channel = 1;
    strncpy((char*)ap_config.ap.password, password, sizeof(ap_config.ap.password) - 1);
    ap_config.ap.max_connection = 4;
    ap_config.ap.authmode = WIFI_AUTH_WPA2_PSK;

    esp_err_t ret = esp_wifi_set_config(WIFI_IF_AP, &ap_config);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP config: %s", esp_err_to_name(ret));
        return 1;
    }

    ret = esp_netif_dhcps_start(ap_netif);
    if (ret != ESP_OK) {
        esp_wifi_stop();
        return 1;
    }

    vTaskDelay(pdMS_TO_TICKS(1000));

    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.server_port = 80;
    config.max_open_sockets = 7;
    config.max_uri_handlers = 16;
    config.uri_match_fn = httpd_uri_match_wildcard;

    esp_err_t http_ret = httpd_start(&portal_server, &config);
    if (http_ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to start HTTP server: %s", esp_err_to_name(http_ret));
        esp_wifi_stop();
        return 1;
    }

    // API endpoints must be registered before the "/*" catch-all so they win
    // the (registration-order) match under wildcard matching.
    httpd_uri_t list_uri = { .uri = "/api/list", .method = HTTP_GET, .handler = admin_list_handler };
    httpd_register_uri_handler(portal_server, &list_uri);

    httpd_uri_t download_uri = { .uri = "/api/download", .method = HTTP_GET, .handler = admin_download_handler };
    httpd_register_uri_handler(portal_server, &download_uri);

    httpd_uri_t read_uri = { .uri = "/api/read", .method = HTTP_GET, .handler = admin_read_handler };
    httpd_register_uri_handler(portal_server, &read_uri);

    httpd_uri_t upload_uri = { .uri = "/api/upload", .method = HTTP_POST, .handler = admin_upload_handler };
    httpd_register_uri_handler(portal_server, &upload_uri);

