brokali/projectZeroTouch/ESP32C5/main/main.c
    return 0;
}

// ============================================================================
// BLE Scanner Functions (NimBLE)
// ============================================================================

/**
 * Check if BLE device was already found (for deduplication)
 */
static bool bt_is_device_found(const uint8_t *addr)
{
    for (int i = 0; i < bt_found_device_count; i++) {
        if (memcmp(bt_found_devices[i], addr, 6) == 0) {
            return true;
        }
    }
    return false;
}

/**
 * Find device index by MAC address in bt_devices array
 * Returns -1 if not found
 */
static int bt_find_device_index(const uint8_t *addr)
{
    for (int i = 0; i < bt_device_count; i++) {
        if (memcmp(bt_devices[i].addr, addr, 6) == 0) {
            return i;
        }
    }
    return -1;
}

static bool bt_grow_storage_if_needed(int required_count)
{
    if (required_count <= bt_device_capacity && required_count <= bt_found_device_capacity) {
        return true;
    }

    int new_capacity = bt_device_capacity > bt_found_device_capacity ? bt_device_capacity : bt_found_device_capacity;
    if (new_capacity <= 0) {
        new_capacity = BT_INITIAL_CAPACITY;
    }
    while (new_capacity < required_count) {
        new_capacity *= 2;
    }

    uint8_t (*new_found_devices)[6] = heap_caps_calloc(new_capacity, sizeof(*bt_found_devices), MALLOC_CAP_SPIRAM);
    if (!new_found_devices) {
        MY_LOG_INFO(TAG, "Failed to grow BLE dedup buffer to %d entries", new_capacity);
        return false;
    }

    bt_device_info_t *new_bt_devices = heap_caps_calloc(new_capacity, sizeof(bt_device_info_t), MALLOC_CAP_SPIRAM);
    if (!new_bt_devices) {
        free(new_found_devices);
        MY_LOG_INFO(TAG, "Failed to grow BLE device buffer to %d entries", new_capacity);
        return false;
    }

    if (bt_found_devices && bt_found_device_count > 0) {
        memcpy(new_found_devices, bt_found_devices,
               (size_t)bt_found_device_count * sizeof(*bt_found_devices));
    }
    if (bt_devices && bt_device_count > 0) {
        memcpy(new_bt_devices, bt_devices,
               (size_t)bt_device_count * sizeof(bt_device_info_t));
    }

    free(bt_found_devices);
    free(bt_devices);
    bt_found_devices = new_found_devices;
    bt_devices = new_bt_devices;
    bt_found_device_capacity = new_capacity;
    bt_device_capacity = new_capacity;
    MY_LOG_INFO(TAG, "BLE device buffers grown to %d entries", new_capacity);
    return true;
}

/**
 * Add BLE device to found list
 */
static bool bt_add_found_device(const uint8_t *addr)
{
    if (!bt_grow_storage_if_needed(bt_found_device_count + 1)) {
        return false;
    }
    memcpy(bt_found_devices[bt_found_device_count], addr, 6);
    bt_found_device_count++;
    return true;
}

/**
 * Reset BLE scan counters
 */
static void bt_reset_counters(void)
{
    bt_airtag_count = 0;
    bt_smarttag_count = 0;
    bt_found_device_count = 0;
    bt_device_count = 0;
    if (bt_found_devices && bt_found_device_capacity > 0) {
        memset(bt_found_devices, 0, (size_t)bt_found_device_capacity * sizeof(*bt_found_devices));
    }
    if (bt_devices && bt_device_capacity > 0) {
        memset(bt_devices, 0, (size_t)bt_device_capacity * sizeof(bt_device_info_t));
    }
}

/**
 * Format BLE MAC address to string
 */
static void bt_format_addr(const uint8_t *addr, char *str)
{
    sprintf(str, "%02X:%02X:%02X:%02X:%02X:%02X",
            addr[5], addr[4], addr[3], addr[2], addr[1], addr[0]);
}

static int wigle_wifi_channel_to_frequency_mhz(int channel)
{
    if (channel == 14) {
        return 2484;
    }
    if (channel >= 1 && channel <= 13) {
        return 2407 + (channel * 5);
    }
    if (channel >= 32 && channel <= 177) {
        return 5000 + (channel * 5);
    }
    return 0;
}

static double gps_distance_meters(double lat1, double lon1, double lat2, double lon2)
{
    const double earth_radius_m = 6371000.0;
    const double deg_to_rad = 0.017453292519943295;
    double dlat = (lat2 - lat1) * deg_to_rad;
    double dlon = (lon2 - lon1) * deg_to_rad;
    double a_lat1 = lat1 * deg_to_rad;
    double a_lat2 = lat2 * deg_to_rad;
    double sin_dlat = sin(dlat / 2.0);
    double sin_dlon = sin(dlon / 2.0);
    double a = sin_dlat * sin_dlat +
               cos(a_lat1) * cos(a_lat2) * sin_dlon * sin_dlon;
    double c = 2.0 * atan2(sqrt(a), sqrt(1.0 - a));
    return earth_radius_m * c;
}

// Escape a UTF-8 string for XML text/attribute content. Multi-byte UTF-8 sequences
// pass through unchanged (valid in a UTF-8 document); C0 control chars are dropped.
static void xml_escape(const char *in, char *out, size_t outsz)
{
    size_t o = 0;
    if (outsz == 0) return;
    for (size_t i = 0; in && in[i] && o + 7 < outsz; i++) {
        unsigned char c = (unsigned char)in[i];
        const char *rep = NULL;
        size_t rlen = 0;
        switch (c) {
            case '&':  rep = "&amp;";  rlen = 5; break;
            case '<':  rep = "&lt;";   rlen = 4; break;
            case '>':  rep = "&gt;";   rlen = 4; break;
            case '"':  rep = "&quot;"; rlen = 6; break;
            case '\'': rep = "&#39;";  rlen = 5; break;
            default: break;
        }
        if (rep) {
            memcpy(out + o, rep, rlen);
            o += rlen;
        } else if (c < 0x20 && c != '\n' && c != '\t') {
            // drop other control characters
        } else {
            out[o++] = (char)c;
        }
    }
    out[o] = '\0';
}

// Open the KML: header + styles (track segments, Wi-Fi security, BLE device types) + one open
// <Folder>. The Document/Folder stay open for the whole session; every track
// segment and POI is written as a complete, self-closed <Placemark> inside it, so a
// power-loss leaves a file that a repair tool can close by finding the last
// </Placemark>, trimming the tail and appending </Folder></Document></kml>.
static bool wardrive_trace_init_file(const char *path)
{
    FILE *file = fopen(path, "w");
    if (!file) {
        return false;
    }
    fprintf(file,
        "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n"
        "<kml xmlns=\"http://www.opengis.net/kml/2.2\">\n"
        "<Document>\n"
        "  <name>Wardrive Promisc Trace</name>\n"
        "  <Style id=\"traceSeg\">\n"
        "    <LineStyle><color>ff00ffff</color><width>4</width></LineStyle>\n"
        "  </Style>\n"
        // Small dot + visible SSID label. No external <Icon> href: renderers like
        // GPSVisualizer can't fetch maps.google.com icons (they show as broken
        // frames), so we let the viewer draw its own small marker in this colour.
        // KML colours are aabbggrr: open=green, WPA2=blue, WPA3=red.
        "  <Style id=\"wifiOpen\"><IconStyle><color>ff00cc00</color><scale>0.5</scale></IconStyle><LabelStyle><color>ff00cc00</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"wifiWep\"><IconStyle><color>ff00a5ff</color><scale>0.5</scale></IconStyle><LabelStyle><color>ff00a5ff</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"wifiWpa\"><IconStyle><color>ffff00ff</color><scale>0.5</scale></IconStyle><LabelStyle><color>ffff00ff</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"wifiWpa2\"><IconStyle><color>ffff0000</color><scale>0.5</scale></IconStyle><LabelStyle><color>ffff0000</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"wifiWpa3\"><IconStyle><color>ff0000ff</color><scale>0.5</scale></IconStyle><LabelStyle><color>ff0000ff</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"wifiUnknown\"><IconStyle><color>ffb0b0b0</color><scale>0.5</scale></IconStyle><LabelStyle><color>ffb0b0b0</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"blePoi\"><IconStyle><color>ffffff00</color><scale>0.5</scale></IconStyle><LabelStyle><color>ffffff00</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"airTagPoi\"><IconStyle><color>ffff00ff</color><scale>0.6</scale></IconStyle><LabelStyle><color>ffff00ff</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Style id=\"smartTagPoi\"><IconStyle><color>ff00d7ff</color><scale>0.6</scale></IconStyle><LabelStyle><color>ff00d7ff</color><scale>0.8</scale></LabelStyle></Style>\n"
        "  <Folder>\n"
        "    <name>Wardrive</name>\n");
    fclose(file);
    return true;
}

