brokali/projectZeroTouch/ESP32C5/main/main.c
// Write the buffered points as one complete <Placemark><LineString> segment.
// Segments touch: the first coordinate repeats the last vertex of the previous
// segment (c->prev_*) so the drawn line is continuous. A segment is only written
// once it has >= 2 coordinates, so we never emit a degenerate single-point line.
static bool wdp_trace_flush_segment(const char *path, wdp_trace_ctx_t *c)
{
    if (!c || c->seg_n <= 0) return false;
    int total = c->seg_n + (c->have_prev ? 1 : 0);
    if (total < 2) return false;   // keep buffering until the line has 2+ points

    FILE *file = fopen(path, "a");
    if (!file) return false;
    fprintf(file,
        "    <Placemark>\n"
        "      <name>seg %d</name>\n"
        "      <styleUrl>#traceSeg</styleUrl>\n"
        "      <LineString>\n"
        "        <tessellate>1</tessellate>\n"
        "        <coordinates>\n",
        c->seg_written + 1);
    if (c->have_prev) {
        fprintf(file, "          %.7f,%.7f,%.2f\n", c->prev_lon, c->prev_lat, c->prev_alt);
    }
    for (int i = 0; i < c->seg_n; i++) {
        fprintf(file, "          %.7f,%.7f,%.2f\n", c->seg_lon[i], c->seg_lat[i], c->seg_alt[i]);
    }
    fprintf(file,
        "        </coordinates>\n"
        "      </LineString>\n"
        "    </Placemark>\n");
    fclose(file);
    sd_sync();

    // Remember the last written vertex to stitch the next segment onto, clear buffer.
    c->prev_lat = c->seg_lat[c->seg_n - 1];
    c->prev_lon = c->seg_lon[c->seg_n - 1];
    c->prev_alt = c->seg_alt[c->seg_n - 1];
    c->have_prev = true;
    c->seg_written++;
    c->seg_n = 0;
    c->last_seg_us = esp_timer_get_time();
    return true;
}

// Consider a new GPS vertex for the track: keep the existing 3 m sampling, buffer it,
// accumulate distance, and flush a full segment (16 points) as soon as it fills. A
// large GPS jump is a discontinuity: close the current segment and start the next one
// without a connector, rather than drawing a false straight line across a GPS outage.
static void wdp_trace_add_point(const char *path, wdp_trace_ctx_t *c,
                                double lat, double lon, double alt, double *dist_accum)
{
    if (!c) return;
    if (c->have_cur) {
        double step = gps_distance_meters(c->cur_lat, c->cur_lon, lat, lon);
        if (step < WDP_TRACE_MIN_STEP_M) return;
        if (step > WDP_TRACE_MAX_STEP_M) {
            MY_LOG_INFO(TAG,
                "Wardrive trace discontinuity: GPS jump %.1fm; starting a new segment",
                step);
            wdp_trace_flush_segment(path, c);
            c->have_prev = false;
            c->seg_n = 0;
            c->last_seg_us = esp_timer_get_time();
        } else if (dist_accum) {
            *dist_accum += step;
        }
    }
    if (c->seg_n < WDP_TRACE_SEG_POINTS) {
        c->seg_lat[c->seg_n] = lat;
        c->seg_lon[c->seg_n] = lon;
        c->seg_alt[c->seg_n] = alt;
        c->seg_n++;
    }
    c->cur_lat = lat;
    c->cur_lon = lon;
    c->have_cur = true;
    if (c->seg_n >= WDP_TRACE_SEG_POINTS) {
        wdp_trace_flush_segment(path, c);
    }
}

static const char *wdp_trace_poi_style(wifi_auth_mode_t authmode)
{
    switch (authmode) {
        case WIFI_AUTH_OPEN:
            return "#wifiOpen";
        case WIFI_AUTH_WEP:
            return "#wifiWep";
        case WIFI_AUTH_WPA_PSK:
        case WIFI_AUTH_WPA_WPA2_PSK:
            return "#wifiWpa";
        case WIFI_AUTH_WPA2_PSK:
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return "#wifiWpa2";
        case WIFI_AUTH_WPA3_PSK:
        case WIFI_AUTH_WPA2_WPA3_PSK:
            return "#wifiWpa3";
        default:
            return "#wifiUnknown";
    }
}

static const char *wdp_trace_ble_style(const wdp_poi_msg_t *p)
{
    if (p->is_airtag) return "#airTagPoi";
    if (p->is_smarttag) return "#smartTagPoi";
    return "#blePoi";
}

// Write one Wi-Fi or BLE POI as a complete <Placemark><Point>. Called only from the
// task while draining the callback queue. Label and description text are XML-escaped.
static bool wdp_trace_write_poi(const char *path, wdp_trace_ctx_t *c, const wdp_poi_msg_t *p)
{
    if (!c || !p) return false;
    FILE *file = fopen(path, "a");
    if (!file) return false;

    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X",
             p->bssid[0], p->bssid[1], p->bssid[2], p->bssid[3], p->bssid[4], p->bssid[5]);

    char ts[32];
    if (p->ts) format_epoch_utc(p->ts, ts, sizeof(ts));
    else       snprintf(ts, sizeof(ts), "unknown");

    char name_raw[64];
    if (p->is_ble && !p->ssid[0]) snprintf(name_raw, sizeof(name_raw), "BLE %s", mac);
    else                           snprintf(name_raw, sizeof(name_raw), "%s", p->ssid[0] ? p->ssid : "<hidden>");
    char name_esc[384];
    xml_escape(name_raw, name_esc, sizeof(name_esc));

    char desc_raw[256];
    const char *style = p->is_ble ? wdp_trace_ble_style(p) : wdp_trace_poi_style(p->authmode);
    if (p->is_ble) {
        const char *kind = p->is_airtag ? "AirTag [LE]" : p->is_smarttag ? "SmartTag [LE]" : "BLE";
        if (p->company_id) {
            snprintf(desc_raw, sizeof(desc_raw),
                "Address: %s\nType: %s\nRSSI: %d dBm\nManufacturer ID: %u\nTime: %s\nAlt: %.1f m\nAcc: %.1f m",
                mac, kind, (int)p->rssi, (unsigned)p->company_id, ts, p->alt, p->acc);
        } else {
            snprintf(desc_raw, sizeof(desc_raw),
                "Address: %s\nType: %s\nRSSI: %d dBm\nTime: %s\nAlt: %.1f m\nAcc: %.1f m",
                mac, kind, (int)p->rssi, ts, p->alt, p->acc);
        }
    } else {
        snprintf(desc_raw, sizeof(desc_raw),
            "BSSID: %s\nRSSI: %d dBm\nChannel: %d\nAuth: %s\nTime: %s\nAlt: %.1f m\nAcc: %.1f m",
            mac, (int)p->rssi, (int)p->channel, get_auth_mode_wiggle(p->authmode),
            ts, p->alt, p->acc);
    }
    char desc_esc[384];
    xml_escape(desc_raw, desc_esc, sizeof(desc_esc));

    fprintf(file,
        "    <Placemark>\n"
        "      <name>%s</name>\n"
        "      <styleUrl>%s</styleUrl>\n"
        "      <description>%s</description>\n"
        "      <Point><coordinates>%.7f,%.7f,%.2f</coordinates></Point>\n"
        "    </Placemark>\n",
        name_esc, style, desc_esc, p->lon, p->lat, p->alt);
    fclose(file);
    c->poi_written++;
    return true;
}

// Close the open <Folder>, <Document> and <kml>. On a clean stop this makes the
// in-progress file a fully valid KML before it is renamed to its final name.
static void wardrive_trace_finalize_file(const char *path)
{
    FILE *file = fopen(path, "a");
    if (!file) {
        return;
    }
    fprintf(file,
        "  </Folder>\n"
        "</Document>\n"
        "</kml>\n");
    fclose(file);
}

/**
 * Parse MAC address string to bytes (format: XX:XX:XX:XX:XX:XX)
 * Returns true if parsing successful
 */
static bool bt_parse_mac(const char *str, uint8_t *mac)
{
    unsigned int values[6];
    if (sscanf(str, "%02X:%02X:%02X:%02X:%02X:%02X",
               &values[0], &values[1], &values[2],
               &values[3], &values[4], &values[5]) != 6) {
        // Try lowercase
        if (sscanf(str, "%02x:%02x:%02x:%02x:%02x:%02x",
                   &values[0], &values[1], &values[2],
                   &values[3], &values[4], &values[5]) != 6) {
            return false;
        }
    }
    
    // Store in reverse order (BLE format)
    for (int i = 0; i < 6; i++) {
        mac[5 - i] = (uint8_t)values[i];
    }
    
