brokali/projectZeroTouch/ESP32C5/main/main.c
    return true;
}

/**
 * Check if raw BLE payload contains Apple AirTag/Find My patterns
 * Uses Marauder's method: scan raw payload for specific byte sequences
 * Detects both original AirTags and clones (Mi-Tag, etc.)
 */
static bool bt_is_airtag_payload(const uint8_t *payload, size_t len)
{
    if (len < 4) return false;
    
    // Scan payload for Marauder patterns
    for (size_t i = 0; i + 4 <= len; i++) {
        // Pattern 1: 0x1E 0xFF 0x4C 0x00 (len=30, mfg type, Apple ID)
        if (payload[i] == 0x1E && payload[i+1] == 0xFF && 
            payload[i+2] == 0x4C && payload[i+3] == 0x00) {
            return true;
        }
        // Pattern 2: 0x4C 0x00 0x12 0x19 (Apple ID, Find My type, len=25)
        if (payload[i] == 0x4C && payload[i+1] == 0x00 && 
            payload[i+2] == 0x12 && payload[i+3] == 0x19) {
            return true;
        }
    }
    return false;
}

/**
 * Check if manufacturer data indicates Samsung SmartTag
 * SmartTag uses specific device type bytes (0x02/0x03) in SmartThings Find protocol
 * This avoids false positives from Samsung phones
 */
static bool bt_is_samsung_smarttag(const uint8_t *data, uint8_t len)
{
    if (len < 4) return false;
    
    // Check Company ID (Little Endian: 0x75 0x00)
    uint16_t company_id = data[0] | (data[1] << 8);
    if (company_id != SAMSUNG_COMPANY_ID) return false;
    
    // SmartTag uses SmartThings Find protocol
    // Device type byte (byte 2) should be 0x02 or 0x03 for SmartTag/SmartTag+
    // Samsung phones use different type values
    uint8_t device_type = data[2];
    
    // SmartTag typical payload length is 22-28 bytes
    if ((device_type == 0x02 || device_type == 0x03) && len >= 20 && len <= 30) {
        return true;
    }
    
    return false;
}

/**
 * BLE GAP event callback for scanning
 */
static int bt_gap_event_callback(struct ble_gap_event *event, void *arg)
{
    if (event->type != BLE_GAP_EVENT_DISC) {
        return 0;
    }
    
    struct ble_gap_disc_desc *desc = &event->disc;
    
    // MAC tracking mode - update RSSI and name for tracked device
    if (bt_tracking_mode) {
        if (memcmp(desc->addr.val, bt_tracking_mac, 6) == 0) {
            bt_tracking_rssi = desc->rssi;
            bt_tracking_found = true;
            
            // Try to extract name if we don't have one yet
            if (bt_tracking_name[0] == '\0') {
                struct ble_hs_adv_fields fields;
                if (ble_hs_adv_parse_fields(&fields, desc->data, desc->length_data) == 0) {
                    if (fields.name != NULL && fields.name_len > 0) {
                        int name_len = fields.name_len < 31 ? fields.name_len : 31;
                        memcpy(bt_tracking_name, fields.name, name_len);
                        bt_tracking_name[name_len] = '\0';
                    }
                }
            }
        }
        return 0;
    }
    
    // Parse advertising data
    struct ble_hs_adv_fields fields;
    int rc = ble_hs_adv_parse_fields(&fields, desc->data, desc->length_data);
    if (rc != 0) {
        return 0;
    }
    
    // Check if this is a Scan Response packet (contains names more often)
    bool is_scan_response = (desc->event_type == BLE_HCI_ADV_RPT_EVTYPE_SCAN_RSP);

    // Wardrive-only gates: startup cooldown + device blacklist (don't affect scan_bt).
    if (wardrive_promisc_active) {
        if (esp_timer_get_time() < wdp_log_gate_until_us) return 0;       // startup cooldown
        if (wardrive_blacklist_contains(desc->addr.val)) return 0;        // excluded device
    }
    // Anti-surveillance: skip blacklisted MACs so your own devices aren't flagged as followers.
    if (antisurv_active && wardrive_blacklist_contains(desc->addr.val)) return 0;

    // Check if device already seen
    bool already_seen = bt_is_device_found(desc->addr.val);
    
    // If already seen: update name from scan responses, and (during wardrive) re-log.
    if (already_seen) {
        bool want_name = is_scan_response && fields.name != NULL && fields.name_len > 0;
        int dev_idx = (want_name || wardrive_promisc_active || antisurv_active)
                      ? bt_find_device_index(desc->addr.val) : -1;

        // Try to update name from scan response if we don't have one
        if (dev_idx >= 0 && want_name && bt_devices[dev_idx].name[0] == '\0') {
            int name_len = fields.name_len < 31 ? fields.name_len : 31;
            memcpy(bt_devices[dev_idx].name, fields.name, name_len);
            bt_devices[dev_idx].name[name_len] = '\0';
        }

        // Wardrive re-log: re-emit a row when signal or position moved enough.
        // ble_rssi_delta == 0 keeps the legacy "log once" behavior.
        if (dev_idx >= 0 && wardrive_promisc_active) {
            int8_t cur = desc->rssi;
            bt_devices[dev_idx].rssi = cur;
            if (g_wd_cfg.ble_rssi_delta > 0 && !bt_devices[dev_idx].needs_log && current_gps.valid) {
                bool trig = false;
                int rd = cur - bt_devices[dev_idx].last_logged_rssi;
                if (rd < 0) rd = -rd;
                if (rd >= g_wd_cfg.ble_rssi_delta) {
                    trig = true;
                } else if (current_gps.valid && bt_devices[dev_idx].last_logged_valid) {
                    double moved = gps_distance_meters(bt_devices[dev_idx].last_logged_lat,
                                                       bt_devices[dev_idx].last_logged_lon,
                                                       current_gps.latitude, current_gps.longitude);
                    double thresh = WDP_RELOG_DISTANCE_M;
                    if (current_gps.accuracy > thresh) thresh = current_gps.accuracy;
                    if (moved >= thresh) trig = true;
                }
                if (trig) {
                    bt_devices[dev_idx].needs_log = true;
                    bt_snapshot_obs(&bt_devices[dev_idx]);   // stamp this re-observation
                    wdp_relog_pending = true;
                }
            }
        }

        // Anti-surveillance: track presence over time + travel distance from origin.
        if (dev_idx >= 0 && antisurv_active) {
            bt_devices[dev_idx].rssi = desc->rssi;
            bt_devices[dev_idx].as_last_us = esp_timer_get_time();
            if (current_gps.valid) {
                if (!bt_devices[dev_idx].as_has_origin) {
                    bt_devices[dev_idx].as_origin_lat = current_gps.latitude;
                    bt_devices[dev_idx].as_origin_lon = current_gps.longitude;
                    bt_devices[dev_idx].as_has_origin = true;
                } else {
                    double d = gps_distance_meters(bt_devices[dev_idx].as_origin_lat,
                                                   bt_devices[dev_idx].as_origin_lon,
                                                   current_gps.latitude, current_gps.longitude);
                    if (d > bt_devices[dev_idx].as_max_dist_m) bt_devices[dev_idx].as_max_dist_m = d;
                }
            }
        }
        return 0;
    }

