brokali/projectZeroTouch/ESP32C5/main/main.c
// --- Command registration in esp_console ---
#define esp_console_cmd_register(cmd) janos_console_cmd_register(cmd)
static void register_commands(void)
{
    const esp_console_cmd_t scan_cmd = {
        .command = "scan_networks",
        .help = "Starts background network scan",
        .hint = NULL,
        .func = &cmd_scan_networks,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&scan_cmd));

    const esp_console_cmd_t show_scan_cmd = {
        .command = "show_scan_results",
        .help = "Shows results from last network scan",
        .hint = NULL,
        .func = &cmd_show_scan_results,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&show_scan_cmd));

    const esp_console_cmd_t inspect_cmd = {
        .command = "inspect_network",
        .help = "Inspect AP from last scan: parse beacon for MFP (802.11w) and TSF uptime. Usage: inspect_network <index>",
        .hint = NULL,
        .func = &cmd_inspect_network,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&inspect_cmd));
    

    const esp_console_cmd_t sniffer_cmd = {
        .command = "start_sniffer",
        .help = "If no networks selected, starts network client sniffer with full scan, otherwise sniffs just selected networks without rescan",
        .hint = NULL,
        .func = &cmd_start_sniffer,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sniffer_cmd));

    const esp_console_cmd_t sniffer_noscan_cmd = {
        .command = "start_sniffer_noscan",
        .help = "Starts sniffer using existing scan results (requires prior scan_networks)",
        .hint = NULL,
        .func = &cmd_start_sniffer_noscan,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sniffer_noscan_cmd));

    const esp_console_cmd_t packet_monitor_cmd = {
        .command = "packet_monitor",
        .help = "Monitor packets per second on a channel: packet_monitor <channel>",
        .hint = NULL,
        .func = &cmd_packet_monitor,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&packet_monitor_cmd));

    ESP_ERROR_CHECK(esp_console_cmd_register(&ap_locator_cmd));

    const esp_console_cmd_t channel_view_cmd = {
        .command = "channel_view",
        .help = "Continuously scan and print Wi-Fi channel utilization",
        .hint = NULL,
        .func = &cmd_channel_view,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&channel_view_cmd));


    const esp_console_cmd_t show_sniffer_cmd = {
        .command = "show_sniffer_results",
        .help = "Shows sniffer results sorted by client count",
        .hint = NULL,
        .func = &cmd_show_sniffer_results,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&show_sniffer_cmd));
    const esp_console_cmd_t show_sniffer_vendor_cmd = {
        .command = "show_sniffer_results_vendor",
        .help = "Shows sniffer results sorted by client count with vendors",
        .hint = NULL,
        .func = &cmd_show_sniffer_results_vendor,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&show_sniffer_vendor_cmd));

    const esp_console_cmd_t clear_sniffer_cmd = {
        .command = "clear_sniffer_results",
        .help = "Clears all sniffer results (captured clients, probe requests, counters)",
        .hint = NULL,
        .func = &cmd_clear_sniffer_results,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&clear_sniffer_cmd));

    const esp_console_cmd_t show_probes_cmd = {
        .command = "show_probes",
        .help = "Shows captured probe requests with SSIDs",
        .hint = NULL,
        .func = &cmd_show_probes,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&show_probes_cmd));
    const esp_console_cmd_t show_probes_vendor_cmd = {
        .command = "show_probes_vendor",
        .help = "Shows captured probe requests with SSIDs and vendors",
        .hint = NULL,
        .func = &cmd_show_probes_vendor,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&show_probes_vendor_cmd));

    const esp_console_cmd_t list_probes_cmd = {
        .command = "list_probes",
        .help = "Lists probe requests with index and SSID",
        .hint = NULL,
        .func = &cmd_list_probes,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_probes_cmd));
    const esp_console_cmd_t list_probes_vendor_cmd = {
        .command = "list_probes_vendor",
        .help = "Lists probe requests with index, SSID, and vendor",
        .hint = NULL,
        .func = &cmd_list_probes_vendor,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_probes_vendor_cmd));

    const esp_console_cmd_t sniffer_debug_cmd = {
        .command = "sniffer_debug",
        .help = "Enable/disable detailed sniffer debug logging: sniffer_debug <0|1>",
        .hint = NULL,
        .func = &cmd_sniffer_debug,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sniffer_debug_cmd));

    const esp_console_cmd_t sniffer_dog_cmd = {
        .command = "start_sniffer_dog",
        .help = "Starts Sniffer Dog - captures AP-STA pairs and sends targeted deauth packets",
        .hint = NULL,
        .func = &cmd_start_sniffer_dog,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sniffer_dog_cmd));

    const esp_console_cmd_t deauth_detector_cmd = {
        .command = "deauth_detector",
        .help = "Detect deauth frames. No args: scan+all channels. With indices: selected channels only",
        .hint = "[index1 index2 ...]",
        .func = &cmd_deauth_detector,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&deauth_detector_cmd));

    const esp_console_cmd_t select_cmd = {
        .command = "select_networks",
        .help = "Selects networks by indexes: select_networks 0 2 5",
        .hint = NULL,
        .func = &cmd_select_networks,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&select_cmd));

    const esp_console_cmd_t unselect_cmd = {
        .command = "unselect_networks",
        .help = "Stops operations and clears network selection (keeps scan results)",
        .hint = NULL,
        .func = &cmd_unselect_networks,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&unselect_cmd));

    const esp_console_cmd_t select_stations_cmd = {
        .command = "select_stations",
        .help = "Select client MAC addresses for targeted deauth: select_stations <MAC1> [MAC2] ...",
        .hint = NULL,
        .func = &cmd_select_stations,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&select_stations_cmd));

    const esp_console_cmd_t unselect_stations_cmd = {
        .command = "unselect_stations",
        .help = "Clear station selection (revert to broadcast deauth)",
        .hint = NULL,
        .func = &cmd_unselect_stations,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&unselect_stations_cmd));

    const esp_console_cmd_t start_cmd = {
        .command = "start_evil_twin",
        .help = "Starts Evil Twin attack.",
        .hint = NULL,
        .func = &cmd_start_evil_twin,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&start_cmd));

