brokali/projectZeroTouch/ESP32C5/main/main.c
    const esp_console_cmd_t gps_raw_cmd = {
        .command = "start_gps_raw",
        .help = "Prints raw GPS NMEA sentences: start_gps_raw [baud] (default depends on gps_set)",
        .hint = "[baud]",
        .func = &cmd_start_gps_raw,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&gps_raw_cmd));

    const esp_console_cmd_t gps_set_cmd = {
        .command = "gps_set",
        .help = "Select GPS module: gps_set <m5|atgm|external|cap> (usb alias for external)",
        .hint = "<m5|atgm|external|cap>",
        .func = &cmd_gps_set,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&gps_set_cmd));

    const esp_console_cmd_t set_gps_position_cmd = {
        .command = "set_gps_position",
        .help = "Set external GPS fix: set_gps_position <lat> <lon> [alt] [acc] | no args = lost fix",
        .hint = "[lat lon [alt] [acc]]",
        .func = &cmd_set_gps_position,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_gps_position_cmd));

    const esp_console_cmd_t set_gps_position_cap_cmd = {
        .command = "set_gps_position_cap",
        .help = "Set external CAP GPS fix: set_gps_position_cap <lat> <lon> [alt] [acc] | no args = lost fix",
        .hint = "[lat lon [alt] [acc]]",
        .func = &cmd_set_gps_position_cap,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_gps_position_cap_cmd));

    const esp_console_cmd_t wardrive_cmd = {
        .command = "start_wardrive",
        .help = "Starts wardriving with GPS and SD logging",
        .hint = NULL,
        .func = &cmd_start_wardrive,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wardrive_cmd));

    const esp_console_cmd_t get_wardrive_config_cmd = {
        .command = "get_wardrive_config",
        .help = "Print active wardrive config (bands, channels, deltas, cooldown, mem cap)",
        .hint = NULL,
        .func = &cmd_get_wardrive_config,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&get_wardrive_config_cmd));

    const esp_console_cmd_t set_wardrive_bands_cmd = {
        .command = "set_wardrive_bands",
        .help = "Select wardrive radios: set_wardrive_bands wifi24,wifi5,ble",
        .hint = NULL,
        .func = &cmd_set_wardrive_bands,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_wardrive_bands_cmd));

    const esp_console_cmd_t set_wardrive_channels_cmd = {
        .command = "set_wardrive_channels",
        .help = "Select channels: set_wardrive_channels <popular|all|custom> [1:6:11:36]",
        .hint = NULL,
        .func = &cmd_set_wardrive_channels,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_wardrive_channels_cmd));

    const esp_console_cmd_t set_wardrive_rssi_delta_cmd = {
        .command = "set_wardrive_rssi_delta",
        .help = "Re-log threshold: set_wardrive_rssi_delta <wifi|ble> <0-50> (0 = log once)",
        .hint = NULL,
        .func = &cmd_set_wardrive_rssi_delta,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_wardrive_rssi_delta_cmd));

    const esp_console_cmd_t set_wardrive_memcap_cmd = {
        .command = "set_wardrive_memcap",
        .help = "Max WiFi entries in RAM before eviction: set_wardrive_memcap <1000-200000>",
        .hint = NULL,
        .func = &cmd_set_wardrive_memcap,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_wardrive_memcap_cmd));

    const esp_console_cmd_t set_wardrive_cooldown_cmd = {
        .command = "set_wardrive_cooldown",
        .help = "Drop scans for the first N seconds (hide start): set_wardrive_cooldown <0-600>",
        .hint = NULL,
        .func = &cmd_set_wardrive_cooldown,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_wardrive_cooldown_cmd));

    const esp_console_cmd_t wardrive_blacklist_cmd = {
        .command = "wardrive_blacklist",
        .help = "Exclude devices: wardrive_blacklist <add|remove|list|clear> [MAC]",
        .hint = NULL,
        .func = &cmd_wardrive_blacklist,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wardrive_blacklist_cmd));

    const esp_console_cmd_t start_antisurv_cmd = {
        .command = "start_antisurveillance",
        .help = "Detect a BLE device following you (uses GPS + BLE). Use 'stop' to end.",
        .hint = NULL,
        .func = &cmd_start_antisurveillance,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&start_antisurv_cmd));

    const esp_console_cmd_t set_antisurv_sens_cmd = {
        .command = "set_antisurv_sensitivity",
        .help = "Follower-detection sensitivity: set_antisurv_sensitivity <low|med|high>",
        .hint = NULL,
        .func = &cmd_set_antisurv_sensitivity,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_antisurv_sens_cmd));

    const esp_console_cmd_t wardrive_promisc_cmd = {
        .command = "start_wardrive_promisc",
        .help = "Promiscuous wardrive with D-UCB channel selection",
        .hint = NULL,
        .func = &cmd_start_wardrive_promisc,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wardrive_promisc_cmd));

    const esp_console_cmd_t wardrive_promisc_trace_cmd = {
        .command = "start_wardrive_promisc_trace",
        .help = "Promiscuous wardrive with D-UCB channel selection and KML trace logging",
        .hint = NULL,
        .func = &cmd_start_wardrive_promisc_trace,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wardrive_promisc_trace_cmd));

    const esp_console_cmd_t portal_cmd = {
        .command = "start_portal",
        .help = "Starts captive portal with password form: start_portal <SSID>",
        .hint = NULL,
        .func = &cmd_start_portal,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&portal_cmd));

    const esp_console_cmd_t admin_portal_cmd = {
        .command = "start_admin_portal",
        .help = "WPA2 AP JanOS-Admin with a web file manager for /sdcard/lab (tree, upload/download, rename/delete, text edit): start_admin_portal <password>",
        .hint = "<password>",
        .func = &cmd_start_admin_portal,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&admin_portal_cmd));

