brokali/projectZeroTouch/ESP32C5/main/main.c
    const esp_console_cmd_t darksword_cmd = {
        .command = "start_darksword",
        .help = "DarkSword RCE captive portal: start_darksword <SSID>. Serves /sdcard/lab/htmls/darksword.html, exfil on :8080, loot in /sdcard/loot/portal/",
        .hint = "<SSID>",
        .func = &cmd_start_darksword,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&darksword_cmd));

    const esp_console_cmd_t rogueap_cmd = {
        .command = "start_rogueap",
        .help = "Start WPA2 rogue AP with captive portal: start_rogueap <SSID> <password>. Requires select_html first. Runs deauth if networks selected.",
        .hint = "<SSID> <password>",
        .func = &cmd_start_rogueap,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&rogueap_cmd));

    const esp_console_cmd_t rogue_gitm_cmd = {
        .command = "start_rogue_gitm",
        .help = "Mirror SoftAP + Capture Gateway (GITM), optional same-channel deauth: start_rogue_gitm <SSID> <password> [--pcap-name <name>]. Requires wifi_connect. No captive portal.",
        .hint = "<SSID> <password> [--pcap-name <name>]",
        .func = &cmd_start_rogue_gitm,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&rogue_gitm_cmd));

    const esp_console_cmd_t karma_cmd = {
        .command = "start_karma",
        .help = "Starts Karma attack with SSID from probe list: start_karma <index>",
        .hint = NULL,
        .func = &cmd_start_karma,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&karma_cmd));

    const esp_console_cmd_t vendor_cmd = {
        .command = "vendor",
        .help = "Controls vendor lookup: vendor set <on|off> | vendor read",
        .hint = NULL,
        .func = &cmd_vendor,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&vendor_cmd));

    const esp_console_cmd_t display_cmd = {
        .command = "display",
        .help = "Display mode: display set <auto|ssd1306|sh1107|sh1106|unit_lcd> | display read",
        .hint = NULL,
        .func = &cmd_display,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&display_cmd));

    const esp_console_cmd_t boot_button_cmd = {
        .command = "boot_button",
        .help = "Configure boot button actions: boot_button read|list|set <short|long> <command[, command...]>|status <short|long> <on|off>",
        .hint = NULL,
        .func = &cmd_boot_button,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&boot_button_cmd));

    const esp_console_cmd_t led_cmd = {
        .command = "led",
        .help = "Controls status LED: led set <on|off> | led level <1-100> | led read",
        .hint = NULL,
        .func = &cmd_led,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&led_cmd));

    const esp_console_cmd_t channel_time_cmd = {
        .command = "channel_time",
        .help = "Controls scan channel time: channel_time set <min|max> <ms> | channel_time read <min|max>",
        .hint = NULL,
        .func = &cmd_channel_time,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&channel_time_cmd));

    const esp_console_cmd_t download_cmd = {
        .command = "download",
        .help = "Force reboot into ROM download (UART flashing) mode",
        .hint = NULL,
        .func = &cmd_download,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&download_cmd));

    const esp_console_cmd_t pcap_cmd = {
        .command = "start_pcap",
        .help = "Capture WiFi traffic to PCAP: start_pcap radio|net|gateway",
        .hint = "radio|net|gateway",
        .func = &cmd_start_pcap,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&pcap_cmd));

    const esp_console_cmd_t zig_recon_cmd = {
        .command = "start_zig_recon",
        .help = "Passive IEEE 802.15.4 recon: start_zig_recon [all|11,15,20] [dwell_ms]",
        .hint = "[all|11,15,20] [dwell_ms]",
        .func = &cmd_start_zig_recon,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&zig_recon_cmd));

    const esp_console_cmd_t zig_recon_status_cmd = {
        .command = "zig_recon_status",
        .help = "Print IEEE 802.15.4 recon status and [ZIG] machine output",
        .hint = NULL,
        .func = &cmd_zig_recon_status,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&zig_recon_status_cmd));

    const esp_console_cmd_t zig_recon_list_cmd = {
        .command = "zig_recon_list",
        .help = "List discovered IEEE 802.15.4 PANs: zig_recon_list [all]",
        .hint = "[all]",
        .func = &cmd_zig_recon_list,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&zig_recon_list_cmd));

    const esp_console_cmd_t zig_recon_nodes_cmd = {
        .command = "zig_recon_nodes",
        .help = "List nodes for a discovered PAN or all PANs: zig_recon_nodes <pan_id|all>",
        .hint = "<pan_id|all>",
        .func = &cmd_zig_recon_nodes,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&zig_recon_nodes_cmd));

    const esp_console_cmd_t zig_recon_clear_cmd = {
        .command = "zig_recon_clear",
        .help = "Clear IEEE 802.15.4 recon counters and discovered PANs",
        .hint = NULL,
        .func = &cmd_zig_recon_clear,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&zig_recon_clear_cmd));

    const esp_console_cmd_t stop_cmd = {
        .command = "stop",
        .help = "Stop all running operations",
        .hint = NULL,
        .func = &cmd_stop,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&stop_cmd));

    const esp_console_cmd_t init_nrf24_cmd = {
        .command = "init_nrf24",
        .help = "Initialize and detect the nRF24 module on SPI2 (CS=3, CE=4)",
        .hint = NULL,
        .func = &cmd_init_nrf24,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&init_nrf24_cmd));

    const esp_console_cmd_t start_jammer24_cmd = {
        .command = "start_jammer24",
        .help = "Start nRF24 2.4GHz jammer: start_jammer24 [ble|bt|wifi|drone|all]",
        .hint = "[ble|bt|wifi|drone|all]",
        .func = &cmd_start_jammer24,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&start_jammer24_cmd));

    const esp_console_cmd_t wifi_connect_cmd = {
        .command = "wifi_connect",
        .help = "Connect to AP as STA: wifi_connect <SSID> [Password|--saved] [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]",
        .hint = "<SSID> [Password|--saved] [ota] [<IP> <Netmask> <GW> [DNS1] [DNS2]]",
        .func = &cmd_wifi_connect,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_connect_cmd));

    const esp_console_cmd_t capture_gateway_cmd = {
        .command = "capture_gateway",
        .help = "Authorized APSTA/NAPT capture gateway with fixed adaptive 4096 kbps ceiling: capture_gateway start <capture_ssid> [capture_password] [--pcap-name <name>] | status | stop",
        .hint = "start <capture_ssid> [capture_password] [--pcap-name <name>] | status | stop",
        .func = &cmd_capture_gateway,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&capture_gateway_cmd));

