brokali/projectZeroTouch/ESP32C5/main/main.c
    const esp_console_cmd_t wifi_disconnect_cmd = {
        .command = "wifi_disconnect",
        .help = "Disconnect from current AP (STA)",
        .hint = NULL,
        .func = &cmd_wifi_disconnect,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&wifi_disconnect_cmd));

    const esp_console_cmd_t ota_check_cmd = {
        .command = "ota_check",
        .help = "Check GitHub release and apply OTA update (requires WiFi)",
        .hint = NULL,
        .func = &cmd_ota_check,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ota_check_cmd));

    const esp_console_cmd_t ota_list_cmd = {
        .command = "ota_list",
        .help = "List recent GitHub releases (first 10)",
        .hint = NULL,
        .func = &cmd_ota_list,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ota_list_cmd));

    const esp_console_cmd_t ota_channel_cmd = {
        .command = "ota_channel",
        .help = "Get/set OTA channel: ota_channel [main|dev]",
        .hint = NULL,
        .func = &cmd_ota_channel,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ota_channel_cmd));

    const esp_console_cmd_t ota_info_cmd = {
        .command = "ota_info",
        .help = "Show OTA partition info",
        .hint = NULL,
        .func = &cmd_ota_info,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ota_info_cmd));

    const esp_console_cmd_t ota_boot_cmd = {
        .command = "ota_boot",
        .help = "Set boot partition: ota_boot <ota_0|ota_1>",
        .hint = NULL,
        .func = &cmd_ota_boot,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ota_boot_cmd));

    const esp_console_cmd_t list_hosts_cmd = {
        .command = "list_hosts",
        .help = "Scan local network via ARP and list discovered hosts",
        .hint = NULL,
        .func = &cmd_list_hosts,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_hosts_cmd));

    const esp_console_cmd_t list_hosts_vendor_cmd = {
        .command = "list_hosts_vendor",
        .help = "Scan local network via ARP and list discovered hosts with vendor names",
        .hint = NULL,
        .func = &cmd_list_hosts_vendor,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_hosts_vendor_cmd));

    const esp_console_cmd_t nmap_cmd = {
        .command = "start_nmap",
        .help = "Port scan: start_nmap [quick|medium|heavy] [IP]",
        .hint = NULL,
        .func = &cmd_start_nmap,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&nmap_cmd));

    const esp_console_cmd_t arp_ban_cmd = {
        .command = "arp_ban",
        .help = "ARP poison a device to disconnect it: arp_ban <MAC> [IP]",
        .hint = "<MAC> [IP]",
        .func = &cmd_arp_ban,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&arp_ban_cmd));

    const esp_console_cmd_t reboot_cmd = {
        .command = "reboot",
        .help = "Device reboot to start from scratch",
        .hint = NULL,
        .func = &cmd_reboot,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&reboot_cmd));

    const esp_console_cmd_t ping_cmd = {
        .command = "ping",
        .help = "Connectivity test: prints pong",
        .hint = NULL,
        .func = &cmd_ping,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&ping_cmd));

    const esp_console_cmd_t list_sd_cmd = {
        .command = "list_sd",
        .help = "Lists HTML files on SD card",
        .hint = NULL,
        .func = &cmd_list_sd,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_sd_cmd));

    const esp_console_cmd_t sd_status_cmd = {
        .command = "sd_status",
        .help = "Fast SD card presence check (no init/mount)",
        .hint = NULL,
        .func = &cmd_sd_status,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sd_status_cmd));

    const esp_console_cmd_t sd_benchmark_cmd = {
        .command = "sd_benchmark",
        .help = "Sequential SD write benchmark: sd_benchmark [size_mb] (1-256, default 32)",
        .hint = NULL,
        .func = &cmd_sd_benchmark,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&sd_benchmark_cmd));

    const esp_console_cmd_t show_pass_cmd = {
        .command = "show_pass",
        .help = "Prints password log: show_pass [portal|evil]",
        .hint = NULL,
        .func = &cmd_show_pass,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&show_pass_cmd));

    const esp_console_cmd_t list_dir_cmd = {
        .command = "list_dir",
        .help = "List files inside a directory on SD card: list_dir [path] [-s]",
        .hint = NULL,
        .func = &cmd_list_dir,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_dir_cmd));

    const esp_console_cmd_t send_file_cmd = {
        .command = "send_file",
        .help = "Transfer an SD file over UART: send_file <path> [offset] [bsize]",
        .hint = "<path> [offset] [bsize]",
        .func = &cmd_send_file,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&send_file_cmd));

    const esp_console_cmd_t uart_baud_cmd = {
        .command = "uart_baud",
        .help = "Change console UART rate with a 10 second confirmation window",
        .hint = "<115200|230400|460800|921600|2000000>",
        .func = &cmd_uart_baud,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&uart_baud_cmd));

    const esp_console_cmd_t uart_baud_confirm_cmd = {
        .command = "uart_baud_confirm",
        .help = "Confirm the current console UART rate",
        .hint = NULL,
        .func = &cmd_uart_baud_confirm,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&uart_baud_confirm_cmd));

    const esp_console_cmd_t uart_baud_status_cmd = {
        .command = "uart_baud_status",
        .help = "Show console UART rate and confirmation state",
        .hint = NULL,
        .func = &cmd_uart_baud_status,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&uart_baud_status_cmd));

    const esp_console_cmd_t list_ssid_cmd = {
        .command = "list_ssid",
        .help = "Lists SSIDs from /sdcard/lab/ssid.txt",
        .hint = NULL,
        .func = &cmd_list_ssid,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_ssid_cmd));

    const esp_console_cmd_t list_ssids_cmd = {
        .command = "list_ssids",
        .help = "Lists SSIDs from /sdcard/lab/ssids.txt",
        .hint = NULL,
        .func = &cmd_list_ssids,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&list_ssids_cmd));

