brokali/projectZeroTouch/ESP32C5/main/main.c
    const esp_console_cmd_t add_ssid_cmd = {
        .command = "add_ssid",
        .help = "Add SSID to /sdcard/lab/ssids.txt",
        .hint = NULL,
        .func = &cmd_add_ssid,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&add_ssid_cmd));

    const esp_console_cmd_t remove_ssid_cmd = {
        .command = "remove_ssid",
        .help = "Remove SSID by index from /sdcard/lab/ssids.txt",
        .hint = NULL,
        .func = &cmd_remove_ssid,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&remove_ssid_cmd));

    const esp_console_cmd_t home_list_cmd = {
        .command = "home_list",
        .help = "List home networks from /sdcard/lab/home.txt",
        .hint = NULL,
        .func = &cmd_home_list,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&home_list_cmd));

    const esp_console_cmd_t home_add_cmd = {
        .command = "home_add",
        .help = "Add/update home network: home_add \"<SSID>\" \"<password>\"",
        .hint = NULL,
        .func = &cmd_home_add,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&home_add_cmd));

    const esp_console_cmd_t home_remove_cmd = {
        .command = "home_remove",
        .help = "Remove home network: home_remove \"<SSID>\"",
        .hint = NULL,
        .func = &cmd_home_remove,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&home_remove_cmd));

    const esp_console_cmd_t file_delete_cmd = {
        .command = "file_delete",
        .help = "Delete files on SD card: file_delete <path> [path2 ...]",
        .hint = NULL,
        .func = &cmd_file_delete,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&file_delete_cmd));

    const esp_console_cmd_t select_html_cmd = {
        .command = "select_html",
        .help = "Load custom HTML from SD card: select_html <index>",
        .hint = NULL,
        .func = &cmd_select_html,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&select_html_cmd));

    const esp_console_cmd_t set_html_cmd = {
        .command = "set_html",
        .help = "Set custom portal HTML from string: set_html <html>",
        .hint = NULL,
        .func = &cmd_set_html,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&set_html_cmd));

    // BLE Scanner commands
    const esp_console_cmd_t scan_bt_cmd = {
        .command = "scan_bt",
        .help = "One-time BLE device scan (10 seconds)",
        .hint = NULL,
        .func = &cmd_scan_bt,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&scan_bt_cmd));

    const esp_console_cmd_t scan_airtag_cmd = {
        .command = "scan_airtag",
        .help = "Continuous AirTag/SmartTag scan (outputs count every 30s)",
        .hint = NULL,
        .func = &cmd_scan_airtag,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&scan_airtag_cmd));

    const esp_console_cmd_t version_cmd = {
        .command = "version",
        .help = "Prints JanOS firmware version",
        .hint = NULL,
        .func = &cmd_version,
        .argtable = NULL
    };
    ESP_ERROR_CHECK(esp_console_cmd_register(&version_cmd));
}
#undef esp_console_cmd_register

void app_main(void) {


    // printf("Heap regions:\n");
    // printf("  DRAM total: %u KB\n", (unsigned)(heap_caps_get_total_size(MALLOC_CAP_8BIT) / 1024));
    // printf("  IRAM total: %u KB\n", (unsigned)(heap_caps_get_total_size(MALLOC_CAP_EXEC) / 1024));
    // heap_caps_print_heap_info(MALLOC_CAP_DEFAULT);

    printf("\n\n=== APP_MAIN START (v" JANOS_VERSION ") ===\n");
    
    // Suppress WiFi internal WARNING logs (phy rate, etc.) - show only errors
    esp_log_level_set("wifi", ESP_LOG_ERROR);
    
    // Suppress SD card initialization errors (we handle them gracefully with our own message)
    esp_log_level_set("sdmmc_sd", ESP_LOG_NONE);
    esp_log_level_set("vfs_fat_sdmmc", ESP_LOG_NONE);
    esp_log_level_set("spi_common", ESP_LOG_NONE);

 #ifdef CONFIG_SPIRAM
//     printf("Step 1: Manual PSRAM init\n");
    
    // Manual PSRAM initialization (CONFIG_SPIRAM_BOOT_INIT=n)
    esp_err_t ret1 = esp_psram_init();
    if (ret1 == ESP_OK) {
        size_t psram_size = esp_psram_get_size();
        (void)psram_size;
        //printf("PSRAM initialized successfully, size: %zu bytes\n", psram_size);
        
        //printf("Step 2: Test PSRAM malloc\n");
        void* ptr = heap_caps_malloc(1024, MALLOC_CAP_SPIRAM);
        if (ptr != NULL) {
            //printf("Malloc from PSRAM succeeded\n");
            heap_caps_free(ptr);
        } else {
            printf("Malloc from PSRAM failed\n");
        }
        
        //printf("Step 2b: Allocate buffers in PSRAM\n");
        if (!init_psram_buffers()) {
            printf("FATAL: PSRAM buffer allocation failed!\n");
            return;
        }
        //printf("PSRAM buffers allocated (~110 KB)\n");
    } else {
        printf("PSRAM init failed: %s (continuing without PSRAM)\n", esp_err_to_name(ret1));
    }
#else
    printf("PSRAM support disabled in config\n");
#endif

    // NVS must be ready before loading persisted display mode.
    ESP_ERROR_CHECK(nvs_flash_init());
    display_mode_load_from_nvs();
    oled_display_set_forced_type(display_forced_mode);

    // Initialize display module (auto-detect SSD1306 / SH1107 / SH1106 / Unit LCD)
    oled_display_init();
    {
        const char *display_name = "NONE";
        char display_desc[64];
        int disp_addr7 = oled_display_get_i2c_addr_7bit();
        int disp_addr_raw = oled_display_get_i2c_addr_raw();
        snprintf(display_desc, sizeof(display_desc), "not detected");
        switch (oled_display_get_type()) {
            case DISPLAY_SSD1306:
                display_name = "SSD1306";
                snprintf(display_desc, sizeof(display_desc), "addr raw 0x%02X / 7-bit 0x%02X",
                         disp_addr_raw, disp_addr7);
                break;
            case DISPLAY_SH1107:
                display_name = "SH1107";
                snprintf(display_desc, sizeof(display_desc), "addr raw 0x%02X / 7-bit 0x%02X",
                         disp_addr_raw, disp_addr7);
                break;
            case DISPLAY_SH1106:
                display_name = "SH1106";
                snprintf(display_desc, sizeof(display_desc), "addr raw 0x%02X / 7-bit 0x%02X",
                         disp_addr_raw, disp_addr7);
                break;
            case DISPLAY_UNIT_LCD:
                display_name = "UNIT_LCD";
                snprintf(display_desc, sizeof(display_desc), "addr 0x%02X", disp_addr7);
                break;
            case DISPLAY_NONE:
            default:
                display_name = "NONE";
                snprintf(display_desc, sizeof(display_desc), "check display wiring / I2C");
                break;
        }
        MY_LOG_INFO(TAG, "Display: %s", display_name);
    }
    oled_display_update_full("> JanOS v" JANOS_VERSION, "  Booting...", "", "");
    vTaskDelay(pdMS_TO_TICKS(80));

//     printf("Step 3: Init NVS\n");
    ota_load_channel_from_nvs();
    wpasec_load_key_from_nvs();
    wigle_load_key_from_nvs();
    wdgwars_load_key_from_nvs();
    ota_mark_valid_if_pending();
    ota_log_boot_info();
    //printf("NVS initialized OK\n");

