brokali/projectZeroTouch/ESP32C5/main/main.c
    channel_time_load_state_from_nvs();
    wardrive_config_load_from_nvs();
    wardrive_blacklist_load();
    gps_load_state_from_nvs();
    led_load_state_from_nvs();
    oled_display_update_full(NULL, "  NVS: OK", "  Init LED...", "");
    vTaskDelay(pdMS_TO_TICKS(60));
    MY_LOG_INFO(TAG, "GPS: %s", gps_get_module_name(current_gps_module));

    //printf("Step 4: Init LED strip\n");
    // 1. LED strip configuration
    led_strip_config_t strip_cfg = {
        .strip_gpio_num            = NEOPIXEL_GPIO,
        .max_leds                  = LED_COUNT,
        .led_model                 = LED_MODEL_WS2812,
        .color_component_format = LED_STRIP_COLOR_COMPONENT_FMT_GRB,
        .flags.invert_out          = false,
    };

    // 2. LED Strip RMT configuration
    led_strip_rmt_config_t rmt_cfg = {
        .clk_src        = RMT_CLK_SRC_DEFAULT,
        .resolution_hz  = RMT_RES_HZ,
        .flags.with_dma = false,
    };

    // 3. strip instance (non-fatal on failure)
    esp_err_t led_init_err = led_strip_new_rmt_device(&strip_cfg, &rmt_cfg, &strip);
    if (led_init_err != ESP_OK) {
        ESP_LOGE(TAG, "LED strip init failed on GPIO %d (model %s): %s",
                 strip_cfg.strip_gpio_num,
                 "WS2812",
                 esp_err_to_name(led_init_err));
        strip = NULL;
        led_initialized = false;
    } else {
        led_initialized = true;
        led_boot_sequence();
    }
    //printf("Step 6: Vendor load state\n");
    oled_display_update_full(NULL, "  NVS: OK", "  LED: OK", "  Init SD...");
    vTaskDelay(pdMS_TO_TICKS(60));
    vendor_load_state_from_nvs();
    vendor_last_valid = false;
    vendor_last_hit = false;
    vendor_lookup_buffer[0] = '\0';
    vendor_file_checked = false;
    vendor_file_present = false;
    vendor_record_count = 0;
    //printf("Step 7: Boot config load\n");
    boot_config_load_from_nvs();

    // Note: WiFi and BLE are initialized lazily on first command that needs them
    // This saves memory and allows SD card to work properly
    //printf("Radio init: deferred (lazy initialization)\n");
    
    // Show memory status at boot
    log_memory_info("BOOT");

    MY_LOG_INFO(TAG,"JanOS version: " JANOS_VERSION);


    esp_console_repl_t *repl = NULL;
    esp_console_repl_config_t repl_config = ESP_CONSOLE_REPL_CONFIG_DEFAULT();
    // Keep REPL stable for heavier TLS-based commands triggered directly from CLI.
    repl_config.task_stack_size = 8192;
    MY_LOG_INFO(TAG,"Type 'help' to list all commands.");

    repl_config.prompt = ">";
    repl_config.max_cmdline_length = 256;

    ESP_ERROR_CHECK(uart_baud_control_init());
    esp_console_register_help_command();
    register_commands();

    esp_console_dev_uart_config_t hw_config = ESP_CONSOLE_DEV_UART_CONFIG_DEFAULT();
    hw_config.baud_rate = JANOS_UART_DEFAULT_BAUD;
    ESP_ERROR_CHECK(esp_console_new_repl_uart(&hw_config, &repl_config, &repl));

    linenoiseSetHintsCallback((linenoiseHintsCallback *)&janos_console_hint);

    init_projectzero_touch_terminal();
    
    ESP_ERROR_CHECK(esp_console_start_repl(repl));
    vTaskDelay(pdMS_TO_TICKS(500));

    gpio_config_t boot_button_config = {
        .pin_bit_mask = 1ULL << BOOT_BUTTON_GPIO,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = GPIO_PULLUP_ENABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&boot_button_config));

    if (boot_button_task_handle == NULL) {
        BaseType_t boot_task_created = xTaskCreate(
            boot_button_task,
            "boot_button",
            BOOT_BUTTON_TASK_STACK_SIZE,
            NULL,
            BOOT_BUTTON_TASK_PRIORITY,
            &boot_button_task_handle
        );
        if (boot_task_created != pdPASS) {
            MY_LOG_INFO(TAG, "Failed to create boot button task");
            boot_button_task_handle = NULL;
        }
    }
    
    // Initialize SD card and create necessary directories
    esp_err_t sd_init_ret = init_sd_card();
    if (sd_init_ret == ESP_OK) {
        create_sd_directories();
        upload_state_ensure_file();
        report_ssid_file_status();
        ensure_ssids_file();
        if (vendor_is_enabled()) {
            ensure_vendor_file_checked();
        }
        // Check for wpa-sec API key file on SD card
        {
            FILE *wf = fopen("/sdcard/lab/wpa-sec.txt", "r");
            if (wf) {
                static char line[256];
                memset(line, 0, sizeof(line));
                if (fgets(line, sizeof(line), wf)) {
                    // Strip trailing newline/carriage return
                    size_t ln = strlen(line);
                    while (ln > 0 && (line[ln - 1] == '\n' || line[ln - 1] == '\r')) {
                        line[--ln] = '\0';
                    }
                    if (ln > 0) {
                        if (wpasec_save_key_to_nvs(line)) {
                            MY_LOG_INFO(TAG, "wpa-sec key updated from SD card into NVS.");
                        } else {
                            MY_LOG_INFO(TAG, "Failed to save wpa-sec key from SD card to NVS.");
                        }
                    }
                }
                fclose(wf);
            }
        }
        // Restore WiGLE credentials from SD only when NVS did not provide a
        // complete pair. Existing NVS credentials remain authoritative.
        if ((wigle_api_name[0] == '\0' || wigle_api_token[0] == '\0') &&
            wigle_load_key_from_sd()) {
            if (wigle_save_key_to_nvs(wigle_api_name, wigle_api_token)) {
                MY_LOG_INFO(TAG, "WiGLE credentials restored from SD card into NVS.");
            } else {
                MY_LOG_INFO(TAG, "Failed to save WiGLE credentials from SD card to NVS.");
            }
        }
        // Restore the WDGWars key from SD only when no NVS key was loaded.
        // This keeps an explicitly configured NVS key authoritative, while
        // allowing /sdcard/lab/wdgwars.txt to recover a cleared/missing key.
        if (wdgwars_api_key[0] == '\0' && wdgwars_load_key_from_sd()) {
            if (wdgwars_save_key_to_nvs(wdgwars_api_key)) {
                MY_LOG_INFO(TAG, "WDGWars key restored from SD card into NVS.");
            } else {
                MY_LOG_INFO(TAG, "Failed to save WDGWars key from SD card to NVS.");
            }
        }
        oled_display_update_full(NULL, "  SD: mounted", "  All systems OK", "");
    } else {
        oled_display_update_full(NULL, "  SD: MISSING!", "  No file save", "");
    }
    vTaskDelay(pdMS_TO_TICKS(400));
    
