brokali/projectZeroTouch/ESP32C5/main/main.c
        MY_LOG_INFO(TAG, "  [%d] SSID='%s' Ch=%d", i + 1, (char*)scan_ap->ssid, scan_ap->primary);
    }
    
    MY_LOG_INFO(TAG, "Sniffer: %d networks on %d channel(s), total %d APs in database", 
               g_selected_count, sniffer_selected_channels_count, sniffer_ap_count);
    
    // Log channels
    if (sniffer_selected_channels_count > 0) {
        char channel_list[128] = {0};
        int offset = 0;
        for (int i = 0; i < sniffer_selected_channels_count && offset < 120; i++) {
            offset += snprintf(channel_list + offset, sizeof(channel_list) - offset, 
                             "%d%s", sniffer_selected_channels[i], 
                             (i < sniffer_selected_channels_count - 1) ? ", " : "");
        }
        MY_LOG_INFO(TAG, "Channel hopping list: [%s]", channel_list);
    }
}

static void sniffer_channel_hop(void) {
    if (!sniffer_active || sniffer_scan_phase) {
        return;
    }
    
    // Check if we're in selected networks mode
    if (sniffer_selected_mode && sniffer_selected_channels_count > 0) {
        // Use selected channels only
        sniffer_current_channel = sniffer_selected_channels[sniffer_channel_index];
        
        sniffer_channel_index++;
        if (sniffer_channel_index >= sniffer_selected_channels_count) {
            sniffer_channel_index = 0;
        }
    } else {
        // Use dual-band channel hopping (like Marauder)
        sniffer_current_channel = dual_band_channels[sniffer_channel_index];
        
        sniffer_channel_index++;
        if (sniffer_channel_index >= dual_band_channels_count) {
            sniffer_channel_index = 0;
        }
    }
    
    esp_wifi_set_channel(sniffer_current_channel, WIFI_SECOND_CHAN_NONE);
    sniffer_last_channel_hop = esp_timer_get_time() / 1000;
    
    // Optional: Log channel changes with band info (debug mode)
    #if 0
    const char* band = (sniffer_current_channel <= 14) ? "2.4GHz" : "5GHz";
    MY_LOG_INFO(TAG, "Sniffer: Hopped to channel %d (%s)", sniffer_current_channel, band);
    #endif
}

// Task that handles time-based channel hopping (independent of packet flow)
static void sniffer_channel_task(void *pvParameters) {
    int64_t sniff_oled_last_us = 0;
    
    while (sniffer_active) {
        vTaskDelay(pdMS_TO_TICKS(50)); // Check every 50ms
        
        if (!sniffer_active || sniffer_scan_phase) {
            continue;
        }
        
        // Force channel hop if 250ms passed
        int64_t current_time = esp_timer_get_time() / 1000;
        bool time_expired = (current_time - sniffer_last_channel_hop >= sniffer_channel_hop_delay_ms);
        
        if (time_expired) {
            sniffer_channel_hop();
        }
        
        // OLED update (~500ms)
        int64_t now_us = esp_timer_get_time();
        if (now_us - sniff_oled_last_us > 500000) {
            sniff_oled_last_us = now_us;
            char l2[64], l3[64], l4[64];
            snprintf(l2, sizeof(l2), "  Ch %d hopping", sniffer_current_channel);
            snprintf(l3, sizeof(l3), "  AP:%d Probes:%d", sniffer_ap_count, probe_request_count);
            snprintf(l4, sizeof(l4), "  Pkts: %lu", (unsigned long)sniff_oled_packets);
            oled_display_update_full("> Sniffer", l2, l3, l4);
        }
    }
    
    MY_LOG_INFO(TAG, "Sniffer channel task ending");
    vTaskDelete(NULL);
}

// ============================================================================
// PCAP capture functions
// ============================================================================

static void pcap_stats_snapshot(pcap_stats_snapshot_t *snapshot)
{
    if (snapshot == NULL) {
        return;
    }
    memset(snapshot, 0, sizeof(*snapshot));
    portENTER_CRITICAL(&pcap_stats_lock);
    snapshot->packets = pcap_capture_frame_count;
    snapshot->drops = pcap_capture_drop_count;
    snapshot->drop_alloc = pcap_capture_drop_alloc_count;
    snapshot->drop_queue = pcap_capture_drop_queue_count;
    snapshot->drop_write = pcap_capture_drop_write_count;
    snapshot->queue_high_water = pcap_capture_queue_high_water;
    snapshot->rate_queue_drops = pcap_rate_queue_drop_count;
    snapshot->rate_queue_high_water = pcap_rate_queue_high_water;
    snapshot->rate_effective_kbps = pcap_rate_effective_kbps;
    snapshot->rate_throttle_events = pcap_rate_throttle_event_count;
    snapshot->rate_pause_events = pcap_rate_pause_event_count;
    snapshot->gateway_filtered = pcap_gateway_filtered_frame_count;
    snapshot->file_bytes = pcap_capture_file_byte_count;
    portEXIT_CRITICAL(&pcap_stats_lock);
    snapshot->queue_depth = pcap_packet_queue != NULL
                                ? (uint32_t)uxQueueMessagesWaiting(pcap_packet_queue)
                                : 0;
}

/** Gateway PCAP: keep only IPv4 frames that involve SoftAP subnet 10.42.0.0/24. */
static bool pcap_gateway_should_record(const uint8_t *data, uint16_t len)
{
    if (pcap_capture_mode != PCAP_MODE_GATEWAY) {
        return true;
    }
    if (data == NULL || len < 14) {
        return false;
    }

    size_t ip_off = 14;
    uint16_t ethertype = ((uint16_t)data[12] << 8) | data[13];
    if (ethertype == 0x8100) {
        if (len < 18) {
            return false;
        }
        ethertype = ((uint16_t)data[16] << 8) | data[17];
        ip_off = 18;
    }
    if (ethertype != 0x0800) {
        return false;
    }
    if (len < ip_off + 20) {
        return false;
    }

    uint32_t src_n;
    uint32_t dst_n;
    memcpy(&src_n, data + ip_off + 12, 4);
    memcpy(&dst_n, data + ip_off + 16, 4);
    uint32_t src_h = ntohl(src_n);
    uint32_t dst_h = ntohl(dst_n);
    const uint32_t softap_net = 0x0A2A0000U; /* 10.42.0.0 */
    const uint32_t softap_mask = 0xFFFFFF00U;
    bool src_softap = (src_h & softap_mask) == softap_net;
    bool dst_softap = (dst_h & softap_mask) == softap_net;
    return src_softap || dst_softap;
}

static void pcap_enqueue_frame_at(const uint8_t *data, uint16_t len,
                                  int64_t timestamp_us) {
    if (!pcap_capture_active || !pcap_packet_queue || len == 0 || data == NULL) {
        return;
    }

    if (!pcap_gateway_should_record(data, len)) {
        portENTER_CRITICAL(&pcap_stats_lock);
        pcap_gateway_filtered_frame_count++;
        portEXIT_CRITICAL(&pcap_stats_lock);
        return;
    }

