brokali/projectZeroTouch/ESP32C5/main/main.c
    pcap_queued_frame_t *frame = heap_caps_malloc(sizeof(pcap_queued_frame_t) + len,
                                                  MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (!frame) {
        frame = heap_caps_malloc(sizeof(pcap_queued_frame_t) + len,
                                 MALLOC_CAP_8BIT);
    }
    if (!frame) {
        portENTER_CRITICAL(&pcap_stats_lock);
        pcap_capture_drop_count++;
        pcap_capture_drop_alloc_count++;
        portEXIT_CRITICAL(&pcap_stats_lock);
        return;
    }

    frame->len = len;
    frame->timestamp_us = timestamp_us;
    memcpy(frame->data, data, len);

    if (xQueueSend(pcap_packet_queue, &frame, 0) != pdTRUE) {
        heap_caps_free(frame);
        portENTER_CRITICAL(&pcap_stats_lock);
        pcap_capture_drop_count++;
        pcap_capture_drop_queue_count++;
        portEXIT_CRITICAL(&pcap_stats_lock);
    } else {
        uint32_t depth = (uint32_t)uxQueueMessagesWaiting(pcap_packet_queue);
        portENTER_CRITICAL(&pcap_stats_lock);
        if (depth > pcap_capture_queue_high_water) {
            pcap_capture_queue_high_water = depth;
        }
        portEXIT_CRITICAL(&pcap_stats_lock);
    }
}

static void pcap_enqueue_frame(const uint8_t *data, uint16_t len) {
    pcap_enqueue_frame_at(data, len, esp_timer_get_time());
}

static void pcap_radio_promiscuous_cb(void *buf, wifi_promiscuous_pkt_type_t type) {
    if (!pcap_capture_active) return;
    const wifi_promiscuous_pkt_t *pkt = (const wifi_promiscuous_pkt_t *)buf;
    uint16_t len = pkt->rx_ctrl.sig_len;
    if (len == 0) return;
    pcap_enqueue_frame(pkt->payload, len);
}

static void pcap_capture_pbuf(struct pbuf *p)
{
    if (pcap_capture_active && p && p->tot_len > 0 && p->tot_len <= 1600) {
        uint8_t tmp[1600];
        uint16_t copied = pbuf_copy_partial(p, tmp, p->tot_len, 0);
        if (copied > 0) {
            pcap_enqueue_frame(tmp, copied);
        }
    }
}

static void pcap_rate_note_queued(void)
{
    uint32_t depth = pcap_rate_packet_queue != NULL
                         ? (uint32_t)uxQueueMessagesWaiting(pcap_rate_packet_queue)
                         : 0;
    portENTER_CRITICAL(&pcap_stats_lock);
    if (depth > pcap_rate_queue_high_water) {
        pcap_rate_queue_high_water = depth;
    }
    portEXIT_CRITICAL(&pcap_stats_lock);
}

static void pcap_rate_note_drop(void)
{
    portENTER_CRITICAL(&pcap_stats_lock);
    pcap_rate_queue_drop_count++;
    portEXIT_CRITICAL(&pcap_stats_lock);
}

static bool pcap_rate_enqueue(struct pbuf *p, struct netif *netif,
                              pcap_rate_packet_direction_t direction)
{
    if (!pcap_rate_active || pcap_rate_packet_queue == NULL || p == NULL ||
        p->tot_len == 0 || p->tot_len > 1600) {
        return false;
    }
    pcap_rate_queued_packet_t *packet = heap_caps_malloc(sizeof(*packet) + p->tot_len,
                                                         MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    if (packet == NULL) {
        packet = heap_caps_malloc(sizeof(*packet) + p->tot_len,
                                  MALLOC_CAP_8BIT);
    }
    if (packet == NULL) {
        pcap_rate_note_drop();
        return false;
    }
    packet->netif = netif;
    packet->direction = direction;
    packet->len = p->tot_len;
    packet->timestamp_us = esp_timer_get_time();
    if (pbuf_copy_partial(p, packet->data, packet->len, 0) != packet->len) {
        heap_caps_free(packet);
        pcap_rate_note_drop();
        return false;
    }
    if (xQueueSend(pcap_rate_packet_queue, &packet, 0) != pdTRUE) {
        heap_caps_free(packet);
        pcap_rate_note_drop();
        return false;
    }
    pcap_rate_note_queued();
    return true;
}

static err_t pcap_netif_input_hook(struct pbuf *p, struct netif *inp) {
    if (pcap_capture_mode == PCAP_MODE_GATEWAY && pcap_rate_active) {
        // Copy out of the driver-owned RX buffer; holding that pbuf in a slow
        // queue could exhaust the Wi-Fi driver's finite RX buffer pool.
        pcap_rate_enqueue(p, inp, PCAP_RATE_PACKET_INPUT);
        if (p != NULL) {
            pbuf_free(p);
        }
        return ERR_OK;
    }
    pcap_capture_pbuf(p);
    return pcap_original_input(p, inp);
}

static err_t pcap_netif_linkoutput_hook(struct netif *netif, struct pbuf *p) {
    if (pcap_capture_mode == PCAP_MODE_GATEWAY && pcap_rate_active) {
        if (pcap_rate_enqueue(p, netif, PCAP_RATE_PACKET_LINKOUTPUT)) {
            return ERR_OK;
        }
        // The caller still owns its reference. Returning ERR_MEM lets TCP/lwIP
        // retry instead of pretending that the frame was transmitted.
        return ERR_MEM;
    }
    pcap_capture_pbuf(p);
    return pcap_original_linkoutput(netif, p);
}

static bool pcap_rate_limiter_start(void)
{
    pcap_rate_packet_queue = xQueueCreate(PCAP_RATE_QUEUE_LENGTH,
                                          sizeof(pcap_rate_queued_packet_t *));
    if (pcap_rate_packet_queue == NULL) {
        return false;
    }
    pcap_rate_active = true;
    if (xTaskCreate(pcap_rate_limiter_task, "pcap_rate", 4096, NULL, 16,
                    &pcap_rate_task_handle) != pdPASS) {
        pcap_rate_active = false;
        vQueueDelete(pcap_rate_packet_queue);
        pcap_rate_packet_queue = NULL;
        return false;
    }
    return true;
}

static void pcap_rate_limiter_stop(void)
{
    pcap_rate_active = false;
    for (int i = 0; i < 500 && pcap_rate_task_handle != NULL; i++) {
        vTaskDelay(pdMS_TO_TICKS(20));
    }
    if (pcap_rate_task_handle != NULL) {
        vTaskDelete(pcap_rate_task_handle);
        pcap_rate_task_handle = NULL;
    }
    if (pcap_rate_packet_queue != NULL) {
        pcap_rate_queued_packet_t *packet = NULL;
        while (xQueueReceive(pcap_rate_packet_queue, &packet, 0) == pdTRUE) {
            if (packet != NULL) {
                heap_caps_free(packet);
                pcap_rate_note_drop();
            }
        }
        vQueueDelete(pcap_rate_packet_queue);
        pcap_rate_packet_queue = NULL;
    }
    portENTER_CRITICAL(&pcap_stats_lock);
    pcap_rate_effective_kbps = 0;
    portEXIT_CRITICAL(&pcap_stats_lock);
}

static uint32_t pcap_rate_for_recorder_depth(uint32_t max_kbps,
                                             uint32_t recorder_depth)
{
    uint32_t effective_kbps = max_kbps;
    if (recorder_depth >= PCAP_ADAPTIVE_PAUSE_DEPTH) {
        return 0;
    }
    if (recorder_depth >= PCAP_ADAPTIVE_THREE_QUARTER_DEPTH) {
        effective_kbps = max_kbps / 4U;
    } else if (recorder_depth >= PCAP_ADAPTIVE_HALF_DEPTH) {
        effective_kbps = max_kbps / 2U;
    }
    if (effective_kbps > 0 && effective_kbps < PCAP_RATE_LIMIT_MIN_KBPS) {
        effective_kbps = PCAP_RATE_LIMIT_MIN_KBPS;
    }
    return effective_kbps;
}

static void pcap_rate_publish_effective(uint32_t effective_kbps,
                                        bool throttle_transition,
                                        bool pause_transition)
{
    portENTER_CRITICAL(&pcap_stats_lock);
    pcap_rate_effective_kbps = effective_kbps;
    if (throttle_transition) {
        pcap_rate_throttle_event_count++;
    }
    if (pause_transition) {
        pcap_rate_pause_event_count++;
    }
    portEXIT_CRITICAL(&pcap_stats_lock);
}

static void pcap_rate_limiter_task(void *param)
{
    (void)param;
    const uint32_t max_kbps = PCAP_GATEWAY_RATE_LIMIT_KBPS;
    const uint64_t max_bytes_per_second =
        ((uint64_t)max_kbps * 1000ULL) / 8ULL;
    uint64_t burst_bytes = max_bytes_per_second / 4ULL;
    if (burst_bytes < PCAP_RATE_BURST_MIN_BYTES) {
        burst_bytes = PCAP_RATE_BURST_MIN_BYTES;
    }
    if (burst_bytes > PCAP_WRITE_BATCH_SIZE) {
        burst_bytes = PCAP_WRITE_BATCH_SIZE;
    }
    uint64_t tokens = burst_bytes;
    int64_t last_refill_us = esp_timer_get_time();
    pcap_rate_queued_packet_t *packet = NULL;
    uint32_t last_effective_kbps = max_kbps;
    bool recorder_paused = false;

