brokali/projectZeroTouch/ESP32C5/main/main.c
// Safely unmount SD card and restart to prevent FAT filesystem corruption
static void safe_restart(void) {
    if (sd_card_mounted && sd_card_handle) {
        MY_LOG_INFO(TAG, "Unmounting SD card before restart...");
        esp_vfs_fat_sdcard_unmount("/sdcard", sd_card_handle);
        sd_card_mounted = false;
        sd_card_handle = NULL;
        sd_mount_freq_khz = 0;
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    esp_restart();
}

static esp_err_t init_sd_card(void) {
    esp_err_t ret;
    
    // Check if SD card is already mounted
    if (sd_card_mounted) {
        return ESP_OK;
    }
    if (sd_last_init_error != ESP_OK) {
        return sd_last_init_error;
    }
    
    // Options for mounting the filesystem (optimized for low memory)
    esp_vfs_fat_sdmmc_mount_config_t mount_config = {
        .format_if_mount_failed = false,  // Don't format automatically to save memory
        .max_files = 5,                   // Increased to 5 for password logging
        .allocation_unit_size = 0,        // Use default (512 bytes) to save memory
        .disk_status_check_enable = false
    };
    
    const char mount_point[] = "/sdcard";
    
    // Configure SPI bus (balanced for SD card requirements and memory)
    spi_bus_config_t bus_cfg = {
        .mosi_io_num = SD_MOSI_PIN,
        .miso_io_num = SD_MISO_PIN,
        .sclk_io_num = SD_CLK_PIN,
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = 4096,  // SD card needs at least 4KB for sector operations
    };
    
    ret = spi_bus_initialize(SPI2_HOST, &bus_cfg, SPI_DMA_CH_AUTO);  // DMA required for SD card
    if (ret != ESP_OK && ret != ESP_ERR_INVALID_STATE) {
        MY_LOG_INFO(TAG, "Failed to initialize SPI bus: %s", esp_err_to_name(ret));
        return ret;
    }
    
    // Initialize the SD card host
    sdmmc_host_t host = SDSPI_HOST_DEFAULT();
    host.slot = SPI2_HOST;
    
    sdspi_device_config_t slot_config = SDSPI_DEVICE_CONFIG_DEFAULT();
    slot_config.gpio_cs = SD_CS_PIN;
    slot_config.host_id = host.slot;

    // Some cards are unstable at higher SPI clock rates during init.
    const int mount_freqs_khz[] = {SDMMC_FREQ_DEFAULT, 10000, 4000};
    const size_t mount_freqs_count = sizeof(mount_freqs_khz) / sizeof(mount_freqs_khz[0]);
    int attempted_freqs[3] = {0};
    for (size_t i = 0; i < mount_freqs_count; i++) {
        host.max_freq_khz = mount_freqs_khz[i];
        attempted_freqs[i] = host.max_freq_khz;
        ret = esp_vfs_fat_sdspi_mount(mount_point, &host, &slot_config, &mount_config, &sd_card_handle);
        if (ret == ESP_OK) {
            sd_mount_freq_khz = host.max_freq_khz;
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(60));
    }
    
    if (ret != ESP_OK) {
        sd_mount_freq_khz = 0;
        sd_last_init_error = ret;
        if (ret == ESP_FAIL) {
            MY_LOG_INFO(TAG, "SD: not mounted (filesystem unsupported/corrupted). File-backed features disabled.");
        } else {
            MY_LOG_INFO(TAG, "SD: not detected (%s after %d/%d/%d kHz). File-backed features disabled.",
                        esp_err_to_name(ret), attempted_freqs[0], attempted_freqs[1], attempted_freqs[2]);
        }
        return ret;
    }
    sd_last_init_error = ESP_OK;
    
    // Print card info (single line)
    uint64_t size_mb = ((uint64_t)sd_card_handle->csd.capacity) * sd_card_handle->csd.sector_size / (1024 * 1024);
    MY_LOG_INFO(TAG, "SD: %s %lluMB", sd_card_handle->cid.name, size_mb);

    // Test file creation to verify write access
    FILE *test_file = fopen("/sdcard/test.txt", "w");
    if (test_file != NULL) {
        fprintf(test_file, "Test write\n");
        fclose(test_file);
        unlink("/sdcard/test.txt");
        sd_sync();
    } else {
        MY_LOG_INFO(TAG, "SD write test failed, errno: %d (%s)", errno, strerror(errno));
    }
    
    // Mark SD card as successfully mounted
    sd_card_mounted = true;
    
    return ESP_OK;
}

static bool sd_mkdir_recursive(const char *path) {
    if (!path || path[0] == '\0') {
        return false;
    }

    char tmp[384];
    if (strlcpy(tmp, path, sizeof(tmp)) >= sizeof(tmp)) {
        return false;
    }

    for (char *p = tmp + 1; *p; p++) {
        if (*p == '/') {
            *p = '\0';
            struct stat st;
            if (stat(tmp, &st) == 0) {
                if (!S_ISDIR(st.st_mode)) {
                    errno = ENOTDIR;
                    return false;
                }
            } else if (mkdir(tmp, 0755) != 0 && errno != EEXIST) {
                return false;
            } else if (stat(tmp, &st) != 0 || !S_ISDIR(st.st_mode)) {
                errno = ENOTDIR;
                return false;
            }
            *p = '/';
        }
    }

    struct stat st;
    if (stat(tmp, &st) == 0) {
        if (S_ISDIR(st.st_mode)) {
            return true;
        }
        errno = ENOTDIR;
        return false;
    }

    if (mkdir(tmp, 0755) != 0 && errno != EEXIST) {
        return false;
    }
    return stat(tmp, &st) == 0 && S_ISDIR(st.st_mode);
}

// Create necessary directories on SD card
static esp_err_t create_sd_directories(void) {
    struct stat st;
    
    static const char * const dirs[] = {
        "/sdcard/lab",
        "/sdcard/lab/htmls",
        "/sdcard/lab/handshakes",
        "/sdcard/lab/wardrives",
        "/sdcard/lab/wardrives/uploaded",
        "/sdcard/lab/pcaps",
    };
    for (int i = 0; i < (int)(sizeof(dirs) / sizeof(dirs[0])); i++) {
        if (!sd_mkdir_recursive(dirs[i])) {
            MY_LOG_INFO(TAG, "mkdir %s failed: %s", dirs[i], strerror(errno));
            return ESP_FAIL;
        }
        if (stat(dirs[i], &st) == 0 && !S_ISDIR(st.st_mode)) {
            MY_LOG_INFO(TAG, "%s exists but is not a directory", dirs[i]);
            return ESP_FAIL;
        }
        if (i == 0 || strcmp(dirs[i], "/sdcard/lab/wardrives") == 0 ||
            strcmp(dirs[i], "/sdcard/lab/wardrives/uploaded") == 0) {
            sd_sync();
        }
    }
    return ESP_OK;
}

// Copy the idx-th comma-separated field of an NMEA sentence into out.
// Unlike strtok, empty fields are preserved (",," advances the index), which is
// required for RMC where optional fields (speed/course) may be blank yet later
// fields (the date) must still land at their fixed positions. Returns false if
// the field index does not exist.
static bool nmea_get_field(const char *s, int idx, char *out, size_t outsz) {
    int f = 0;
    const char *start = s;
    for (;; s++) {
        char c = *s;
        if (c == ',' || c == '*' || c == '\0') {
            if (f == idx) {
                size_t n = (size_t)(s - start);
                if (n >= outsz) n = outsz - 1;
                memcpy(out, start, n);
                out[n] = '\0';
                return true;
            }
            if (c == '\0' || c == '*') break;   // end of sentence / checksum marker
            f++;
            start = s + 1;
        }
    }
    return false;
}

// Seed the ESP32 system clock from a GPS UTC date+time (from $GxRMC). Runs once,
// then only re-corrects on drift > 2 s so we don't call settimeofday every second.
static void gps_seed_clock_from_utc(int yy, int mo, int dd, int hh, int mi, int ss) {
    if (mo < 1 || mo > 12 || dd < 1 || dd > 31 || hh > 23 || mi > 59 || ss > 61) return;
    static bool tz_set = false;
    if (!tz_set) { setenv("TZ", "UTC0", 1); tzset(); tz_set = true; }  // mktime() == UTC epoch
    struct tm t = {0};
    t.tm_year = (2000 + yy) - 1900;
    t.tm_mon  = mo - 1;
    t.tm_mday = dd;
    t.tm_hour = hh;
    t.tm_min  = mi;
    t.tm_sec  = ss;
    t.tm_isdst = 0;
    time_t epoch = mktime(&t);
    if (epoch <= 0) return;
    time_t now = time(NULL);
    long drift = (long)(now > epoch ? now - epoch : epoch - now);
    if (!g_gps_clock_synced || drift > 2) {
        struct timeval tv = { .tv_sec = epoch, .tv_usec = 0 };
        settimeofday(&tv, NULL);
        g_gps_clock_synced = true;
    }
}

static bool parse_gps_nmea(const char* nmea_sentence) {
    if (!nmea_sentence || strlen(nmea_sentence) < 10) {
        return false;
    }

