brokali/projectZeroTouch/ESP32C5/main/main.c
    // Parse GPRMC/GNRMC for real UTC date+time and seed the system clock. GGA carries
    // only time-of-day (no date), so RMC is what makes WiGLE FirstSeen a real timestamp.
    if (strncmp(nmea_sentence, "$GPRMC", 6) == 0 || strncmp(nmea_sentence, "$GNRMC", 6) == 0) {
        char utc[16] = "", status[4] = "", date[12] = "";
        nmea_get_field(nmea_sentence, 1, utc, sizeof(utc));      // HHMMSS(.sss)
        nmea_get_field(nmea_sentence, 2, status, sizeof(status)); // A=valid, V=void
        nmea_get_field(nmea_sentence, 9, date, sizeof(date));     // DDMMYY
        if (status[0] == 'A' && strlen(utc) >= 6 && strlen(date) == 6) {
            int hh = (utc[0]-'0')*10 + (utc[1]-'0');
            int mi = (utc[2]-'0')*10 + (utc[3]-'0');
            int ss = (utc[4]-'0')*10 + (utc[5]-'0');
            int dd = (date[0]-'0')*10 + (date[1]-'0');
            int mo = (date[2]-'0')*10 + (date[3]-'0');
            int yy = (date[4]-'0')*10 + (date[5]-'0');
            gps_seed_clock_from_utc(yy, mo, dd, hh, mi, ss);
        }
        return true;  // RMC handled; lat/lon come from GGA
    }

    // Parse GPGGA sentence for basic GPS data
    if (strncmp(nmea_sentence, "$GPGGA", 6) == 0 || strncmp(nmea_sentence, "$GNGGA", 6) == 0) {
        char sentence[256];
        strncpy(sentence, nmea_sentence, sizeof(sentence) - 1);
        sentence[sizeof(sentence) - 1] = '\0';
        
        char *token = strtok(sentence, ",");
        int field = 0;
        float lat_deg = 0, lat_min = 0;
        float lon_deg = 0, lon_min = 0;
        char lat_dir = 'N', lon_dir = 'E';
        int quality = 0;
        float altitude = 0;
        float hdop = 1.0;
        
        while (token != NULL) {
            switch (field) {
                case 2: // Latitude DDMM.MMMM
                    if (strlen(token) > 4) {
                        lat_deg = (token[0] - '0') * 10 + (token[1] - '0');
                        lat_min = atof(token + 2);
                    }
                    break;
                case 3: // Latitude direction
                    lat_dir = token[0];
                    break;
                case 4: // Longitude DDDMM.MMMM
                    if (strlen(token) > 5) {
                        lon_deg = (token[0] - '0') * 100 + (token[1] - '0') * 10 + (token[2] - '0');
                        lon_min = atof(token + 3);
                    }
                    break;
                case 5: // Longitude direction
                    lon_dir = token[0];
                    break;
                case 6: // GPS quality
                    quality = atoi(token);
                    break;
                case 7: // Number of satellites
                    current_gps.satellites = atoi(token);
                    break;
                case 8: // HDOP
                    hdop = atof(token);
                    break;
                case 9: // Altitude
                    altitude = atof(token);
                    break;
            }
            token = strtok(NULL, ",");
            field++;
        }
        
        if (quality > 0) {
            // Convert to decimal degrees
            current_gps.latitude = lat_deg + lat_min / 60.0;
            if (lat_dir == 'S') current_gps.latitude = -current_gps.latitude;
            
            current_gps.longitude = lon_deg + lon_min / 60.0;
            if (lon_dir == 'W') current_gps.longitude = -current_gps.longitude;
            
            current_gps.altitude = altitude;
            current_gps.accuracy = hdop * 4.0; // Rough accuracy estimate
            current_gps.valid = true;
            
            return true;
        } else {
            current_gps.satellites = 0;
            current_gps.valid = false;
            return false;
        }
    }
    
    return false;
}

// Format an absolute UTC epoch as WiGLE-style "YYYY-MM-DD HH:MM:SS".
static void format_epoch_utc(time_t t, char* buffer, size_t size) {
    struct tm tmv;
    gmtime_r(&t, &tmv);
    strftime(buffer, size, "%Y-%m-%d %H:%M:%S", &tmv);
}

// Real wall-clock timestamp (UTC). Requires the clock to have been seeded from GPS
// $GxRMC (see gps_seed_clock_from_utc). If not yet seeded the epoch is near 1970,
// which is deliberately obvious rather than a plausible-but-fake value.
static void get_timestamp_string(char* buffer, size_t size) {
    format_epoch_utc(time(NULL), buffer, size);
}

static const char* get_auth_mode_wiggle(wifi_auth_mode_t mode) {
    switch(mode) {
        case WIFI_AUTH_OPEN:
            return "Open";
        case WIFI_AUTH_WEP:
            return "WEP";
        case WIFI_AUTH_WPA_PSK:
            return "WPA_PSK";
        case WIFI_AUTH_WPA2_PSK:
            return "WPA2_PSK";
        case WIFI_AUTH_WPA_WPA2_PSK:
            return "WPA_WPA2_PSK";
        case WIFI_AUTH_WPA2_ENTERPRISE:
            return "WPA2_ENTERPRISE";
        case WIFI_AUTH_WPA3_PSK:
            return "WPA3_PSK";
        case WIFI_AUTH_WPA2_WPA3_PSK:
            return "WPA2_WPA3_PSK";
        case WIFI_AUTH_WAPI_PSK:
            return "WAPI_PSK";
        default:
            return "Unknown";
    }
}

static bool wait_for_gps_fix(int timeout_seconds) {
    int elapsed = 0;
    bool infinite = (timeout_seconds <= 0);
    const bool external_feed = gps_module_uses_external_feed(current_gps_module);

    if (!external_feed) {
        current_gps.valid = false;
    }
    
    if (infinite && external_feed) {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (external feed, no timeout, use '%s' or 'stop')...",
                    gps_external_position_command_name(current_gps_module));
    } else if (infinite) {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (no timeout, use 'stop' to cancel)...");
    } else if (external_feed) {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (external feed, timeout: %d seconds)...", timeout_seconds);
    } else {
        MY_LOG_INFO(TAG, "Waiting for GPS fix (timeout: %d seconds)...", timeout_seconds);
    }
    
    while (infinite || elapsed < timeout_seconds) {
        // Check for stop request
        if (operation_stop_requested) {
            MY_LOG_INFO(TAG, "GPS wait: Stop requested, terminating...");
            return false;
        }

        if (external_feed) {
            gps_sync_from_selected_external_source();
            if (current_gps.valid) {
                return true;
            }
            vTaskDelay(pdMS_TO_TICKS(1000));
        } else {
            // Read GPS data from UART/NMEA source
            int len = uart_read_bytes(GPS_UART_NUM, (uint8_t*)wardrive_gps_buffer, GPS_BUF_SIZE - 1, pdMS_TO_TICKS(1000));
            if (len > 0) {
                wardrive_gps_buffer[len] = '\0';
                char* line = strtok(wardrive_gps_buffer, "\r\n");
                while (line != NULL) {
                    if (parse_gps_nmea(line)) {
                        if (current_gps.valid) {
                            return true;  // GPS fix obtained
                        }
                    }
                    line = strtok(NULL, "\r\n");
                }
            }
        }
        
        elapsed++;
        if (elapsed % 10 == 0) {  // Print status every 10 seconds
            if (infinite) {
                if (external_feed) {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix (external feed)... (%d seconds)", elapsed);
                } else {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix... (%d seconds)", elapsed);
                }
            } else {
                if (external_feed) {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix (external feed)... (%d/%d seconds)", elapsed, timeout_seconds);
                } else {
                    MY_LOG_INFO(TAG, "Still waiting for GPS fix... (%d/%d seconds)", elapsed, timeout_seconds);
                }
            }
        }
    }
    
    return false;  // Timeout reached without GPS fix
}

static int find_next_wardrive_file_number(void) {
    int max_number = 0;
    char filename[80];
    MY_LOG_INFO(TAG, "Scanning for existing wardrive session files...");
    // A session "occupies" a number if ANY of its artifacts exist: the CSV log, the
    // finalized track KML, or a not-yet-committed ".inprogress.kml" from a run that
    // lost power. Considering all three means we never overwrite a partial trace.
    for (int i = 1; i <= 9999; i++) {
        struct stat st;
        bool exists = false;

