brokali/projectZeroTouch/ESP32C5/main/main.c
        snprintf(filename, sizeof(filename), "/sdcard/lab/wardrives/w%d.log", i);
        if (stat(filename, &st) == 0) exists = true;
        if (!exists) {
            snprintf(filename, sizeof(filename), "/sdcard/lab/wardrives/w%d_track.kml", i);
            if (stat(filename, &st) == 0) exists = true;
        }
        if (!exists) {
            snprintf(filename, sizeof(filename), "/sdcard/lab/wardrives/w%d_track.inprogress.kml", i);
            if (stat(filename, &st) == 0) exists = true;
        }

        if (exists) {
            max_number = i;
        } else {
            // First fully-free number; contiguous scan is enough for our sequential naming.
            break;
        }
    }

    int next_number = max_number + 1;
    MY_LOG_INFO(TAG, "Highest existing session number: %d, next will be: %d", max_number, next_number);

    return next_number;
}

// Build the base name for a wardrive session; files are "{base}.log", "{base}_track.kml"
// and "{base}_track.inprogress.kml". Once the clock is seeded from GPS ($GxRMC), the base
// is real UTC time "YYYYMMDD_HHMMSS" (same clock as the CSV FirstSeen, chronologically
// sortable). Without a synced clock it falls back to the legacy "wN" counter. A short
// numeric suffix is appended if that base is already taken, so nothing is ever overwritten
// and archived files never collide.
static void wardrive_make_session_base(char *out, size_t out_sz) {
    char raw[24];
    if (g_gps_clock_synced) {
        time_t now = time(NULL);
        struct tm tmv;
        gmtime_r(&now, &tmv);
        strftime(raw, sizeof(raw), "%Y%m%d_%H%M%S", &tmv);   // UTC
    } else {
        snprintf(raw, sizeof(raw), "w%d", find_next_wardrive_file_number());
    }

    for (int suffix = 0; suffix < 100; suffix++) {
        if (suffix == 0) snprintf(out, out_sz, "%s", raw);
        else             snprintf(out, out_sz, "%s_%d", raw, suffix);

        struct stat st;
        char probe[96];
        bool taken = false;
        snprintf(probe, sizeof(probe), "/sdcard/lab/wardrives/%s.log", out);
        if (stat(probe, &st) == 0) taken = true;
        if (!taken) {
            snprintf(probe, sizeof(probe), "/sdcard/lab/wardrives/%s_track.kml", out);
            if (stat(probe, &st) == 0) taken = true;
        }
        if (!taken) {
            snprintf(probe, sizeof(probe), "/sdcard/lab/wardrives/%s_track.inprogress.kml", out);
            if (stat(probe, &st) == 0) taken = true;
        }
        if (!taken) return;
    }
    // 100 collisions in the same second is not realistic; keep the last candidate.
}

static int find_next_pcap_file_number(void) {
    int max_number = 0;
    char filename[64];
    for (int i = 1; i <= 9999; i++) {
        snprintf(filename, sizeof(filename), "/sdcard/lab/pcaps/sniff_%d.pcap", i);
        struct stat file_stat;
        if (stat(filename, &file_stat) == 0) {
            max_number = i;
        } else {
            break;
        }
    }
    return max_number + 1;
}

// Save evil twin password to SD card
static void save_evil_twin_password(const char* ssid, const char* password) {
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card for password logging: %s", esp_err_to_name(ret));
        return;
    }
    
    // Check if /sdcard directory is accessible
    struct stat st;
    if (stat("/sdcard", &st) != 0) {
        MY_LOG_INFO(TAG, "Error: /sdcard directory not accessible");
        return;
    }
    
    // Check for duplicate before writing
    char match_line[256];
    snprintf(match_line, sizeof(match_line), "\"%s\", \"%s\"", ssid, password);
    
    FILE *file = fopen("/sdcard/lab/eviltwin.txt", "r");
    if (file != NULL) {
        char line[256];
        while (fgets(line, sizeof(line), file) != NULL) {
            if (strstr(line, match_line) != NULL) {
                fclose(file);
                MY_LOG_INFO(TAG, "Credentials already in eviltwin.txt, skipping");
                return;
            }
        }
        fclose(file);
    }
    
    // Try to open file for appending (use short name without underscore for FAT compatibility)
    file = fopen("/sdcard/lab/eviltwin.txt", "a");
    if (file == NULL) {
        MY_LOG_INFO(TAG, "Failed to open eviltwin.txt for append, errno: %d (%s). Trying to create...", errno, strerror(errno));
        
        // Try to create the file first
        file = fopen("/sdcard/lab/eviltwin.txt", "w");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to create eviltwin.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        // Close and reopen in append mode
        fclose(file);
        file = fopen("/sdcard/lab/eviltwin.txt", "a");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to reopen eviltwin.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        MY_LOG_INFO(TAG, "Successfully created eviltwin.txt");
    }
    
    // Write SSID and password in CSV format
    fprintf(file, "\"%s\", \"%s\"\n", ssid, password);
    
    // Flush and close file to ensure data is written to disk
    fflush(file);
    fclose(file);
    sd_sync();
    
    MY_LOG_INFO(TAG, "Password saved to eviltwin.txt");
}

// Save portal form data to SD card
static void save_portal_data(const char* ssid, const char* form_data) {
    {
        const char *mode_name = karma_mode_active ? "> Karma Attack" :
                                rogueap_mode_active ? "> Rogue AP" : "> Captive Portal";
        oled_display_update_full(mode_name, ssid ? ssid : "", "  Data received!", "  Saving to SD");
    }
    // Initialize SD card if not already mounted
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "Failed to initialize SD card for portal data logging: %s", esp_err_to_name(ret));
        return;
    }
    
    // Check if /sdcard directory is accessible
    struct stat st;
    if (stat("/sdcard", &st) != 0) {
        MY_LOG_INFO(TAG, "Error: /sdcard directory not accessible");
        return;
    }
    
    // Try to open file for appending
    FILE *file = fopen("/sdcard/lab/portals.txt", "a");
    if (file == NULL) {
        MY_LOG_INFO(TAG, "Failed to open portals.txt for append, errno: %d (%s). Trying to create...", errno, strerror(errno));
        
        // Try to create the file first
        file = fopen("/sdcard/lab/portals.txt", "w");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to create portals.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        // Close and reopen in append mode
        fclose(file);
        file = fopen("/sdcard/lab/portals.txt", "a");
        if (file == NULL) {
            MY_LOG_INFO(TAG, "Failed to reopen portals.txt, errno: %d (%s)", errno, strerror(errno));
            return;
        }
        MY_LOG_INFO(TAG, "Successfully created portals.txt");
    }
    
    // Write SSID as first field
    fprintf(file, "\"%s\", ", ssid ? ssid : "Unknown");
    
    // Parse form data and extract all fields
    // Form data is in format: field1=value1&field2=value2&...
    char *data_copy = strdup(form_data);
    if (data_copy == NULL) {
        fclose(file);
        sd_sync();
        return;
    }
    
    // Count fields first to properly format CSV
    int field_count = 0;
    char *temp_copy = strdup(form_data);
    if (temp_copy == NULL) {
        MY_LOG_INFO(TAG, "Memory allocation failed for temp_copy");
        free(data_copy);
        fclose(file);
        sd_sync();
        return;
    }
    
