brokali/projectZeroTouch/ESP32C5/main/main.c
    char *token = strtok(temp_copy, "&");
    while (token != NULL) {
        field_count++;
        token = strtok(NULL, "&");
    }
    free(temp_copy);
    
    // Now process each field
    int current_field = 0;
    token = strtok(data_copy, "&");
    while (token != NULL) {
        char *equals = strchr(token, '=');
        if (equals != NULL) {
            *equals = '\0';
            char *key = token;
            char *value = equals + 1;

            // URL decode the key
            char decoded_key[128];
            int decoded_key_len = 0;
            for (char *p = key; *p && decoded_key_len < sizeof(decoded_key) - 1; p++) {
                if (*p == '%' && p[1] && p[2]) {
                    char hex[3] = {p[1], p[2], '\0'};
                    decoded_key[decoded_key_len++] = (char)strtol(hex, NULL, 16);
                    p += 2;
                } else if (*p == '+') {
                    decoded_key[decoded_key_len++] = ' ';
                } else {
                    decoded_key[decoded_key_len++] = *p;
                }
            }
            decoded_key[decoded_key_len] = '\0';

            // URL decode the value
            char decoded_value[128];
            int decoded_len = 0;
            for (char *p = value; *p && decoded_len < sizeof(decoded_value) - 1; p++) {
                if (*p == '%' && p[1] && p[2]) {
                    char hex[3] = {p[1], p[2], '\0'};
                    decoded_value[decoded_len++] = (char)strtol(hex, NULL, 16);
                    p += 2;
                } else if (*p == '+') {
                    decoded_value[decoded_len++] = ' ';
                } else {
                    decoded_value[decoded_len++] = *p;
                }
            }
            decoded_value[decoded_len] = '\0';

            // Write field name and value in CSV format as key=value
            fprintf(file, "\"%s=%s\"", decoded_key, decoded_value);

            // Add comma if not last field
            current_field++;
            if (current_field < field_count) {
                fprintf(file, ", ");
            }
        }
        token = strtok(NULL, "&");
    }
    
    // End line
    fprintf(file, "\n");
    
    // Flush and close file to ensure data is written to disk
    fflush(file);
    fclose(file);
    sd_sync();
    
    free(data_copy);
    
    MY_LOG_INFO(TAG, "Portal data saved to portals.txt");
}

// Load whitelist from SD card
static void load_whitelist_from_sd(void) {
    whitelistedBssidsCount = 0; // Reset count
    
    // Try to initialize SD card (silently fail if not available)
    esp_err_t ret = init_sd_card();
    if (ret != ESP_OK) {
        MY_LOG_INFO(TAG, "SD card not available - whitelist will be empty");
        return;
    }
    
    // Try to open white.txt file
    FILE *file = fopen("/sdcard/lab/white.txt", "r");
    if (file == NULL) {
        return;
    }
    
    MY_LOG_INFO(TAG, "Found white.txt, loading whitelisted BSSIDs...");
    
    char line[128];
    int line_number = 0;
    int loaded_count = 0;
    
    while (fgets(line, sizeof(line), file) != NULL && whitelistedBssidsCount < MAX_WHITELISTED_BSSIDS) {
        line_number++;
        
        // Remove trailing newline/whitespace
        line[strcspn(line, "\r\n")] = '\0';
        
        // Skip empty lines
        if (strlen(line) == 0) {
            continue;
        }
        
        // Parse BSSID in format: XX:XX:XX:XX:XX:XX or XX-XX-XX-XX-XX-XX
        uint8_t bssid[6];
        int matches = 0;
        
        // Try with colon separator
        matches = sscanf(line, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
                        &bssid[0], &bssid[1], &bssid[2],
                        &bssid[3], &bssid[4], &bssid[5]);
        
        // If that didn't work, try with dash separator
        if (matches != 6) {
            matches = sscanf(line, "%hhx-%hhx-%hhx-%hhx-%hhx-%hhx",
                            &bssid[0], &bssid[1], &bssid[2],
                            &bssid[3], &bssid[4], &bssid[5]);
        }
        
        if (matches == 6) {
            // Valid BSSID found, add to whitelist
            memcpy(whiteListedBssids[whitelistedBssidsCount].bssid, bssid, 6);
            whitelistedBssidsCount++;
            loaded_count++;
            
            MY_LOG_INFO(TAG, "  [%d] Loaded: %02X:%02X:%02X:%02X:%02X:%02X",
                       loaded_count,
                       bssid[0], bssid[1], bssid[2],
                       bssid[3], bssid[4], bssid[5]);
        } else {
            MY_LOG_INFO(TAG, "  Line %d: Invalid BSSID format, ignoring: %s", line_number, line);
        }
    }
    
    fclose(file);
    
    if (whitelistedBssidsCount > 0) {
        MY_LOG_INFO(TAG, "Successfully loaded %d whitelisted BSSID(s)", whitelistedBssidsCount);
    } else {
        MY_LOG_INFO(TAG, "No valid BSSIDs found in white.txt");
    }
}

// Check if a BSSID is in the whitelist
static bool is_bssid_whitelisted(const uint8_t *bssid) {
    if (bssid == NULL || whitelistedBssidsCount == 0) {
        return false;
    }
    
    for (int i = 0; i < whitelistedBssidsCount; i++) {
        if (memcmp(bssid, whiteListedBssids[i].bssid, 6) == 0) {
            return true;
        }
    }
    
    return false;
}


